<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML//EN">
<html><head><title>Preguntas Frecuentes Acerca De La UNED</title></head>
<body bgcolor="white">

  <h1>Preguntas Frecuentes Acerca De La UNED</h1>
  <p><B>AVISO. Muchas de las respuestas pueden estar obsoletas</B></p>


<h1>&Iacute;ndice</h1>


<p><b>Principiantes</b>:</p>
<ul>
      <li><a href="#que-es-uned">&iquest;Qu&eacute; es la UNED?</a></li>
      <li><a href="#que-significa">&iquest;Qu&eacute; significa estudiar a distancia en la UNED?</a></li>
      <li><a href="#que-hacer">&iquest;Qu&eacute; tengo que hacer para empezar una carrera en la UNED?</a></li>
      <li><a href="#de-cuantas">&iquest;De cu&aacute;ntas asignaturas me puedo matricular?</a></li>
      <li><a href="#cuantas-horas">&iquest;Cu&aacute;ntas horas estudiais al d&iacute;a?</a></li>
      <li><a href="#como-carnet">&iquest;C&oacute;mo consigo el carnet de la biblioteca?</a></li>
      <li><a href="#como-examenes">&iquest;C&oacute;mo puedo conseguir ex&aacute;menes de otros a&ntilde;os?</a></li>
      <li><a href="#como-convalidar">&iquest;C&oacute;mo puedo saber si me convalidar&aacute;n la asignatura X que aprob&eacute; en mi universidad?</a></li>
      <li><a href="#clases-presenciales">&iquest;En la UNED hay clases presenciales?</a></li>
      <li><a href="#cuantas-asignaturas">&iquest;Cu&aacute;ntas asignaturas puedo esperar aprobar por cuatrimestre?</a></li>
      <li><a href="#diferencia-uned-presencial">&iquest;Hay mucha diferencia entre estudiar a distancia en la uned o hacerlo en una universidad presencial?</a></li>
      <li><a href="#a-que-personas">&iquest;A qu&eacute; personas les puede venir bien estudiar en la UNED?</a></li>
      <li><a href="#p+f-uned">&iquest;Hay preguntas frecuentes oficiales de la UNED?</a></li>
</ul>
    <p><b>Veteranos</b>:</p>
<ul>
      <li><a href="#consejos-examenes">&iquest;Alg&uacute;n consejo de cara a los ex&aacute;menes?</a></li>
      <li><a href="#examen-reserva">&iquest;Conoces el procedimiento para hacer el examen de reserva? Me coinciden dos ex&aacute;menes a la misma hora</a></li>
      <li><a href="#examinarme-centro">&iquest;Puedo examinarme en cualquier Centro Asociado?</a></li>
      <li><a href="#recurso-rectora">He de poner un recurso a la rectora de la uned &iquest;d&oacute;nde puedo enviarlo?</a></li>
      <li><a href="#convocatoria-gracia">&iquest;Qu&eacute; tengo que hacer para pedir una convocatoria de gracia?</a></li>
      <li><a href="#anular-matricula">&iquest;C&oacute;mo anulo o modifico la matricula?</a></li>
      <li><a href="#desde-otra">Vengo de otra universidad y quiero acabar mi carrera en la UNED &iquest;C&oacute;mo me convalidan?</a></li>
<!--      <li><a href="#representacion">&iquest;C&oacute;mo funciona la representaci&oacute;n del alumnado?</a></li>-->

</ul>

<p><b>Licencia</b></p>

<p>Se permite la copia, distribuci&oacute;n y/o modificaci&oacute;n de este documento
bajo los t&eacute;rminos de la GNU Free Documentation License, Version 1.3 o
posteriores versiones publicadas por la Free Software Foundation; sin
secciones invariantes, con texto al inicio de la cubierta de portada
'A GNU Manual', y con el texto de contraportada como se muestra abajo
(a). Una copia de esta licencia est&aacute; incluida en la secci&oacute;n titulada
GNU Free Documentation License.

<p>(a) El texto de contraportada de la FSF es: 'Tu tienes la libertad
para copiar y modificar este manual GNU, Comprando copias desde la FSF
se facilita el desarrollo de GNU y la promoci&oacute;n del software libre'.

<p>Este documento forma parte de una colecci&oacute;n distribuida bajo la GNU
Free Documentation License. Si desea distribuir este documento
separadamente de la colecci&oacute;n, puede hacerlo a&ntilde;adiendo una copia de la
licencia al documento, como se describe en la secci&oacute;n 6 de la
licencia.

<h1>Principiantes</h1>

<h2><a name="que-es-uned">&iquest;Qu&eacute; es la UNED?</a></h2>

<p>
Pues la siglas significan Universidad Nacional de Educaci&oacute;n a Distancia. Aunque tambi&eacute;n hay <a href="http://foruned.sindominio.net/pollBooth.pl?section=&amp;qid=8&amp;aid=-1">[otras acepciones]</a> ;D
</p><p>
</p><h2><a name="que-significa">&iquest;Qu&eacute; significa estudiar a distancia en la UNED?</a></h2>

<p>
Pues b&aacute;sicamente que tienes unos ex&aacute;menes con fecha fijada desde que te
matriculas, en los que tienes que demostrar que sabes lo que pone en
unos libros denominados bibliograf&iacute;a b&aacute;sica. Es posible que en tu
localidad haya una cosa que se llama tutor&iacute;as (clases de una hora y
media &oacute; dos) que te pueden hacer m&aacute;s f&aacute;cil el estudio si tienes suerte
y el profesor es m&iacute;nimamente bueno. </p><p>
</p>

<h2><a name="que-hacer">&iquest;Qu&eacute; tengo que hacer para empezar una carrera en la UNED?</a></h2>

<p>
Lo primero <a href="https://apliweb.uned.es/admision2005/">[rellenar la solicitud de admisi&oacute;n]</a> y lo segundo matricularte.
</p><p>
No te olvides de comprar la gu&iacute;a del curso al hacer la matr&iacute;cula, es
muy importante, contiene toda la informaci&oacute;n acerca de las asignaturas,
ex&aacute;menes, etc...
</p><p>
</p>

<h2><a name="de-cuantas">&iquest;De cu&aacute;ntas asignaturas me puedo matricular?</a></h2>

<p>En un mismo curso no puedes matricularte de mas de 10 asignaturas
anuales o 12 si son cuatrimestrales, 90 creditos. Pero si quieres
matricularte de m&aacute;s puedes solicitarlo a la comisi&oacute;n de ordenadi&oacute;n
academica explicando las razones. Con informes favorables de los
decanos y directores de escuela. </p><p>
</p><p>
</p><h2><a name="cuantas-horas">&iquest;Cu&aacute;ntas horas estudiais al d&iacute;a?</a></h2>

<p>
Eso depende de cuantas asignaturas tenga cada uno y de cu&aacute;ntas pretenda aprobar, te recomiendo <a href="http://foruned.sindominio.net/pollBooth.pl?section=&amp;qid=9&amp;aid=-1">[esta encuesta]</a>
</p><p>
</p><h2><a name="como-carnet">&iquest;C&oacute;mo consigo el carnet de la biblioteca?</a></h2>

<p>Si te has matriculado por internet, el carnet te lo mandan a casa
por correo. Como esto tardara mucho, te puedes acercar a la biblioteca
comentarselo y ellos te daran de alta y ya podras sacar libros.</p> 
<p>Para los que se han matriculado del modo tradicional esto es con el
sobre tienes que llevar el justificante de pago de la matr&iacute;cula, tu
carnet y una foto &oacute; tal vez dos.</p>
<p>Recordar que el carnet es valido desde que te matriculas hasta el 31 de octubre del a&ntilde;o siguiente.
Y que basta un solo carnet para todas las bibliotecas de la UNED.</p>
<p>
</p>

<h2><a name="como-examenes">&iquest;C&oacute;mo puedo conseguir ex&aacute;menes de otros a&ntilde;os?</a></h2>

<p>Si pones ex&aacute;menes uned en google llegas a <a href="http://www.calatayud.unedaragon.org/examenes/Deposito_Examenes/Examenes.asp">el centro asociado de calatayud</a>.
No obstante, en tu centro asociado puedes fotocopiar esos ex&aacute;menes y
las p&aacute;ginas de alumnos de tu carrera tambi&eacute;n pueden ser un buen sitio
donde encontrarlos.</p>

<p>
</p><h2><a name="como-convalidar">&iquest;C&oacute;mo puedo saber si me convalidar&aacute;n la asignatura X que aprob&eacute; en mi universidad?</a></h2>

<p>
Las convalidaciones se hacen por temarios, es decir, no hay una lista
de convalidaciones sino que se hace una a una. La &uacute;nica manera de
conocer si te convalidar&aacute;n t&uacute; mismo es que conozcas a alguien que pidi&oacute;
la misma convalidaci&oacute;n que t&uacute;. No obstante, una buena aproximaci&oacute;n
puede ser que pienses t&uacute; mismo si comparando los temarios la
convalidar&iacute;as si fueras un administrativo del negociado de alumnos.
</p><p>
</p><h2><a name="clases-presenciales">&iquest;En la UNED hay clases presenciales?</a></h2>

<p>S&iacute;, siempre y cuando tengas un centro asociado que imparta las
asignaturas en las que est&aacute;s matriculado y est&eacute; suficientemente cerca
de tu lugar de residencia como para que te compense desplazarte.
Normalmente suele ser una hora y media &oacute; dos horas de duraci&oacute;n en
funci&oacute;n de la carrera que est&eacute;s cursando.
</p><p>
</p><h2><a name="cuantas-asignaturas">&iquest;Cu&aacute;ntas asignaturas puedo esperar aprobar por cuatrimestre?</a></h2>

<p>
Eso depende de t&iacute;, pero no demasiadas. Estudiar en la UNED es para fondistas, no para sprinters.
</p><p>
</p><h2><a name="diferencia-uned-presencial">&iquest;Hay mucha diferencia entre estudiar a distancia en la uned o hacerlo en una universidad presencial?</a></h2>

<p>La principal diferencia es estudiar solo &oacute; estudiar con m&aacute;s gente.
Si est&aacute;s con m&aacute;s gente, lo normal es que escojas gente que tiene
intereses y objetivos vitales similares a las tuyos. Si est&aacute;s en una
universidad presencial a esa gente la encontrar&aacute;s much&iacute;simo m&aacute;s f&aacute;cil
que si est&aacute;s en una universidad a distancia.
</p><p>Aparte y por desgracia la UNED tiene much&iacute;simos menos medios
que, cualquier otra. La UNED es la universidad que menos dinero recibe
por estudiante (en t&eacute;rminos cuantitativos), pero como adem&aacute;s estamos
bastante desorganizados el dinero se lo quedan cuatro sinverg&uuml;enzas de
por medio.
</p><p>Si puedes elegir, elige una universidad presencial y si puede
ser buena mejor. Si no puedes, plant&eacute;ate ir a una universidad a
distancia.
</p><p>
</p><h2><a name="a-que-personas">&iquest;A qu&eacute; personas les puede venir bien estudiar en la UNED?</a></h2>
 
<p>
</p><ul>
 <li>estudia (o ha estudiado) otra carrera en una universidad presencial.</li>
 <li>est&aacute; en la c&aacute;rcel.</li>
 <li>no puede desplazarse de su lugar de residencia, d&oacute;nde no hay universidad.</li>
 <li>est&aacute; viviendo en el extranjero.</li>
 <li>tiene discapacidades f&iacute;sicas que le impiden estudiar en una universidad presencial.</li>
 <li>gente que por su trabajo tiene limitaciones de tiempo que le impiden ir a una universidad presencial.</li>
</ul>
<p>

</p><h2><a name="p+f-uned">&iquest;Hay preguntas frecuentes oficiales de la UNED?</a></h2>
<p>S&iacute;, <a href="http://www.uned.es/webuned/faqs.htm">&eacute;stas son sus preguntas frecuentes</a>. Sobre todo hay informaci&oacute;n administrativa de cara a la matriculaci&oacute;n</p>

<p>
</p><h1>Veteranos</h1>

<p>
</p><h2><a name="consejos-examenes">&iquest;Alg&uacute;n consejo de cara a los ex&aacute;menes?</a></h2>

<p>Pide siempre el justificante del trabajo es la &uacute;nica manera de
demostrar que te presentaste al examen en caso de que este se perdiera.
</p><p>
</p><h2><a name="examen-reserva">&iquest;Conoces el procedimiento para hacer el examen de reserva? Me coinciden dos ex&aacute;menes a la misma hora</a></h2>

<p>
</p><p>Para hacer el ex&aacute;men de reserva, lo &uacute;nico que tienes que hacer
es presentarte al otro ex&aacute;men que tengas a esa hora y dec&iacute;rselo a los
profesores que est&eacute;n ah&iacute; encargados (el tribunal) . Ellos te apuntan en
una lista, y luego el d&iacute;a del ex&aacute;men de reserva leen el listado y le
dan el ex&aacute;men a la gente que aparezca.</p>
<p>En la hora de reserva puedes realizar hasta 3 examenes en 3 horas.
Te daran los examenes a la vez y tu ya te organizas tu tiempo.</p> <p>En
el curso 2003/2004 se han puesto dos jornadas de reservas,por ejemplo
el sabado a las 11:30 las reservas de los examenes de los dias 11,12,13
y el sabado a las 19:00 las del resto de dias. Asi hay mas tiempo.</p>
<p>Tambien se pueden usar las reservas para realizar examenes que no se
hayan podido realizar. Las causas tienen que estar muy bien
justificadas.</p>
<p>
</p><h2><a name="examinarme-centro">&iquest;Puedo examinarme en cualquier Centro Asociado?</a></h2>

<p>
Sin problemas, siempre y cuando hagan ex&aacute;menes de tu carrera. Lleva el DNI. Y comun&iacute;calo antes de entrar.
</p><p>
</p><h2><a name="recurso-rectora">He de poner un recurso a la rectora de la uned &iquest;d&oacute;nde puedo enviarlo?</a></h2>

<p>
Pues tienes varias opciones;
</p><p>
</p><ul>
<li> Por mail: rector@adm.uned.es
</li><li> Por correo: tienes que mandarlo a Bavo Murillo 38 - Madrid
</li></ul>
(no me s&eacute; el c&oacute;digo postal)
<ul>
<li> Por registro (te la recomiendo) : Te pasas directamente por registro
</li></ul>
(en Madrid est&aacute; en C/Bravo<a href="index.pl?action=edit&amp;id=Preguntas_Frecuentes_Acerca_De_La_UNED/Bravo">?</a> Murillo 38) y lo pones ah&iacute;, a la atenci&oacute;n de
la "excelentisima y magnifica ...". No olvides llevar varias copias para
que te sellen una, as&iacute; demuestras que lo has echado.
<p>
</p><h2><a name="convocatoria-gracia">&iquest;Qu&eacute; tengo que hacer para pedir una convocatoria de gracia?</a></h2>

<p>
</p><p>Las convocatorias de gracia se solicitan antes del 31 de octubre mediante esta <a href="http://www.uned.es/webuned/alumnos/documentos/gracia.pdf">[instancia]</a>
dirigida al vicerectorado de alumnos de la uned acompa&ntilde;ado de la
certificacion academica personal en la que se espedifique las
asignaruras cursadas con las calificaciones obtenicas y el n&uacute;mero de
convocatorias agotadas en las todavia no superadas.</p>
<p>
</p><p>
</p><h2><a name="anular-matricula">&iquest;C&oacute;mo anulo o modifico la matr&iacute;cula?</a></h2>

<p>Tienes que mandar esta <a href="http://www.uned.es/webuned/alumnos/documentos/modf.pdf">[instancia]</a>. Donde figuren los cambios o la anulacion que quieras realizar. </p><p>Para que te devuelvan el dinero envia este impreso</p> <p> <a href="http://www.uned.es/webuned/alumnos/documentos/devolucion.pdf">http://www.uned.es/webuned/alumnos/documentos/devolucion.pdf</a></p> <p>Adjuntando la carta de pago de la matricula.</p> 
<p>La fecha limite es el 11 de diciembre del 2003 para 1ยบ y 2ยบ ciclo y 30 de diciembre para el doctorado.</p>
<p>No hace falta que justifiques ni documentes el motivo del cambio o de la anulaci&oacute;n.
Si has solicitado una beca no podras pedir la anulaci&oacute;n de asignaturas.</p>
<p>
</p><p>
</p><h2><a name="desde-otra">Vengo de otra universidad y quiero acabar mi carrera en la UNED &iquest;C&oacute;mo me convalidan?</a></h2>

<p>
</p><p>Si tu accedes por traslado de expediente o simultaneidad no
tienes que solictar convalidaci&oacute;n. Si tienes el primer ciclo de una
carrera aprobado te sera convalidado automaticamente al recibir tu
expediente.</p> 
<p>En estos formularios tu pones las asignaturas que tu crees que
pueden convalidarte. Consejo cuantas m&aacute;s mejor.Es una buena idea mandar
el programa de las asignaturas que tu crees te deben convalidar.</p>
Si te matriculas en derecho este es el<a href="http://www.uned.es/webuned/alumnos/documentos/conv-der.pdf">[impreso]</a>.  
Si te matriculas en la facultad de CC. Economicas y empresariales y eres licenciado de ADE o Economia rellena este <a href="http://www.uned.es/webuned/alumnos/documentos/convadm-eco.pdf">[impreso]</a>.
Para el <a href="http://www.uned.es/webuned/alumnos/documentos/convalidaciones.pdf">[el resto de carreras]</a>.
<p>Las convalidaciones tardan mucho porque se ve cada caso en
particular por eso mi consejo es que en principio te matricules de las
que seguro no te van a convalidar.</p>
<p>
</p>
<!--<h2><a name="representacion">&iquest;C&oacute;mo funciona la representaci&oacute;n del alumnado?</a></h2>

<p>
Lo mejor es que leas <a href="http://www.uned.es/webuned/areasgen/info/espa14.htm">[la informaci&oacute;n oficial]</a>
</p>-->


</body></html>
