<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>LA DOCUMENTACION LIBRE EN LA UNED (HISTORIA)</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Imagina que la Bibliografía Básica de la UNED fuera Libre"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="LOS INICIOS (El Proyecto GNU)"
HREF="x31.html"><LINK
REL="NEXT"
TITLE="LOS PROBLEMAS"
HREF="problemas.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Imagina que la Bibliograf&iacute;a B&aacute;sica de la UNED fuera Libre</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="x31.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="problemas.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="HISTORIA">4. LA DOCUMENTACION LIBRE EN LA UNED (HISTORIA)</H1
><P
>Al terminar la conferencia se arm&oacute; un debatillo con el tema, viendo la importancia de que l@s estudiantes de inform&aacute;tica estudiaran los principios, problemas y desarrollo del movimiento GNU. Para que no se volviera a caer en errores tales como patentar algoritmos y otra serie de problemas que casi tiraron por la borda los esfuerzos del software libre.</P
><P
>Finalmente, todo el mundo sali&oacute; satisfecho e ilusionado Elisa y Luis estaban euf&oacute;ricos y no paraban de hacerse preguntas entre ellos, al ponente, a otros oyentes, etc.</P
><P
>- Pero entonces &iquest;por qu&eacute; se empez&oacute; a usar documentaci&oacute;n libre en la UNED? - pregunt&oacute; Luis al ponente.</P
><P
>- Bueno todo empez&oacute; porque un grupo de alumn@s que quer&iacute;an mejorar las condiciones en que  estudiaban y que conoc&iacute;an los beneficios que el proyecto GNU estaba trayendo a la comunidad de usuari@s y desarrolladores de software pensaron que si se trasladaran las ventajas de la licencia GPL al resto de ciencias y de materias del conocimiento, eso ser&iacute;a algo maravilloso para la humanidad. :-)</P
><P
>- A tu parecer &iquest;cu&aacute;les crees que eran las ventajas de utilizar la FDL (Free Documentacion License)? - inquiri&oacute; Elisa.</P
><P
>- Puff, no es una pregunta f&aacute;cil &iquest;realmente ten&eacute;is inter&eacute;s?.</P
><P
>- S&iacute;, s&iacute;, venga - le dijo la gente que formaba el corro de gente que ya se hab&iacute;a formado.</P
><P
>- Bueno debemos pensar en la situaci&oacute;n en que se encontraba la <A
HREF="http://www.uned.es"
TARGET="_top"
>UNED</A
> en aquel entonces:</P
><P
></P
><UL
><LI
><P
>El estudiante de la UNED realizaba por s&iacute; solo todo el esfuerzo del aprendizaje (estudio, planificaci&oacute;n, el proceso de evaluaci&oacute;n continua, elecci&oacute; de materiales, etc.) ni siquiera contaba con el apoyo del grupo. Estaba aislado en su aprendizaje, era una tarea terriblemente alienante.</P
></LI
><LI
><P
>Tambi&eacute;n empezaban a darse los primeros pasos hacia la tarifa plana y conexiones permanentes.</P
></LI
><LI
><P
>El software libre estaba haciendo sus primeras mellas en la sociedad espa&ntilde;ola y hab&iacute;a algunos profesores de la Escuela de Inform&aacute;tica, que entend&iacute;an perfectamente sus ventajas.</P
></LI
><LI
><P
>La bibliograf&iacute;a b&aacute;sica de las asignaturas muchas veces estaba desfasada y pon&iacute;a en verg&uuml;enza a los responsables de dichas asignaturas.</P
></LI
><LI
><P
>La UNED comenzaba a virtualizarse y surg&iacute;a la necesidad de plantearse qu&eacute; licencia dar a la documentaci&oacute;n que se sub&iacute;a a la Red.</P
></LI
></UL
><P
>Quienes form&aacute;bamos aluned por aquel entonces comprendimos que &eacute;ramos las personas adecuadas en el momento adecuado para sacar el proyecto adelante: la documentaci&oacute;n libre.</P
><P
>- &iexcl;&iexcl;Te est&aacute;s yendo por las ramas!! -grit&oacute; alguien que estaba en las &uacute;ltimas posiciones del corro.</P
><P
>- Si no entend&eacute;is el contexto, no entender&eacute;is las ventajas. - dijo el ponente algo molesto. - El caso es que empezamos a divulgar la idea y los/as profesores/as que hab&iacute;an comprendido las ventajas de la GPL, tambi&eacute;n comprendieron las ventajas de la FDL, as&iacute; es que abrieron proyectos para liberar su bibliograf&iacute;a b&aacute;sica. El resultado fue extraordinario.</P
><P
>Por un lado, el alumnado se encontr&oacute; a s&iacute; mismo en el estudio, pues para aprender y aprobar ya no estudiaban sino generaban documentaci&oacute;n, solucionaban problemas, hac&iacute;an compendios de lo que encontraban en libros, revistas, etc. y &iexcl;compart&iacute;an dudas y soluciones!. Esto ahora nos parece trivial pero hasta entonces nunca se hab&iacute;a hecho. Como pod&eacute;is imaginar las notas y la motivaci&oacute;n de est@s estudiantes mejor&oacute; una barbaridad.</P
><P
>Por otro lado, el profesor bueno encontr&oacute; la oportunidad de asistir a sus alumnos entusiasmados en una lista de distribuci&oacute;n, algunos comenzaron a comprender que ense&ntilde;ar no es otra cosa que hacer que un alumno se ilusione con lo que aprende. Adem&aacute;s estos profesores/as fueron los primeros en el mundo en dar una informaci&oacute;n totalmente actualizada a los nuevos/as estudiantes y esto repercut&iacute;a en su reputaci&oacute;n. Tambi&eacute;n repercut&iacute;a en su reputaci&oacute;n el tener datos reales, de primera mano y en lo que ellos hab&iacute;an participado directamente: el aprendizaje cooperativo y colaborativo. Aunque personalmente creo que aquello que verdaderamente les di&oacute; prestigio a esos profesores y profesoras pioneros y pioneras fue el agradecimiento que los alumnos y alumnas sent&iacute;an por haberse sentido atendidos por primera vez en su estudios en la UNED.</P
><P
>Luego cada caso era un mundo hab&iacute;a proyectos en los que el profesor era muy activo en la lista, tambi&eacute;n hab&iacute;a otros en los que lo era muy poco, en algunas listas hab&iacute;a dos o tres alumnos que hac&iacute;an todo el trabajo, en otras eran 15 &oacute; 20 muy bien coordinados, cada caso era un mundo. Hab&iacute;a casos en los que el trabajo ven&iacute;a sobre todo con tutores y tutoras en vez de con profesores.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="x31.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="problemas.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>LOS INICIOS (El Proyecto GNU)</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>LOS PROBLEMAS</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>