<!DOCTYPE article PUBLIC "-//OASIS//DTD DocBook V3.1//EN" [<!ENTITY fdl SYSTEM "fdl.sgml">]>

<article lang="es">
  <artheader>
    <title>Imagina que la Bibliograf&iacute;a B&aacute;sica de la UNED fuera Libre</title>
    <author>
      <firstname>David</firstname>
      <surname>Arroyo Men&eacute;ndez</surname>
    </author>
    <honorific>Esta historia est&aacute; dedicada a tod@s aquell@s que entregan su tiempo y esfuerzo a mejorar la UNED y la transmisi&oacute;n libre del conocimientos, pues sin ell@s no hubiera sido posible esta obra. </honorific>
    <copyright>
      <year>2002</year>
      <holder>David Arroyo Menéndez</holder>
    </copyright>
    <legalnotice id="notalegal">
      <para>Se otorga permiso para copiar, distribuir y/o modificar este documento bajo los t&eacute;rminos de la Licencia de Documentaci&oacute;n Libre GNU, versi&oacute;n 1.1 o cualquier versi&oacute;n posterior publicada por la Free Software Foundation. A d&iacute;a de hoy no hay Secciones Invariantes ni Textos de Portada o Contraportada. Puedes consultar una copia de la licencia en <ulink url="http://www.gnu.org/copyleft/fdl.html">http://www.gnu.org/copyleft/fdl.html</ulink></para>
      <para>Nota: Esta licencia no est&aacute; pensada para obras literarias, pero debido al tema del que trata el documento he decidido darle tal licencia y as&iacute;, ser&aacute; una historia que circule por la Red, donde cada cual podr&aacute; darle sus propios enfoques y aportaciones personales, adem&aacute;s de poder servir mejor al fin para el que fue creado que no es otro que el de fomentar la libre difusi&oacute;n del conocimiento en la Universidad Nacional de Educaci&oacute;n a Distancia (UNED) en particular y en toda la sociedad en general.
</para>
    </legalnotice>
    <abstract>
      <simpara>Elisa y Luis dos estudiantes de la UNED del futuro deciden hacer unas jornadas en su Centro Asociado sobre el proyecto <ulink url="http://www.gnu.org">GNU</ulink> para informar al alumnado de lo importante que fue &eacute;ste proyecto para la sociedad en general y la UNED, en particular a partir de ah&iacute; se genera un debate sobre lo que verdaderamente supuso un gran avance para &eacute;sta universidad: la documentaci&oacute;n libre.</simpara>
    </abstract>
  </artheader>
  <sect1 id="dedicatoria">
    <title>Dedicatoria</title>
    <para>Esta historia está dedicada a tod@s aquell@s que entregan su tiempo y esfuerzo a mejorar la UNED y la transmisión libre del conocimientos, pues sin ell@s no hubiera sido posible esta obra.</para>
  </sect1>

  <sect1 id="prologo">
    <title>PROLOGO</title>
    <para>Suena el despertador, Luis se levanta fatigado, desayuna y camina somnoliento hacia la ducha. Despu&eacute;s enciende el ordenador y enseguida ve como Elisa le dice sonriente:</para>
    <para> - &iexcl;Vaya! ya se ha despertado mi dormil&oacute;n preferido</para>
    <para>- S&iacute; bueno, supongo que no deb&iacute; quedarme en el irc hasta tan tarde, pero cuando est&aacute;s manteniendo una conversaci&oacute;n con 15 personas y m&aacute;s de 10 con sexo femenino no resulta tan f&aacute;cil decir oye que me voy ;-D</para>
    <para>- &iquest;te salen ya los enlaces de integrales impropias?</para>
    <para>- Estoy un poco dormido te refieres en el curso de An&aacute;lisis Matem&aacute;tico &iquest;no?</para>
    <para>- S&iacute;, claro.</para>
    <para>- Pues, espera un momento ... No. La verdad es que no me extra&ntilde;a no he sido muy activo &uacute;ltimamente y lo de las integrales no es lo m&iacute;o, de cualquier manera no entiendo como es que todav&iacute;a te queda esta asignatura no parece tan dif&iacute;cil.</para>
    <para>- Se nota que no eres muy activo. Ya me lo repetir&aacute;s en Febrero.</para>
  </sect1>
  <sect1>
    <title>LOS INICIOS (El Proyecto GNU)</title>
    <para>Elisa es el segundo a&ntilde;o que estudia en la UNED, Luis es su vecino y se meti&oacute; en la UNED confiando que viviendo por s&iacute; mismo una ense&ntilde;anza virtual podr&iacute;a luego ser un mejor profesional de la inform&aacute;tica, o al menos eso le dice a la gente que le pregunta, aunque la aut&eacute;ntica raz&oacute;n era la de tener de compa&ntilde;era de estudios a su vecinita ;-) Adem&aacute;s Luis siempre ha sido muy cr&iacute;tico con la ense&ntilde;anza a distancia y la virtualizaci&oacute;n que ha sufrido la sociedad, debido a la p&eacute;rdida de contacto humano que genera este proceso, por ello nuestro amigo siempre trata de participar (tambi&eacute;n en la organizaci&oacute;n) de actividades que en el Centro Asociado de su barrio promueve <ulink url="http://www.sindominio.net/aluned">aluned</ulink>.</para>
    <para> - Por cierto, Luis terminaste de generar los ejercicios resueltos de Fundamentos F&iacute;sicos de la Inform&aacute;tica. Es una aberraci&oacute;n que a&uacute;n siga habiendo libros de S&aacute;inz y Castillos. Pronto esa editorial pasara la historia como un punto m&aacute;s del pasado corrupto de nuestra universidad.</para>
    <para>- Bufff, a&uacute;n me queda darle unos retoques.</para>
    <para>- Es muy importante que vayas publicando lo que hagas, sino la gente no va a poder ir revisando los errores.</para>
    <para>- Vaaale, ahora mismo lo har&eacute;.</para>
    <para>- &iquest;Has votado ya para que salga la asignatura sobre el proyecto <ulink url="http://www.gnu.org">GNU</ulink> como obligatoria en primero?. </para>
    <para>- No sab&iacute;an que hubieran salido tales votaciones.</para>
    <para>- Bueno, despu&eacute;s de 1 mes de intenso debate en la lista de propuestas al MEC al fin se ha perfilado una que convenc&iacute;a a todo el mundo m&aacute;s o menos. Si la apoya al menos el 80% de la comunidad universitaria, el <ulink url="http://www.mec.es">MEC</ulink> 
      no deber&iacute;a oponerse a que se traslade al resto de la sociedad.</para>
    <para>- La &uacute;ltima vez que un ministerio se opuso a una propuesta universitaria se arm&oacute; una tan gorda que hubo movilizaciones y todo.</para>
    <para>- No creo que se atrevan a repetir el esc&aacute;ndalo de tener al 90% de la poblaci&oacute;n en la calle. Y pensar que en anta&ntilde;o la gente se molestaba en convocar movilizaciones de 100 &oacute; 200 personas.</para>
    <para>- &iexcl;y no hace tanto tiempo!</para>
    <para>- Estaba pensando ...</para>
    <para>- &iquest;qu&eacute;?</para>
    <para>- que podr&iacute;amos proponer hacer unas jornadas del proyecto GNU en el Centro Social.</para>
    <para>- En el Centro Social ser&iacute;a redundante mejor en el Centro Asociado, all&iacute; la gente no est&aacute; tan concienciada y el coordinador siempre nos dice que a ver si le damos un poco de vidilla.</para>
    <para>- Tienes raz&oacute;n adem&aacute;s podr&iacute;amos relacionarlo con lo que significaron las licencias libres para la mejora de la UNED.</para>
    <para>- Eso ser&iacute;a genial, adem&aacute;s a ra&iacute;z de participar en el foro para la propuesta de GNU en primero de Inform&aacute;tica he tenido la oportunidad de conocer a uno de los promotores de la implantaci&oacute;n de la <ulink url="http://www.gnu.org/copyleft/fdl.html">GFDL</ulink> en la bibliograf&iacute;a b&aacute;sica, le podr&iacute;a animar a que viniera.</para>
    <para>- &iquest;Te encargas t&uacute; de meterlo en el foro de propuestas del Centro Asociado?</para>
    <para>- Vale, pero la pr&oacute;xima propuesta te toca redactarla a t&iacute; :-)</para>

    <para>Y as&iacute;, diez d&iacute;as despu&eacute;s se realiz&oacute; la ponencia, en &eacute;sta b&aacute;sicamente se explic&oacute; lo siguiente: </para>
    <para>Al principio el software, los programas de ordenador eran propietarios, que cuando alguien compraba un producto tal y como Windown no pod&iacute;a modificarlo, pues no hab&iacute;a manera de obtener el c&oacute;digo y si se lo copiaba a alg&uacute;n amigo cometer&iacute;a un delito y le llamar&iacute;an pirata.</para>
    <para>Richard Stallman entendi&oacute; que eso atentaba contra las cuatro libertades b&aacute;sicas que se deb&iacute;an cumplir en el usuario de un programa para que ese fuera software libre:</para>
    <itemizedlist>
      <listitem><para>Usted tiene libertad para ejecutar el programa con cualquier prop&oacute;sito.</para>
      </listitem>
      <listitem><para>Usted tiene libertad para modificar el programa para adaptarlo a sus necesidades.</para></listitem>
      <listitem><para>Usted tiene libertad para redistribuir copias, tanto gratis como por un precio.</para></listitem>
      <listitem><para>Usted tiene libertad para distribuir versiones modificadas del programa, de tal manera que la comunidad pueda beneficiarse con sus mejoras.</para></listitem>
    </itemizedlist>

    <para>Para preservar estas libertades en el software se invent&oacute; una licencia (la Licencia General P&uacute;blica o GPL) que garantizara tales libertades, en esa licencia b&aacute;sicamente se dec&iacute;a que tal programa se pod&iacute;a distribuir y modificar libremente con la &uacute;nica restricci&oacute;n de que las modificaciones y mejoras del programa deb&iacute;an seguir teniendo licencia GPL. </para>
    <para>Pero esos programas libres requer&iacute;an de documentaci&oacute;n libre, pues el copyright de los libros y documentaci&oacute;n de aquella &eacute;poca atentaba contra las libertades que Stallman hab&iacute;a se&ntilde;alado en el software trasladadas a la documentaci&oacute;n. La documentaci&oacute;n de aquel entonces no pod&iacute;a ser modificada o distribuida sin permiso expreso del autor/a y/o la editorial. Este hecho implicaba que si alguien quer&iacute;a actualizar un libro de ciencia o historia y no ten&iacute;a los derechos de autor deb&iacute;a volver a escribir el libro entero, esto retrasaba enormemente el desarrollo de la ciencia pero en el campo de la inform&aacute;tica la imped&iacute;a avanzar.</para>
  </sect1>

  <sect1 id="historia">
    <title>LA DOCUMENTACION LIBRE EN LA UNED (HISTORIA)</title>
    <para>Al terminar la conferencia se arm&oacute; un debatillo con el tema, viendo la importancia de que l@s estudiantes de inform&aacute;tica estudiaran los principios, problemas y desarrollo del movimiento GNU. Para que no se volviera a caer en errores tales como patentar algoritmos y otra serie de problemas que casi tiraron por la borda los esfuerzos del software libre.</para>
    <para>Finalmente, todo el mundo sali&oacute; satisfecho e ilusionado Elisa y Luis estaban euf&oacute;ricos y no paraban de hacerse preguntas entre ellos, al ponente, a otros oyentes, etc.</para>
    <para>- Pero entonces &iquest;por qu&eacute; se empez&oacute; a usar documentaci&oacute;n libre en la UNED? - pregunt&oacute; Luis al ponente.</para>
    <para>- Bueno todo empez&oacute; porque un grupo de alumn@s que quer&iacute;an mejorar las condiciones en que  estudiaban y que conoc&iacute;an los beneficios que el proyecto GNU estaba trayendo a la comunidad de usuari@s y desarrolladores de software pensaron que si se trasladaran las ventajas de la licencia GPL al resto de ciencias y de materias del conocimiento, eso ser&iacute;a algo maravilloso para la humanidad. :-)</para>
    <para>- A tu parecer &iquest;cu&aacute;les crees que eran las ventajas de utilizar la FDL (Free Documentacion License)? - inquiri&oacute; Elisa.</para>
    <para>- Puff, no es una pregunta f&aacute;cil &iquest;realmente ten&eacute;is inter&eacute;s?.</para>
    <para>- S&iacute;, s&iacute;, venga - le dijo la gente que formaba el corro de gente que ya se hab&iacute;a formado.</para>
    <para>- Bueno debemos pensar en la situaci&oacute;n en que se encontraba la <ulink url="http://www.uned.es">UNED</ulink> en aquel entonces:</para>
    <itemizedlist>
      <listitem><para>El estudiante de la UNED realizaba por s&iacute; solo todo el esfuerzo del aprendizaje (estudio, planificaci&oacute;n, el proceso de evaluaci&oacute;n continua, elecci&oacute; de materiales, etc.) ni siquiera contaba con el apoyo del grupo. Estaba aislado en su aprendizaje, era una tarea terriblemente alienante.</para></listitem>
      <listitem><para>Tambi&eacute;n empezaban a darse los primeros pasos hacia la tarifa plana y conexiones permanentes.</para></listitem>
      <listitem><para>El software libre estaba haciendo sus primeras mellas en la sociedad espa&ntilde;ola y hab&iacute;a algunos profesores de la Escuela de Inform&aacute;tica, que entend&iacute;an perfectamente sus ventajas.</para></listitem>
      <listitem><para>La bibliograf&iacute;a b&aacute;sica de las asignaturas muchas veces estaba desfasada y pon&iacute;a en verg&uuml;enza a los responsables de dichas asignaturas.</para></listitem>
      <listitem><para>La UNED comenzaba a virtualizarse y surg&iacute;a la necesidad de plantearse qu&eacute; licencia dar a la documentaci&oacute;n que se sub&iacute;a a la Red.</para></listitem>
    </itemizedlist>
 
    <para>Quienes form&aacute;bamos aluned por aquel entonces comprendimos que &eacute;ramos las personas adecuadas en el momento adecuado para sacar el proyecto adelante: la documentaci&oacute;n libre.</para>
    <para>- &iexcl;&iexcl;Te est&aacute;s yendo por las ramas!! -grit&oacute; alguien que estaba en las &uacute;ltimas posiciones del corro.</para>
    <para>- Si no entend&eacute;is el contexto, no entender&eacute;is las ventajas. - dijo el ponente algo molesto. - El caso es que empezamos a divulgar la idea y los/as profesores/as que hab&iacute;an comprendido las ventajas de la GPL, tambi&eacute;n comprendieron las ventajas de la FDL, as&iacute; es que abrieron proyectos para liberar su bibliograf&iacute;a b&aacute;sica. El resultado fue extraordinario.</para>
    <para>Por un lado, el alumnado se encontr&oacute; a s&iacute; mismo en el estudio, pues para aprender y aprobar ya no estudiaban sino generaban documentaci&oacute;n, solucionaban problemas, hac&iacute;an compendios de lo que encontraban en libros, revistas, etc. y &iexcl;compart&iacute;an dudas y soluciones!. Esto ahora nos parece trivial pero hasta entonces nunca se hab&iacute;a hecho. Como pod&eacute;is imaginar las notas y la motivaci&oacute;n de est@s estudiantes mejor&oacute; una barbaridad.</para>

    <para>Por otro lado, el profesor bueno encontr&oacute; la oportunidad de asistir a sus alumnos entusiasmados en una lista de distribuci&oacute;n, algunos comenzaron a comprender que ense&ntilde;ar no es otra cosa que hacer que un alumno se ilusione con lo que aprende. Adem&aacute;s estos profesores/as fueron los primeros en el mundo en dar una informaci&oacute;n totalmente actualizada a los nuevos/as estudiantes y esto repercut&iacute;a en su reputaci&oacute;n. Tambi&eacute;n repercut&iacute;a en su reputaci&oacute;n el tener datos reales, de primera mano y en lo que ellos hab&iacute;an participado directamente: el aprendizaje cooperativo y colaborativo. Aunque personalmente creo que aquello que verdaderamente les di&oacute; prestigio a esos profesores y profesoras pioneros y pioneras fue el agradecimiento que los alumnos y alumnas sent&iacute;an por haberse sentido atendidos por primera vez en su estudios en la UNED.</para>

    <para>Luego cada caso era un mundo hab&iacute;a proyectos en los que el profesor era muy activo en la lista, tambi&eacute;n hab&iacute;a otros en los que lo era muy poco, en algunas listas hab&iacute;a dos o tres alumnos que hac&iacute;an todo el trabajo, en otras eran 15 &oacute; 20 muy bien coordinados, cada caso era un mundo. Hab&iacute;a casos en los que el trabajo ven&iacute;a sobre todo con tutores y tutoras en vez de con profesores.</para>
  </sect1>
  <sect1 id="problemas">
    <title>LOS PROBLEMAS</title>
<para>- &iexcl;vaya!- dijo de 
    pronto Luis - fue un tanto heroico por lo que veo. Y &iquest;nada de lo que hac&iacute;ais os contaba en la nota?</para>

<para>- Fueron muy raros los casos, hombre, cuando el profesor de la asignatura te conoce y sabe que te has currado el tema y suspendes por unas d&eacute;cimas pues al final te aprobaba, pero vamos contaba muy poco.</para>
<para>- pues no s&eacute; de que me quejaba con lo de Fundamentos F&iacute;sicos - susurr&oacute; Luis a Elisa.</para>
<para>- Lo importante - comenz&oacute; a comentar el ponente - es que hoy en todas las carreras hay documentaci&oacute;n libre y en Inform&aacute;tica toda la bibliograf&iacute;a b&aacute;sica lo es. Si no se hubiera hecho de ese modo, seguramente no se hubiera hecho de ninguna manera. Pero es que adem&aacute;s para nosotros el cambio de estar estudiando s&oacute;los en nuestras casas a aprender con un mont&oacute;n de gente en la Red con un objetivo concreto y apoyados de vez en cuando por un profesor o tutor, fue genial, una maravilla.</para>

<para>- &iquest;Por qu&eacute; no les cuentas las zancadillas que nos pusieron? - dijo de pronto alguien que hab&iacute;a permanecido hasta entonces en la retaguardia.</para>
<para>- Bueno, tampoco fueron tantas - respondi&oacute; el ponente quit&aacute;ndole importancia - Por un lado, las editoriales ingresaban importantes cantidades econ&oacute;micas por sus libros, algunas viv&iacute;an de los libros que vend&iacute;an a la UNED. Si un libro estaba en la Red dejar&iacute;a de venderse (o al menos eso pensaban) por eso impidieron incluso con denuncias que los libros no estuvieran en Internet, por otro lado algunos profesores cobraban alg&uacute;n dinero por derechos de autor y no quer&iacute;an renunciar a tales dineros. Esto realmente no supon&iacute;a serios problemas para la gente que empezamos a generar documentaci&oacute;n libre, pero s&iacute; supon&iacute;a un problema para la virtualizaci&oacute;n de la ense&ntilde;anza, me explico:</para>

    <para>Los primeros documentos que adoptaron la <ulink url="http://www.gnu.org/copyleft/gpl.html">GFDL</ulink> en la UNED eran colecciones de ejercicios y bibliograf&iacute;as b&aacute;sicas compuestas por apuntes y materiales cogidos de la Red, no hubo mucha dificultad en que esos documentos adoptaran la licencia que propon&iacute;amos, el agradecimiento de l@s alumn@s, las r&aacute;pidas mejoras, actualizaciones y correcciones de erratas fueron suficiente como para convencer a l@s profesor@s encargados, quienes se ve&iacute;an como mejoraba su asignatura, el aprendizaje de sus alumn@s, su prestigio, &iexcl;incluso sus ingresos!</para>
<para>Sin embargo, la UNED que se encontraba en un fuerte proceso de virtualizaci&oacute;n ve&iacute;a c&oacute;mo se imped&iacute;a y atrasaba ese proceso al no poder estar el material docente que segu&iacute;a estando exclusivamente en forma de libros, en la Red, lo cual llev&oacute; a m&aacute;s de un ultim&aacute;tum :-( Simplemente se ve&iacute;a con envidia la facilidad con que se virtualizaban las asignaturas con documentaci&oacute;n libre.</para>

<para>Por otro lado, empezaron a surgir alumn@s y peque&ntilde;as editoriales que vend&iacute;an esos libros libres y gratuitos, &iexcl;qu&eacute; absurdo! dec&iacute;an muchos &iquest;por qu&eacute; alguien va a querer comprar un libro que ya es gratuito? Bueno, no todo el mundo quiere hacer el tedioso y no siempre accesible trabajo de bajarse un libro e imprim&iacute;rselo, por otro lado un lector suele preferir una buena encuadernaci&oacute;n a una impresi&oacute;n casera. Yo tambi&eacute;n compr&eacute; y vend&iacute; libros :-). En fin las editoriales tradicionales se acabaron dando cuenta de que es rentable vender libros libres y que no hab&iacute;a que tener miedo de ello, lo que s&iacute; se asegur&oacute; es que esos libros no pod&iacute;an ser caros, porque si no la gente se los bajar&iacute;a de la Red, no se obten&iacute;an grandes m&aacute;rgenes por cada libro pero s&iacute; se vend&iacute;an muchos.</para>

<para>A medio plazo, las editoriales que vendieron libros libres vieron como sus libros eran conocidos por much&iacute;sima 
    gente y mejorados tambi&eacute;n por gran cantidad de personas, por tanto 
    mucha gente quer&iacute;a esos libros con su buena encuadernaci&oacute;n y 
    se los compraban a las editoriales que mejor sab&iacute;an aprovechar las 
    mejoras que se hac&iacute;an a esos libros, las que llevaban desde el principio vendi&eacute;ndolos.</para>
<para>- y &iquest;qu&eacute; dec&iacute;an l@s profesor@s de sus derechos de autor? - pregunt&oacute; alguien.</para>

<para>- como ya he dicho antes - comenz&oacute; el ponente - el prestigio que ganaron los autores que se dedicaron a liberar la bibliograf&iacute;a b&aacute;sica de sus asignaturas dejaba en rid&iacute;culo el escaso dinero que percib&iacute;an de las editoriales, adem&aacute;s en la GFDL se tiene un especial cari&ntilde;o y respeto hacia los autores de la obra, nunca se olvida qui&eacute;n ha realizado la obra y qui&eacute;n la ha modificado.</para>
  </sect1>
  <sect1 id="piezas">
    <title>JUNTANDO LAS PIEZAS</title>
<para>Unas estrellas comenzaron a hacerse hueco en aquel cielo de verano tratando de hacer recordar a las (cada vez m&aacute;s) personas que conformaban el corro que la noche estaba llegando y que podr&iacute;a ser hora de ir recogiendo los b&aacute;rtulos y de que cada uno fuese a su casa a descansar, sin embargo, la expectaci&oacute;n que generaba el escuchar de primera mano la transformaci&oacute;n que vivi&oacute; la UNED de una manera tan positiva y radical como r&aacute;pida, era algo que hac&iacute;a olvidar lo que significaba el d&iacute;a y la noche. Y as&iacute;, continuando con la magia que el di&aacute;logo hab&iacute;a hecho despertar en los corazones de los asistentes, una nueva pregunta surgi&oacute; de los labios de Elisa:</para>

    <para>- Nos has repetido ya varias veces que la bibliograf&iacute;a libre surgi&oacute; casi al mismo tiempo de iniciarse el proceso de virtualizaci&oacute;n que sufri&oacute; la UNED, pero &iquest;c&oacute;mo y cu&aacute;ndo la UNED de manera institucional adopt&oacute; este modelo como propio?</para>
<para>- Pues nunca y siempre. 
    Es decir, en el momento en que algun@s profesor@s promovieron los primeros 
    proyectos para liberar su bibliograf&iacute;a b&aacute;sica, pues supuso un 
    apoyo institucional muy fuerte :-). Al mismo tiempo, el equipo de gobierno 
    de la UNED nunca impuso un modelo u otro, aunque dentro del mismo s&iacute; hubo personas que apoyaban el modelo, as&iacute; como quien lo paraba y, al 
    principio la mayor&iacute;a no comprend&iacute;a sus ventajas o inconvenientes, con el tiempo s&iacute; fueron asimilando lo que esto supon&iacute;a y bueno pues hoy creo que nadie lo cuestiona :-)</para>

    <para>- Lo que quiero decir es que &iquest;c&oacute;mo se integr&oacute; todo esto en el modelo educativo?</para>
    <para>- Bien, pues de la misma manera que se juntan las piezas de un puzzle, primero coges las esquinas ... imaginemos que nuestras esquinas eran 1)la ayuda mutua entre l@s estudiantes 2)la virtualizaci&oacute;n de la ense&ntilde;anza 3)la defensa de lo p&uacute;blico  4)la vocaci&oacute;n transmisora del conocimiento de la universidad.</para>
    <para>A lo mejor desde la esquina de ayuda mutua hasta la de virtualizaci&oacute;n hay un mont&oacute;n de piezas que son grupos de estudiantes en la Red, hasta la decisi&oacute;n que toma el equipo de gobierno de la UNED sobre c&oacute;mo se debe virtualizar, pasando por grupos de alumn@s que colaboran con profesor@s, grupos de profesor@s, programas geniales (plataformas educativas, sistemas tutores inteligentes, adaptativa, etc.) que ayudan a virtualizar la ense&ntilde;anza, todo se acaba juntando si te fijas c&oacute;mo son las piezas, a veces unas se parecen a otras, te equivocas, te bloqueas, hay que fijarse bien.</para>
    
    <para>Pero desde la esquina de ayuda mutua entre l@s estudiantes, tambi&eacute;n hab&iacute;a piezas que son grupos de alumn@s que no est&aacute;n en la Red y que si vas juntando piezas se acercan a la esquina de la vocaci&oacute;n transmisora del conocimiento de la universidad donde estar&iacute;an los libros, la gente que se entrega en su trabajo y estudio, etc.</para>
    <para>En la esquina de la defensa de lo p&uacute;blico estaban algunos sindicatos no mayoritarios, Centros Sociales Okupados y Autogestionados, el proyecto GNU, etc.</para>
    <para>La documentaci&oacute;n 
    libre e Internet, simplemente eran las piezas claves del puzzle del nuevo 
    modelo educativo y estaban en el coraz&oacute;n del mismo.</para>
  </sect1>
  <sect1 id="modelo">
    <title>UN NUEVO MODELO EDUCATIVO</title>

    <para>En realidad, el modelo de la UNED no es muy distinto del que hab&iacute;a en el siglo XX, entonces l@s alumn@s ten&iacute;an un material con el que estudiar, hoy tambi&eacute;n lo tienen s&oacute;lo que en vez de libros propietarios hay libros libres, ya que es fundamental que el/la estudiante tenga un medio secuencial donde pueda ver el orden l&oacute;gico de las ideas, pero puesto que el aprendizaje es algo que se adquiere relacionando ideas y poniendo al alumn@ en un proceso activo, &eacute;ste tiene la posibilidad de acceder a la informaci&oacute;n en formato de hipermedia (p&aacute;ginas web), pero esta informaci&oacute;n  est&aacute; totalmente personalizada y adaptada para que su aprendizaje sea m&aacute;ximo al acceder a ella, puesto que el sistema conoce y comprende las aportaciones que el individuo ha hecho en foros, la navegaci&oacute;n que ha seguido desde que comenz&oacute; la carrera y todos esos datos no pueden ser accedidos por nadie m&aacute;s que por los agentes y procesos que gobiernan el sistema.</para>

    <para>As&iacute; mismo, sigue habiendo tutor&iacute;as d&oacute;nde l@s alumn@s comparten sus dudas y reciben ayuda de tutor@s, cumpliendo los estatutos de nuestra universidad (y no como antes que era todo una utop&iacute;a ;-). Aunque lo verdaderamente importante de los Centros Asociados es la posibilidad de otorgar un espacio f&iacute;sico d&oacute;nde l@s alumn@s puedan hacer algo tan humano e importante como tocarse :-)</para>
    <para>Si nos ponemos a pensar lo &uacute;nico que ha cambiado radicalmente en el modelo es el sistema de evaluaci&oacute;n. Por un lado, el alumno o alumna tiene la posibilidad de someterse a pruebas de autoevaluaci&oacute;n a petici&oacute;n suya y/o sugerencia del sistema hipermedia, as&iacute; mismo, &eacute;stas pruebas est&aacute;n pensadas para que el aprendizaje sea m&aacute;ximo tanto en la formulaci&oacute;n de preguntas como las sugerencias que se reciben, como las razones que se dan para determinar si una respuesta est&aacute; bien o mal. De esta manera, el alumno o alumna est&aacute; sometid@ a una constante autoevaluaci&oacute;n en la que conoce sus fallos y aciertos. As&iacute; mismo, la evaluaci&oacute;n final en la que obtiene esa nota tiene en cuenta esos datos, pero lo que realmente tiene peso son las acciones de otros alumn@s derivadas de las que &eacute;l ha realizado, si sus comentarios en los foros generan debates, si la documentaci&oacute;n que realiza es muy visitada, encuestas a los compa&ntilde;eros, etc. No se nos olvide que el tutor telem&aacute;tico es un compa&ntilde;er@ m&aacute;s especialmente querido por sus amplios conocimientos, intervenciones y generaci&oacute;n de material y si es superado por un alumn@ puede que tenga que cambiar de trabajo :-D</para>

    <para>Ahora bien, &iquest;c&oacute;mo se di&oacute; este cambio?
    bueno, pues despu&eacute;s de largos debates, estudios sobre experiencias similares, creaci&oacute;n de experiencias piloto, etc.</para>
    <para>&iexcl;Demonios! - exclam&oacute; repentinamente el <emphasis>cuentacuentos</emphasis> ;-) al tiempo que miraba el reloj - tengo que irme pues de otro modo ni siquiera voy a llegar a dar un beso a mis ni&ntilde;as, antes de que se acuesten. </para>


    <para>Y as&iacute;, recogi&oacute; sus cosas como si le fuera la vida de en ello y desapareci&oacute;, dejando a l@s asistentes como flotando en una nube ... Poco a poco comenzaron a hablar entre ell@s y a abandonar la sala. Al rato todo el mundo se hab&iacute;a ido a sus hogares contentos de vivir en una sociedad d&oacute;nde se compart&iacute;a el conocimiento, contentos de participar en la comunidad universitaria que ten&iacute;a por siglas UNED. Los cr&iacute;ticos con el modelo dec&iacute;an que la educaci&oacute;n a distancia separaba a las personas, pero quienes sal&iacute;an de esa sala aquella noche sab&iacute;an que quiz&aacute;s hab&iacute;a sido as&iacute; en un pasado pero que ahora no.</para>
    
    <para>Esa misma noche nuestro amigo Luis termin&oacute; de generar ejercicios resueltos para la asignatura de Fundamentos F&iacute;sicos de la Inform&aacute;tica. Y as&iacute; se acababa de materializar un nuevo granito de arena en la difusi&oacute;n del conocimiento.</para>
  </sect1>

  <sect1 id="licencia">
    <title>Licencia</title>
    <para>Se otorga permiso para copiar, distribuir y/o modificar este documento bajo los términos de la Licencia de Documentación Libre GNU, versión 1.1 o cualquier versión posterior publicada por la Free Software Foundation. A día de hoy no hay Secciones Invariantes ni Textos de Portada o Contraportada. Puedes consultar una copia de la licencia en <ulink url="http://www.gnu.org/copyleft/fdl.html">http://www.gnu.org/copyleft/fdl.html</ulink></para>
    <note>
      <para>Esta licencia no está pensada para obras literarias, pero debido al tema del que trata el documento he decidido darle tal licencia y así, será una historia que circule por la Red, donde cada cual podrá darle sus propios enfoques y aportaciones personales, además de poder servir mejor al fin para el que fue creado que no es otro que el de fomentar la libre difusión del conocimiento en la Universidad Nacional de Educación a Distancia (<ulink url="http://www.uned.es">UNED</ulink>) en particular y en toda la sociedad en general.</para>
    </note>
</sect1>


</article>




