<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>UN NUEVO MODELO EDUCATIVO</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Imagina que la Bibliografía Básica de la UNED fuera Libre"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="JUNTANDO LAS PIEZAS"
HREF="piezas.html"><LINK
REL="NEXT"
TITLE="Licencia"
HREF="licencia.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Imagina que la Bibliograf&iacute;a B&aacute;sica de la UNED fuera Libre</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="piezas.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="licencia.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="MODELO">7. UN NUEVO MODELO EDUCATIVO</H1
><P
>En realidad, el modelo de la UNED no es muy distinto del que hab&iacute;a en el siglo XX, entonces l@s alumn@s ten&iacute;an un material con el que estudiar, hoy tambi&eacute;n lo tienen s&oacute;lo que en vez de libros propietarios hay libros libres, ya que es fundamental que el/la estudiante tenga un medio secuencial donde pueda ver el orden l&oacute;gico de las ideas, pero puesto que el aprendizaje es algo que se adquiere relacionando ideas y poniendo al alumn@ en un proceso activo, &eacute;ste tiene la posibilidad de acceder a la informaci&oacute;n en formato de hipermedia (p&aacute;ginas web), pero esta informaci&oacute;n  est&aacute; totalmente personalizada y adaptada para que su aprendizaje sea m&aacute;ximo al acceder a ella, puesto que el sistema conoce y comprende las aportaciones que el individuo ha hecho en foros, la navegaci&oacute;n que ha seguido desde que comenz&oacute; la carrera y todos esos datos no pueden ser accedidos por nadie m&aacute;s que por los agentes y procesos que gobiernan el sistema.</P
><P
>As&iacute; mismo, sigue habiendo tutor&iacute;as d&oacute;nde l@s alumn@s comparten sus dudas y reciben ayuda de tutor@s, cumpliendo los estatutos de nuestra universidad (y no como antes que era todo una utop&iacute;a ;-). Aunque lo verdaderamente importante de los Centros Asociados es la posibilidad de otorgar un espacio f&iacute;sico d&oacute;nde l@s alumn@s puedan hacer algo tan humano e importante como tocarse :-)</P
><P
>Si nos ponemos a pensar lo &uacute;nico que ha cambiado radicalmente en el modelo es el sistema de evaluaci&oacute;n. Por un lado, el alumno o alumna tiene la posibilidad de someterse a pruebas de autoevaluaci&oacute;n a petici&oacute;n suya y/o sugerencia del sistema hipermedia, as&iacute; mismo, &eacute;stas pruebas est&aacute;n pensadas para que el aprendizaje sea m&aacute;ximo tanto en la formulaci&oacute;n de preguntas como las sugerencias que se reciben, como las razones que se dan para determinar si una respuesta est&aacute; bien o mal. De esta manera, el alumno o alumna est&aacute; sometid@ a una constante autoevaluaci&oacute;n en la que conoce sus fallos y aciertos. As&iacute; mismo, la evaluaci&oacute;n final en la que obtiene esa nota tiene en cuenta esos datos, pero lo que realmente tiene peso son las acciones de otros alumn@s derivadas de las que &eacute;l ha realizado, si sus comentarios en los foros generan debates, si la documentaci&oacute;n que realiza es muy visitada, encuestas a los compa&ntilde;eros, etc. No se nos olvide que el tutor telem&aacute;tico es un compa&ntilde;er@ m&aacute;s especialmente querido por sus amplios conocimientos, intervenciones y generaci&oacute;n de material y si es superado por un alumn@ puede que tenga que cambiar de trabajo :-D</P
><P
>Ahora bien, &iquest;c&oacute;mo se di&oacute; este cambio? bueno, yo pues de largos debates, estudios sobre experiencias similares, creaci&oacute;n de experiencias piloto, etc.</P
><P
>&iexcl;Demonios! - exclam&oacute; repentinamente el <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>cuentacuentos</I
></SPAN
> ;-) al tiempo que miraba el reloj - tengo que irme pues de otro modo ni siquiera voy a llegar a dar un beso a mis ni&ntilde;as, antes de que se acuesten. </P
><P
>Y as&iacute;, recogi&oacute; sus cosas como si le fuera la vida de en ello y desapareci&oacute;, dejando a l@s asistentes como flotando en una nube ... Poco a poco comenzaron a hablar entre ell@s y a abandonar la sala. Al rato todo el mundo se hab&iacute;a ido a sus hogares contentos de vivir en una sociedad d&oacute;nde se compart&iacute;a el conocimiento, contentos de participar en la comunidad universitaria que ten&iacute;a por siglas UNED. Los cr&iacute;ticos con el modelo dec&iacute;an que la educaci&oacute;n a distancia separaba a las personas, pero quienes sal&iacute;an de esa sala aquella noche sab&iacute;an que quiz&aacute;s hab&iacute;a sido as&iacute; en un pasado pero que ahora no.</P
><P
>Esa misma noche nuestro amigo Luis termin&oacute; de generar ejercicios resueltos para la asignatura de Fundamentos F&iacute;sicos de la Inform&aacute;tica. Y as&iacute; se acababa de materializar un nuevo granito de arena en la difusi&oacute;n del conocimiento.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="piezas.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="licencia.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>JUNTANDO LAS PIEZAS</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Licencia</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>