<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>JUNTANDO LAS PIEZAS</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Imagina que la Bibliografía Básica de la UNED fuera Libre"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="LOS PROBLEMAS"
HREF="problemas.html"><LINK
REL="NEXT"
TITLE="UN NUEVO MODELO EDUCATIVO"
HREF="modelo.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Imagina que la Bibliograf&iacute;a B&aacute;sica de la UNED fuera Libre</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="problemas.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="modelo.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="PIEZAS">6. JUNTANDO LAS PIEZAS</H1
><P
>Unas estrellas comenzaron a hacerse hueco en aquel cielo de verano tratando de hacer recordar a las (cada vez m&aacute;s) personas que conformaban el corro que la noche estaba llegando y que podr&iacute;a ser hora de ir recogiendo los b&aacute;rtulos y de que cada uno fuese a su casa a descansar, sin embargo, la expectaci&oacute;n que generaba el escuchar de primera mano la transformaci&oacute;n que vivi&oacute; la UNED de una manera tan positiva y radical como r&aacute;pida, era algo que hac&iacute;a olvidar lo que significaba el d&iacute;a y la noche. Y as&iacute;, continuando con la magia que el di&aacute;logo hab&iacute;a hecho despertar en los corazones de los asistentes, una nueva pregunta surgi&oacute; de los labios de Elisa:</P
><P
>- Nos has repetido ya varias veces que la bibliograf&iacute;a libre surgi&oacute; casi al mismo tiempo de iniciarse el proceso de virtualizaci&oacute;n que sufri&oacute; la UNED, pero &iquest;c&oacute;mo y cu&aacute;ndo la UNED de manera institucional adopt&oacute; este modelo como propio?</P
><P
>- Pues nunca y siempre. 
    Es decir, en el momento en que algun@s profesor@s promovieron los primeros 
    proyectos para liberar su bibliograf&iacute;a b&aacute;sica, pues supuso un 
    apoyo institucional muy fuerte :-). Al mismo tiempo, el equipo de gobierno 
    de la UNED nunca impuso un modelo u otro, aunque dentro del mismo s&iacute; hubo personas que apoyaban el modelo, as&iacute; como quien lo paraba y, al 
    principio la mayor&iacute;a no comprend&iacute;a sus ventajas o inconvenientes, con el tiempo s&iacute; fueron asimilando lo que esto supon&iacute;a y bueno pues hoy creo que nadie lo cuestiona :-)</P
><P
>- Lo que quiero decir es que &iquest;c&oacute;mo se integr&oacute; todo esto en el modelo educativo?</P
><P
>- Bien, pues de la misma manera que se juntan las piezas de un puzzle, primero coges las esquinas ... imaginemos que nuestras esquinas eran 1)la ayuda mutua entre l@s estudiantes 2)la virtualizaci&oacute;n de la ense&ntilde;anza 3)la defensa de lo p&uacute;blico  4)la vocaci&oacute;n transmisora del conocimiento de la universidad.</P
><P
>A lo mejor desde la esquina de ayuda mutua hasta la de virtualizaci&oacute;n hay un mont&oacute;n de piezas que son grupos de estudiantes en la Red, hasta la decisi&oacute;n que toma el equipo de gobierno de la UNED sobre c&oacute;mo se debe virtualizar, pasando por grupos de alumn@s que colaboran con profesor@s, grupos de profesor@s, programas geniales (plataformas educativas, sistemas tutores inteligentes, adaptativa, etc.) que ayudan a virtualizar la ense&ntilde;anza, todo se acaba juntando si te fijas c&oacute;mo son las piezas, a veces unas se parecen a otras, te equivocas, te bloqueas, hay que fijarse bien.</P
><P
>Pero desde la esquina de ayuda mutua entre l@s estudiantes, tambi&eacute;n hab&iacute;a piezas que son grupos de alumn@s que no est&aacute;n en la Red y que si vas juntando piezas se acercan a la esquina de la vocaci&oacute;n transmisora del conocimiento de la universidad donde estar&iacute;an los libros, la gente que se entrega en su trabajo y estudio, etc.</P
><P
>En la esquina de la defensa de lo p&uacute;blico estaban algunos sindicatos no mayoritarios, Centros Sociales Okupados y Autogestionados, el proyecto GNU, etc.</P
><P
>La documentaci&oacute;n 
    libre e Internet, simplemente eran las piezas claves del puzzle del nuevo 
    modelo educativo y estaban en el coraz&oacute;n del mismo.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="problemas.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="modelo.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>LOS PROBLEMAS</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>UN NUEVO MODELO EDUCATIVO</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>