<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>LOS PROBLEMAS</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Imagina que la Bibliografía Básica de la UNED fuera Libre"
HREF="index.html"><LINK
REL="PREVIOUS"
TITLE="LA DOCUMENTACION LIBRE EN LA UNED (HISTORIA)"
HREF="historia.html"><LINK
REL="NEXT"
TITLE="JUNTANDO LAS PIEZAS"
HREF="piezas.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Imagina que la Bibliograf&iacute;a B&aacute;sica de la UNED fuera Libre</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="historia.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
></TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="piezas.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="PROBLEMAS">5. LOS PROBLEMAS</H1
><P
>- &iexcl;vaya!- dijo de 
    pronto Luis - fue un tanto heroico por lo que veo. Y &iquest;nada de lo que hac&iacute;ais os contaba en la nota?</P
><P
>- Fueron muy raros los casos, hombre, cuando el profesor de la asignatura te conoce y sabe que te has currado el tema y suspendes por unas d&eacute;cimas pues al final te aprobaba, pero vamos contaba muy poco.</P
><P
>- pues no s&eacute; de que me quejaba con lo de Fundamentos F&iacute;sicos - susurr&oacute; Luis a Elisa.</P
><P
>- Lo importante - comenz&oacute; a comentar el ponente - es que hoy en todas las carreras hay documentaci&oacute;n libre y en Inform&aacute;tica toda la bibliograf&iacute;a b&aacute;sica lo es. Si no se hubiera hecho de ese modo, seguramente no se hubiera hecho de ninguna manera. Pero es que adem&aacute;s para nosotros el cambio de estar estudiando s&oacute;los en nuestras casas a aprender con un mont&oacute;n de gente en la Red con un objetivo concreto y apoyados de vez en cuando por un profesor o tutor, fue genial, una maravilla.</P
><P
>- &iquest;Por qu&eacute; no les cuentas las zancadillas que nos pusieron? - dijo de pronto alguien que hab&iacute;a permanecido hasta entonces en la retaguardia.</P
><P
>- Bueno, tampoco fueron tantas - respondi&oacute; el ponente quit&aacute;ndole importancia - Por un lado, las editoriales ingresaban importantes cantidades econ&oacute;micas por sus libros, algunas viv&iacute;an de los libros que vend&iacute;an a la UNED. Si un libro estaba en la Red dejar&iacute;a de venderse (o al menos eso pensaban) por eso impidieron incluso con denuncias que los libros no estuvieran en Internet, por otro lado algunos profesores cobraban alg&uacute;n dinero por derechos de autor y no quer&iacute;an renunciar a tales dineros. Esto realmente no supon&iacute;a serios problemas para la gente que empezamos a generar documentaci&oacute;n libre, pero s&iacute; supon&iacute;a un problema para la virtualizaci&oacute;n de la ense&ntilde;anza, me explico:</P
><P
>Los primeros documentos que adoptaron la <A
HREF="http://www.gnu.org/copyleft/gpl.html"
TARGET="_top"
>GFDL</A
> en la UNED eran colecciones de ejercicios y bibliograf&iacute;as b&aacute;sicas compuestas por apuntes y materiales cogidos de la Red, no hubo mucha dificultad en que esos documentos adoptaran la licencia que propon&iacute;amos, el agradecimiento de l@s alumn@s, las r&aacute;pidas mejoras, actualizaciones y correcciones de erratas fueron suficiente como para convencer a l@s profesor@s encargados, quienes se ve&iacute;an como mejoraba su asignatura, el aprendizaje de sus alumn@s, su prestigio, &iexcl;incluso sus ingresos!</P
><P
>Sin embargo, la UNED que se encontraba en un fuerte proceso de virtualizaci&oacute;n ve&iacute;a c&oacute;mo se imped&iacute;a y atrasaba ese proceso al no poder estar el material docente que segu&iacute;a estando exclusivamente en forma de libros, en la Red, lo cual llev&oacute; a m&aacute;s de un ultim&aacute;tum :-( Simplemente se ve&iacute;a con envidia la facilidad con que se virtualizaban las asignaturas con documentaci&oacute;n libre.</P
><P
>Por otro lado, empezaron a surgir alumn@s y peque&ntilde;as editoriales que vend&iacute;an esos libros libres y gratuitos, &iexcl;qu&eacute; absurdo! dec&iacute;an muchos &iquest;por qu&eacute; alguien va a querer comprar un libro que ya es gratuito? Bueno, no todo el mundo quiere hacer el tedioso y no siempre accesible trabajo de bajarse un libro e imprim&iacute;rselo, por otro lado un lector suele preferir una buena encuadernaci&oacute;n a una impresi&oacute;n casera. Yo tambi&eacute;n compr&eacute; y vend&iacute; libros :-). En fin las editoriales tradicionales se acabaron dando cuenta de que es rentable vender libros libres y que no hab&iacute;a que tener miedo de ello, lo que s&iacute; se asegur&oacute; es que esos libros no pod&iacute;an ser caros, porque si no la gente se los bajar&iacute;a de la Red, no se obten&iacute;an grandes m&aacute;rgenes por cada libro pero s&iacute; se vend&iacute;an muchos.</P
><P
>A medio plazo, las editoriales que vendieron libros libres vieron como sus libros eran conocidos por much&iacute;sima 
    gente y mejorados tambi&eacute;n por gran cantidad de personas, por tanto 
    mucha gente quer&iacute;a esos libros con su buena encuadernaci&oacute;n y 
    se los compraban a las editoriales que mejor sab&iacute;an aprovechar las 
    mejoras que se hac&iacute;an a esos libros, las que llevaban desde el principio vendi&eacute;ndolos.</P
><P
>- y &iquest;qu&eacute; dec&iacute;an l@s profesor@s de sus derechos de autor? - pregunt&oacute; alguien.</P
><P
>- como ya he dicho antes - comenz&oacute; el ponente - el prestigio que ganaron los autores que se dedicaron a liberar la bibliograf&iacute;a b&aacute;sica de sus asignaturas dejaba en rid&iacute;culo el escaso dinero que percib&iacute;an de las editoriales, adem&aacute;s en la GFDL se tiene un especial cari&ntilde;o y respeto hacia los autores de la obra, nunca se olvida qui&eacute;n ha realizado la obra y qui&eacute;n la ha modificado.</P
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="historia.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="index.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="piezas.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>LA DOCUMENTACION LIBRE EN LA UNED (HISTORIA)</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
>&nbsp;</TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>JUNTANDO LAS PIEZAS</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>