<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>Continuando con la lucha</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="A Brief Journey Through Hacker Hell"
href="chapter-12.html">
<link rel="NEXT" title="Epilogue: Crushing Loneliness" href=
"epilogue.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href=
"chapter-12.html" accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"epilogue.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-13">Cap&iacute;tulo 13. Continuando con la
lucha</a></h1>
<p>Para Richard Stallman, el tiempo puede no curar todas las
heridas, pero si es un aliado muy conveniente.</p>
<p>Cuatro a&ntilde;os despu&eacute;s de "La Catedral y el Bazar",
Stallman todav&iacute;a <span class="SYSTEMITEM">sigue
rumiando</span> la cr&iacute;tica de Raymond. Tambi&eacute;n se
queja de la elevaci&oacute;n de Linus Torvalds al papel del hacker
m&aacute;s famoso del mundo. Para ello recuerda una camiseta muy
popular que comenz&oacute; a aparecer en las conferencias de Linux
alrededor de 1999. Dise&ntilde;ada para imitar el afiche
pormocional orginal de la Guerra de las Galaxias, la camiseta
muestra a Torvalds blandiendo un sable de luz como Luke Skywalker,
mientras que la cara de Stallman se encuentra sobre R2D2. La
camiseta a&uacute;n destroza los nervios de Stallman, no
s&oacute;lo porqu&eacute; lo ubica e &eacute;l en el papel de
segund&oacute;n de Torvalds, sino tambi&eacute;n porqu&eacute;
otorga a Torvalds el papel de l&iacute;der de la comunidad del
software libre/ de fuente abierta, un papel que Torvalds mismo es
renuente a aceptar. "Es ir&oacute;nico", dice Stallman
lament&aacute;ndose. "Levantar la espada es exactamente lo que
Linus se rehusa a hacer. El logra que todo mundo se concentre en el
como el s&iacute;mbolo del movimiento, pero luego no pelea.
&iquest;Para que sirve entonces?</p>
<p>Una vez m&aacute;s, es esa misma renuencia a "levantar la
espada", por parte de Torvalds, la que ha dejado la puerta abierta
para que Stallman recupere su reputaci&oacute;n como el
&aacute;rbitro &eacute;tico de la comunidad hacker. A pesar de sus
lamentos, Stallman tiene que admitir que los &uacute;ltimos
a&ntilde;os han sido buenos tanto para el como para su
organizaci&oacute;n. Aunque fue relegado a la periferia por el
&eacute;xito imprevisto de GNU/Linux, Stallman ha sido capaz de
recuperar la iniciativa con &eacute;xito. Su calendario de charlas
entre Enero del 2000 y Diciembre del 2001 incluy&oacute; paradas en
seis continentes y visitas a pa&iacute;ses en los que la
noci&oacute;n de libertad de software tiene consecuencias
importantes --China e India, por ejemplo.</p>
<p>Fuera del p&uacute;lpito, Stallman tambi&eacute;n ha aprendido a
utilizar su poder como autor y defensor de la Licencia
P&uacute;blica de GNU (m&aacute;s conocida como la GPL
   (<i class="FOREIGNPHRASE">GNU General Public License</i>).
   Durante el verano del 2000, mientras el aire escapaba
   r&aacute;pidamente de la burbuja burs&aacute;til de Linux de
   1999, Stallman y la Fundaci&oacute;n para el Software Libre se
   anotaron dos victorias importantes. En julio del 2000, Troll
   Tech, una compa&ntilde;ia de software noruega, desarrolladora de
   Qt, un valioso conjunto de herramientas gr&aacute;ficas para el
   sistema operativo GNU/Linux, anuncio que iba a licenciar su
   software bajo la GPL. Unas pocas semanas mas tarde, Sun
   Microsystems, una compa&ntilde;&iacute;a que hasta entonces
   hab&iacute;a intentado montarse al tren del c&oacute;digo de
   fuente abierta, sin entregar del todo su c&oacute;digo,
   anunci&oacute; que iba a licenciar de manera doble la nueva
   aplicaci&oacute;n de oficina OpenOffice bajo la Licencia
   P&uacute;blica Leve de GNU (<i class="FOREIGNPHRASE">Lesser GNU
   Public License</i> o LGPL) y la Licencia de Est&aacute;ndares de
   la Industria de Sun (<i class="FOREIGNPHRASE">Sun Industry
   Standards Source License</i> o SISSL).</p>
<p>Detr&aacute;s de cada victoria estaba el hecho de que Stallman
hab&iacute;a hecho poco para pelear por ellas. En el caso de Troll
Tech, Stallman simplemente hab&iacute;a jugado el papel de
pont&iacute;fice del software libre. En 1999 la
compa&ntilde;&iacute;a hab&iacute;a creado una licencia que
cumpl&iacute;a las condiciones establecidas por la Fundaci&oacute;n
para el Software Libre, pero examinandola de manera mas detenida,
Stallman detect&oacute; incompatibilidades legales que
har&iacute;an imposible incluir Qt con programas protegidos por la
licencia GPL. Cansada de enfrentarse a Stallman, la gerencia de
Troll Tech finalmente decidi&oacute; dividir Qt en dos versiones,
una protegida por la GPL y otra protegida por la QPL,
d&aacute;ndoles a los desarrolladores una manera de rodear los
problemas de compatibilidad citados por Stallman.</p>
<p>En el caso de Sun, ellos deseaban jugar de acuerdo a las reglas
de la Fundaci&oacute;n para el Software libre. En la Conferencia de
Open Source de O'Reilly, en 1999, el cofundador y jefe
cient&iacute;fico de Sun Microsystems, Bill Joy defendi&oacute; la
licencia de "fuente comunitaria" (<i class=
"FOREIGNPHRASE">community source</i>) de su compa&ntilde;&iacute;a,
que no era m&aacute;s que un compromiso diluido que permit&iacute;a
a los usuarios copiar y modificar software de propiedad de Sun,
impidi&eacute;ndoles cobrar dicho software sin antes negociar un
acuerdo de regal&iacute;as con Sun. Un a&ntilde;o despu&eacute;s
del discurso de Joy, el vicepresidente de Sun Microsystems, Marco
Boerries se encontraba en el mismo escenario explicando el nuevo
compromiso de licenciamiento en el caso de OpenOffice, un grupo de
aplicaciones de oficina dise&ntilde;ado espec&iacute;ficamente para
el sistema operativo GNU/Linux.</p>
<p>"Lo puedo deletrear con tres letras", dijo Boerries. "GPL."</p>
<p>En ese momento, Boerries dijo que la decisi&oacute;n de su
compa&ntilde;&iacute;a ten&iacute;a muy poco que ver con Stallman y
estaba mas relacionada con el momentum de los programas protegidos
por la GPL. "B&aacute;sicamente reconocimos que diferentes
productos atraen a diferentes comunidades, y la licencia que usemos
depende del tipo de comunidad que queramos atraer", dijo Boerries.
"Con [OpenOffice], era claro que ten&iacute;amos la mayor
correlaci&oacute;n con la comunidad GPL." <a name="AEN2711"
   href="#FTN.AEN2711">[1]</a></p>
<p>Comentarios as&iacute; muestran la poco reconocida fuerza de la
GPL e, indirectamente, el genio pol&iacute;tico del hombre que
desempe&ntilde;&oacute; el papel mas importante en su
creaci&oacute;n. "No hay ning&uacute;n abogado sobre la faz de la
tierra que hubiera escrito la GPL tal como es", dice Eben Moglen,
profesor de leyes de la Universidad de Columbia y consejero general
de la Fundaci&oacute;n para el Software Libre. "Pero funciona. Y lo
hace gracias a la filosof&iacute;a de dise&ntilde;o de
Richard."</p>
<p>El trabajo de Moglen, un antiguo programador profesional, con
Stallman se remonta a 1990, cuando Stallman solicit&oacute; la
asesor&iacute;a legal de Moglen para un asunto privado. Moglen,
qui&eacute;n trabajaba entonces con el experto en encripci&oacute;n
Phillip Zimmerman durante las batallas legales de este contra la
Administraci&oacute;n de Seguridad Nacional, dice que se
sinti&oacute; halagado con la solicitud. "Le dije que usaba Emacs
todos los d&iacute;as de mi vida, y que ser&iacute;a necesario
mucho trabajo legal de mi parte para pagar la deuda."</p>
<p>Desde entonces Moglen, tal vez m&aacute;s que ning&uacute;n otro
individuo, ha tenido la oportunidad de observar como la
filosof&iacute;a hacker de Stallman se hace presente en el
&aacute;mbito legal. Moglen dice que las formas en que Stallman se
acerca a los c&oacute;digos legales y al c&oacute;digo del software
son, en su mayor parte, similares. "Debo decir que, como abogado,
pensar que lo que hay que hacer con un documento es corregir todos
los errores (<i class="FOREIGNPHRASE">bugs</i>) no tiene mucho
sentido", dice Moglen. "Hay incertidumbre en todo proceso legal, y
lo que la mayor&iacute;a de los abogados quiere hacer es obtener
para su cliente los beneficios de esa incertidumbre. El objetivo de
Richard es completamente opuesto. Su meta es eliminar la
incertidumbre, lo que es inherentemente imposible. Es
inherentemente imposible escribir una licencia que controle todas
las circunstancias de todos los sistemas legales de todo el mundo.
Pero si quisiera intentarlo deber&iacute;a intentarlo en la manera
en que Richard lo hace. La elegancia resultante, junto con la
simplicidad de dise&ntilde;o del producto, casi logran lo que hay
que lograr. Y de all&iacute; un poco de trabajo legal puede llevar
muy lejos."</p>
<p>Como la persona encargada de <span class="SYSTEMITEM">llevar el
ideario de Stallman</span>, Moglen comprende la frustraci&oacute;n
de los aliados potenciales. "Richard es un hombre que no quiere
comprometer asuntos que el considera fundamentales", dice Moglen,
"y no toma a la ligera los cambios de las palabras o incluso la
b&uacute;squeda de ambig&uuml;edad art&iacute;stica, que la
sociedad requiere frecuentemente de gran cantidad de gente".</p>
<p>Como la Fundaci&oacute;n para el Software Libre no ha querido
hacer presencia en asuntos por fuera del desarrollo de GNU y de
hacer cumplir la GPL, Moglen ha dedicado su energ&iacute;a sobrante
a ayudar a la <i class="FOREIGNPHRASE">Electronic Frontier
Foundation</i> (Fundaci&oacute;n para la Frontera
Electr&oacute;nica), una organizaci&oacute;n que proporciona
soporte legal a personas que deben defenderse contra las leyes de
derechos de autor, como Dmitri Skylarov. En el a&ntilde;o 2000,
Moglen tambi&eacute;n se desempe&ntilde;o como asesor legal directo
de un grupo de hackers que fueron procesados por hacer circular el
programa de desencripci&oacute;n de DVD llamado deCSS. A pesar del
silencio de su cliente principal en ambos casos, Moglen ha
aprendido a apreciar el valor de la terquedad de Stallman. "Han
habido ocasiones durante estos a&ntilde;os en que he ido donde
Richard para decirle `Tenemos que hacer esto. Tenemos que hacer
aquello. Aqu&iacute; tenemos la situaci&oacute;n
estrat&eacute;gica. He aqu&iacute; la siguiente movida. Esto es lo
que tenemos que hacer.' Y la respuesta de Richard siempre ha sido,
`No tenemos que hacer nada.' S&oacute;lo espera. Lo que deba
hacerse se har&aacute;."</p>
<p>"&iquest;Y saben qu&eacute;?" agrega Moglen. "Generalmente, ha
estado en lo cierto."</p>
<p><span class="SYSTEMITEM">Este tipo de comentarios contradicen lo
que Stallman dice de si mismo</span>: "Yo no soy bueno para jugar
juegos", dice Stallman, dirigi&eacute;ndose a sus m&uacute;ltiples
cr&iacute;ticos ocultos que lo ven como un h&aacute;bil estratega.
"No soy bueno para mirar hac&iacute;a adelante y anticipar lo que
alguien mas va a hacer. Mi manera de hacer las cosas siempre ha
sido concentrarme en los cimientos, decir `Hagamos los cimientos
tan fuertes como podamos hacerlos.'"</p>
<p>La popularidad cada vez mayor de la licencia GPL y su continua
fuerza gravitacional son los mejores homenajes a los cimientos
creados por Stallman y sus colegas de GNU. Aunque ya no puede
llamarse a si mismo "el &uacute;ltimo hacker verdadero", Stallman
puede sin embargo, tomar todo el cr&eacute;dito por la
construcci&oacute;n del marco &eacute;tico del movimiento del
software libre. Que los otros programadores modernos se sientan o
no confortables trabajando dentro de ese marco, es inmaterial. El
hecho de que exista una opci&oacute;n es el legado m&aacute;s
grande de Stallman.</p>
<p>Discutir el legado de Stallman en este punto parece un poco
prematuro. Stallman, de 48 a&ntilde;os en el momento en que se
escriben estas l&iacute;neas, a&uacute;n tiene varios a&ntilde;os
para aumentar o disminuir ese legado. De cualquier manera, la
naturaleza autom&aacute;tica de la conducci&oacute;n del movimiento
de software libre hace que sea tentador examinar la vida de
Stallman por fuera de las batallas del d&iacute;a a d&iacute;a de
la industria del software, y dentro de un marco m&aacute;s
hist&oacute;rico.</p>
<p>Para su propio cr&eacute;dito, Stallman rehusa todas las
oportunidades para especular. "Nunca he sido capaz de
dise&ntilde;ar planes acerca que como ser&aacute; el futuro", dice
Stallman, ofreciendo su propio epitafio anticipado. "Yo simplemente
dije `Voy a pelear. &iquest;Qui&eacute;n sabe d&oacute;nde
llegar&eacute;?'"</p>
<p>No hay ninguna duda de que, en el proceso de cazar peleas,
Stallman ha alienado a quienes de otra manera podr&iacute;an haber
sido sus m&aacute;s grandes paladines. Tambi&eacute;n es un
testamento a su entereza &eacute;tica el que incluso sus opositores
pol&iacute;ticos de anta&ntilde;o a&uacute;n puedan decir un par de
cosas positivas acerca de &eacute;l cuando son presionados. La
tensi&oacute;n entre Stallman el ide&oacute;logo y Stallman el
genio hacker, sin embargo, lleva a un bi&oacute;grafo a pensar:
&iquest;C&oacute;mo ver&aacute; la gente a Stallman cuando la
propia personalidad de Stallman no este all&iacute; para
interponerse el camino?</p>
<p>En los borradores iniciales de este libro, yo llam&eacute; a
esta pregunta la pregunta "de los 100 a&ntilde;os". Esperando
estimular una visi&oacute;n objetiva de Stallman y de su trabajo,
le solicit&eacute; a varias luminarias de la industria del software
que se sacar&aacute;n a si mismos del marco temporal actual y se
pusieran en la posici&oacute;n de un historiador mirando
hac&iacute;a atr&aacute;s al movimiento del software libre dentro
de 100 a&ntilde;os. Desde esa perspectiva es f&aacute;cil observar
similitudes entre Stallman y aquellos americanos del pasado, que
aunque fueron marginalmente importantes durante su vida, han
adquirido una importancia hist&oacute;rica, en relaci&oacute;n a su
&eacute;poca. Las comparaciones m&aacute;s simples incluyen a Henry
David Thoreau, fil&oacute;sofo trascendentalista y autor de
[<span class="CITATION">Sobre la Desobediencia Civil</span>], y a
John Muir, fundador del Club Sierra y padre del movimiento
ambientalista moderno. Tambi&eacute;n es f&aacute;cil ver las
similitudes con hombres como William Jennings Bryan, conocido como
"El Gran Comunero", l&iacute;der del movimiento populista, enemigo
de los monopolios, y un hombre que, a pesar de haber sido poderoso,
parece haber caido en la insignificancia hist&oacute;rica.</p>
<p>A pesar de no ser la primera persona en ver el software como
propiedad p&uacute;blica, Stallman tiene garantizado un pie de
p&aacute;gina en libros de historia futuros gracias a la GPL.
Sabiendo eso, parece necesario dar un paso atr&aacute;s y examinar
el legado de Richard Stallman por fuera del marco temporal actual.
&iquest;La GPL ser&aacute; algo que los programadores de software
usar&aacute;n en el a&ntilde;o 2102, o ser&aacute; algo que ya
habr&aacute; sido dejado a un lado mucho tiempo atr&aacute;s?
&iquest;Ser&aacute; el t&eacute;rmino "software libre" visto como
algo tan anticuado como lo es hoy "plata libre" o ser&aacute; visto
como una premonici&oacute;n a la luz de los eventos
pol&iacute;ticos posteriores? <a name="AEN2759" href=
"#FTN.AEN2759">[2]</a></p>
<p>La predicci&oacute;n del futuro es un deporte arriesgado, pero
la mayor&iacute;a de las personas, cuando les fue formulada la
pregunta, parec&iacute;an listos a contestar. "Dentro de cien
a&ntilde;os, Richard y unas pocas personas m&aacute;s van a merecer
mucho m&aacute;s que una nota de pie de p&aacute;gina", dice
Moglen. "Van a ser considerados como la l&iacute;nea principal de
la historia."</p>
<p>Las "pocas personas m&aacute;s" que Moglen postula para
cap&iacute;tulos de libros de texto del futuro incluyen a John
Gilmore, asesor de Stallman con la GPL y futuro fundador de la
<i class="FOREIGNPHRASE">Electronic Frontier Foundation</i>, y
Theodor Hol Nelson, tambi&eacute;n conocido como Ted Nelson, autor
del libro [<span class="CITATION"><i class="FOREIGNPHRASE">Literary
Machines</i></span>] (<span class="SYSTEMITEM">M&aacute;quinas
Literales</span>). Moglen dice que Stallman, Nelson, y Gilmore se
destacan, cada uno en su campo como figuras hist&oacute;ricas de
importancia. Le da cr&eacute;dito a Nelson, conocido por haber
acu&ntilde;ado el t&eacute;rmino "hipertexto", por haber
identificado el dilema de la propiedad de la informaci&oacute;n en
la Era Digital. Gilmore y Stallman, a su vez, reciben el
cr&eacute;dito por haber identificado los efectos pol&iacute;ticos
negativos del control de la informaci&oacute;n, y por haber creado
organizaciones --la Fundaci&oacute;n para la Frontera
Electr&oacute;nica en el caso de Gilmore y la Fundaci&oacute;n para
el Software Libre en el caso de Stallman-- para contrarrestar estos
efectos. De los dos, sin embargo, Moglen ve las actividades de
Stallman como m&aacute;s personales y de una naturaleza menos
pol&iacute;tica.</p>
<p>"Richard fue &uacute;nico porqu&eacute; para &eacute;l las
implicaciones &eacute;ticas del software no libre fueron
particularmente claras en un momento muy temprano", dice Moglen.
"Esto tiene mucho que ver con la personalidad de Richard, a la que
muchas personas, al escribir acerca de &eacute;l, intentar&aacute;n
tratar como epifen&oacute;menal, o incluso, como una desventaja en
el proyecto de vida de Richard Stallman."</p>
<p>Gilmore, qui&eacute;n describe su inclusi&oacute;n entre el
err&aacute;tico Nelson y el irascible Stallman como un
      <span class="SYSTEMITEM">"honor ambiguo"</span>, secunda sin
      embargo el argumento de Moglen. Gilmore escribe:</p>
<a name="AEN2777"></a>
<blockquote class="BLOCKQUOTE">
<p>Mi predicci&oacute;n es que los escritos de Stallman se
mantendr&aacute;n tan bien como lo han hecho los de Thomas
Jefferson; &eacute;l es un escritor bastante claro, y
tambi&eacute;n es claro en sus principios &hellip; El que Richard
llegue a ser tan influyente como Jefferson depender&aacute; de si
las abstracciones que nosotros llamamos "derechos civiles" terminan
siendo m&aacute;s importantes dentro de cien a&ntilde;os que las
abstracciones que llamamos "software" o "restricciones
t&eacute;cnicamente impuestas".</p></blockquote>
<p>Otro elemento del legado de Stallman que no debe ser pasado por
alto, es el modelo de desarrollo colaborativo de software en el que
el Proyecto GNU fue pionero. A pesar de tener sus fallas de cuando
en cuando, el modelo ha sido capaz de evolucionar para convertirse
en un est&aacute;ndar dentro de la industria del desarrollo del
software. Teniendo todo eso en cuenta, dice Gilmore, este modelo de
desarrollo colaborativo puede terminar siendo incluso m&aacute;s
importante que el proyecto GNU, la licencia GPL, o cualquier
programa de software particular desarrollado por Stallman:</p>
<a name="AEN2783"></a>
<blockquote class="BLOCKQUOTE">
<p>Antes de que existiera Internet, era bastante dif&iacute;cil
colaborar a distancia en el desarrollo de software, incluso entre
equipos que se conocen y conf&iacute;an el uno en el otro. Richard
fue pionero en el modelo colaborativo de desarrollo de software,
particularmente en aquel desarrollado por voluntarios
desorganizados que rara vez se reunen unos con otros. Richard no
construy&oacute; ninguna de las herramientas b&aacute;sicas para
hacer esto (el protocolo TCP, las listas de correo, diff y patch,
los archivos tar, RCS, CVS o CVS-remoto), pero utiliz&oacute;
aquellas que estaban disponibles para formar grupos sociales de
programadores que pudieran colaborar
efectivamente.</p></blockquote>
<p>Lawrence Lessig, profesor de leyes en Stanford y autor del
libro, [<span class="CITATION"><i class="FOREIGNPHRASE">The Future
of Ideas</i></span>] (El Futuro de las ideas), publicado en el 2001
es igualmente <i class="FOREIGNPHRASE">bullish</i>. Al igual que
muchos eruditos en el &aacute;rea legal, Lessig ve la GPL como un
terraplen que protege la llamada "comuna digital", la enorme
aglomeraci&oacute;n de programas de software en poder de la
comunidad, y est&aacute;ndares de redes y telecomunicaciones que
han impulsado el crecimiento exponencial de Internet durante las
&uacute;ltimas tres d&eacute;cadas. En vez de conectar a Stallman
con otros pioneros de Internet, hombres como Vannevar Bush, Vinton
Cerf, y J.C.R. Licklider, quienes convencieron a otros de entender
la tecnolog&iacute;a de computadores a una escala m&aacute;s
amplia, Lessig ve el impacto de Stallman como algo m&aacute;s
personal e introspectivo; en &uacute;ltima instancia, como algo
&uacute;nico:</p>
<a name="AEN2795"></a>
<blockquote class="BLOCKQUOTE">
<p>[Stallman] cambio el debate de "es" a "deber&iacute;a". Hizo ver
a la gente lo mucho que hab&iacute;a en juego, y construy&oacute;
un medio para llevar estos ideales adelante&hellip; No se realmente
c&oacute;mo ubicarlo en el contexto de Cerf o Licklider. La
innovaci&oacute;n es distinta. No es s&oacute;lo acerca de cierto
tipo de c&oacute;digo, o de permitir la Internet. [Es] mucho
m&aacute;s acerca de hacer que la gente vea el valor de un cierto
tipo de Internet. No creo que haya nadie m&aacute;s en ese campo,
antes o despu&eacute;s.</p></blockquote>
<p>No todo el mundo ve el legado de Stallman inscrito en piedra,
por supuesto. Eric Raymond, el proponente de <i class=
"FOREIGNPHRASE">open source</i> que siente que el papel de
liderazgo de Stallman ha disminuido significativamente desde 1996,
ve se&ntilde;ales ambiguas cuando contempla la bola de cristal del
a&ntilde;o 2102:</p>
<a name="AEN2799"></a>
<blockquote class="BLOCKQUOTE">
<p>Cre&oacute; que los artefactos de Stallman (la GPL, Emacs, GCC)
ser&aacute;n vistos como obras revolucionarias, como piedras
angulares del mundo de la informaci&oacute;n. Cre&oacute; que la
historia ser&aacute; menos benevolente con algunas de las
teor&iacute;as a partir de las cu&aacute;les RMS trabaj&oacute;, y
nada benevolente con su tendencia personal hac&iacute;a un
comportamiento territorrialista, de l&iacute;der
sectario.</p></blockquote>
<p>Stallman mismo, a su vez, ve se&ntilde;ales ambiguas:</p>
<a name="AEN2802"></a>
<blockquote class="BLOCKQUOTE">
<p>Lo que la historia diga acerca del Proyecto GNU, dentro de
veinte a&ntilde;os, depender&aacute; de qui&eacute;n gane la
batalla de la libertad para usar el conocimiento p&uacute;blico. Si
perdemos, ser&aacute; s&oacute;lo una nota al pie. Si ganamos, no
esta garantizado que la gente conozca el papel del sistema
operativo GNU --si piensan que el sistema es "Linux", entonces se
habr&aacute;n construido una imagen falsa de lo que sucedi&oacute;
y por qu&eacute;. Pero incluso si ganamos, la historia que la gente
aprender&aacute; dentro de 100 a&ntilde;os muy posiblemente dependa
de quien domine en la escena pol&iacute;tica.</p></blockquote>
<p>En busca de su propia analog&iacute;a con el siglo diecinueve,
Stallman trae a colaci&oacute;n la figura de John Brown, el
abolicionista militante visto como un h&eacute;roe a un lado de la
l&iacute;nea Mason Dixon y como un orate al otro. <a name="AEN2805"
href="#FTN.AEN2805">[3]</a></p>
<p>La revuelta de esclavos de John Brown nunca adquiri&oacute;
fuerza, pero durante el juicio subsiguiente &eacute;l
despert&oacute; un clamor nacional en pro de la abolici&oacute;n.
Durante la Guerra Civil, John Brown era un h&eacute;roe; 100
a&ntilde;os despu&eacute;s, y durante la mayor&iacute;a del siglo
veinte, los textos de historia a&uacute;n ense&ntilde;aban que
estaba loco. Durante la era de segregaci&oacute;n legal,
cu&aacute;ndo la intolerancia era absurda, los Estados Unidos
aceptaron parcialmente la historia que el Sur deseaba contar de si
mismo, y los libros de historia dec&iacute;an muchas cosas falsas
acerca de la Guerra Civil y los eventos relacionados con ella.</p>
<p>Ese tipo de comparaciones documentan tanto la naturaleza
perif&eacute;rica autopercibida del trabajo actual de Stallman,
como la naturaleza binaria de su reputaci&oacute;n actual. Es
dif&iacute;cil imaginarse la reputaci&oacute;n de Stallman cayendo
a los niveles de infamia a los que cay&oacute; la de Brown durante
el periodo que sigui&oacute; a la Reconstrucci&oacute;n. A pesar de
ello y de que Stallman, con excepci&oacute;n de las
analog&iacute;as de guerra ocasionales, ha hecho muy poco para
inspirar violencia, es f&aacute;cil imaginar un futuro en el que
las ideas de Stallman terminan entre las cenizas. Al convertir la
causa del software libre no en un movimiento masivo sino en una
colecci&oacute;n de batallas privadas contra la fuerza de las
tentaciones propietarias, Stallman ha creado una situaci&oacute;n
imposible de ganar, especialmente para los muchos ac&oacute;litos
con el mismo caracter terco.</p>
<p>Consider&aacute;ndolo de nuevo, puede que ese mismo caracter
alg&uacute;n d&iacute;a sea considerado como el legado m&aacute;s
duradero de Stallman. Moglen, un observador cercano durante la
&uacute;ltima d&eacute;cada, advierte a aquellos que piensan que la
personalidad de Stallman es contraproducente o epifenomenal a los
"artefactos" de la vida de Stallman. Sin esa personalidad, dice
Moglen, habr&iacute;a muy pocos de esos preciosos artefactos.
Citando a Moglen, un antiguo ayudante de la Corte Suprema:</p>
<a name="AEN2810"></a>
<blockquote class="BLOCKQUOTE">
<p>Mire, el hombre m&aacute;s grande para el que he trabajado fue
Thurgood Marshall. Yo sab&iacute;a lo que lo hac&iacute;a un buen
hombre. Sab&iacute;a porqu&eacute; hab&iacute;a sido capaz de
cambiar el mundo de la manera en que pod&iacute;a.
      <span class="SYSTEMITEM">Estar&iacute;a aventurando
      demasiado</span> si tratara de hacer una comparaci&oacute;n,
      porqu&eacute; no podr&iacute;an ser m&aacute;s distintos.
      Thurgood Marshall era un hombre en sociedad, representando
      una sociedad marginada dentro de la sociedad que lo rodeaba,
      pero a&uacute;n as&iacute;, un hombre en sociedad. Sus
      habilidades eran habilidades sociales. Pero era todo en una
      pieza, igual que Stallman. A pesar de ser tan diferentes en
      todos los dem&aacute;s aspectos, la persona con la que
      m&aacute;s comparo a Thurgood Marshall en ese aspecto, en ser
      todo de una pieza, compacto, hecho de la sustancia de la que
      est&aacute;n hechas las estrellas, es
      Stallman.</p></blockquote>
<p>En un intento por afianzar esa imagen, Moglen se inspira en un
momento que compartieron en la primavera del a&ntilde;o 2000. El
&eacute;xito de la salida a la bolsa de VA Linux a&uacute;n
resonaba en los medios de negocios, y media docena de asuntos
relacionados con el software libre se mov&iacute;an entre los
medios. Rodeado por un hurac&aacute;n de historias y de situaciones
que necesitaban un comentario, Moglen recuerda haberse sentado a
almorzar con Stallman sinti&eacute;ndose como un na&uacute;frago en
el ojo de la tormenta. Durante la siguiente hora, seg&uacute;n dice
&eacute;l, la conversaci&oacute;n gir&oacute; calmadamente
alrededor de un &uacute;nico tema: reforzar la GPL.</p>
<p>"Estabamos all&iacute; sentados hablando sobre lo que
&iacute;bamos a hacer respecto a ciertos problemas en Europa
Oriental y sobre lo que har&iacute;amos cuando el problema de la
propiedad del contenido comenzara a amenazar al software libre",
recuerda Moglen. "A medida que habl&aacute;bamos, pense brevemente
acerca del cuadro que ve&iacute;an los transeuntes que pasaban. He
aqu&iacute;, dos peque&ntilde;os anarquistas barbados, conspirando
y planeando los pasos a seguir. Y, por supuesto, Richard arrancando
los nudos de su cabello, dej&aacute;ndolos caer en la sopa y
comport&aacute;ndose de la manera de siempre. Cualquiera que
escuchara nuestra conversaci&oacute;n habr&iacute;a pensado que
est&aacute;bamos locos, pero yo sab&iacute;a: Yo sab&iacute;a que
la revoluci&oacute;n estaba all&iacute;, en esa mesa. Eso es lo que
hace que ocurra. Y ese hombre es la persona haci&eacute;ndolo
ocurrir."</p>
<p>Moglen dice que el momento, m&aacute;s que cualquier otro,
<span class="SYSTEMITEM">le hizo comprender</span> la simplicidad
elemental del estilo de Stallman.</p>
<p>"Fue gracioso", recuerda Moglen. "Yo le dije a &eacute;l,
`Richard, t&uacute; sabes que t&uacute; y yo somos los dos tipos
que no ganamos dinero con esta revoluci&oacute;n.' Y luego
pagu&eacute; el almuerzo porqu&eacute; yo sab&iacute;a que el no
ten&iacute;a el dinero para hacerlo.'"</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN2711"
   href="chapter-13.html#AEN2711">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Marco Boerries, entrevista con el autor (Julio,
2000).</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN2759"
   href="chapter-13.html#AEN2759">[2]</a></td>
<td align="left" valign="top" width="95%">
<p>El t&eacute;rmino <i class="FOREIGNPHRASE">Free Silver</i> se
refiere a uno de los estandartes de campa&ntilde;a de Jennings en
las presidenciales de 1896. La idea del dem&oacute;crata era
abandonar el patr&oacute;n oro, que manten&iacute;a los precios
bajos y la inflaci&oacute;n controlada, para pasar a respaldar los
d&oacute;lares emitidos por el gobierno con plata, lo que,
seg&uacute;n Jennings, redundar&iacute;a en beneficios para los
granjeros, que recibir&iacute;an mas dinero por sus cosechas. (Nota
del traductor)</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN2805"
   href="chapter-13.html#AEN2805">[3]</a></td>
<td align="left" valign="top" width="95%">
<p>La l&iacute;nea Mason Dixon era considerada la frontera entre
los estados esclavistas y los abolicionistas durante la Guerra de
Secesi&oacute;n estadounidense.</p></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="chapter-12.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="epilogue.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">A Brief Journey Through
Hacker Hell</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">Epilogue: Crushing
Loneliness</td></tr></table></div>
</body>
</html>
