<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>Un retrato del hacker adolescente</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="2001: La Odisea de un Hacker"
      href="chapter-2.html">
<link rel="NEXT" title="Impeach God" href="chapter-4.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href=
"chapter-2.html" accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"chapter-4.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-3">Cap&iacute;tulo 3. Un retrato del hacker
adolescente</a></h1>
<p>La madre de Richard Stallman, Alicia Lippman, todav&iacute;a
recuerda el momento en que not&oacute; que su hijo tenia un don
especial.</p>
<p>"Creo que fue cuando &eacute;l ten&iacute;a ocho a&ntilde;os,"
Lippman recuerda.</p>
<p>El a&ntilde;o era 1961, y Lippman, una madre soltera
recientemente divorciada, estaba <span class="SYSTEMITEM">pasando
el tiempo</span> una tarde de un fin de semana, dentro del
peque&ntilde;o apartamento familiar del Upper West Side de
Manhattan. Hojeando una copia del Scientific American, Lippman
lleg&oacute; a su secci&oacute;n favorita, la columna escrita por
Martin Gardner intitulada "Juegos Matem&aacute;ticos." Lippman, una
profesora sustituta de arte, siempre disfrut&oacute; la columna de
Gardner debido a los retos mentales que ella prove&iacute;a. Con su
hijo ya <span class="SYSTEMITEM">concentrado</span> en un libro en
el sofa contiguo, Lippman decidi&oacute; tratar de resolver el
rompecabezas de la semana.</p>
<p>"Yo no era la mejor en lo que se refer&iacute;a a la
resoluci&oacute;n de problemas," ella admite. "Pero como artista,
encontr&eacute; que ellos me ayudaban a traspasar barreras
conceptuales."</p>
<p>Lippman dice que su intento de resolver el problema
encontr&oacute; inmediatamente una barrera insoslayable. Cercana a
arrojar la revista con disgusto, Lippman se vio sorprendida por un
suave tir&oacute;n a la manga de su camisa.</p>
<p>"Era Richard," ella recuerda, "El quer&iacute;a saber si yo
necesitaba ayuda."</p>
<p>Oscilando entre el rompecabezas y su hijo, Lippman cuenta que
inicialmente ella observ&oacute; con escepticismo el ofrecimiento
de su hijo. "Le pregunt&eacute; a Richard si &eacute;l hab&iacute;a
le&iacute;do la revista," ella relata. "Me dijo que si, y
a&uacute;n m&aacute;s &eacute;l ya hab&iacute;a resuelto el
rompecabezas. A continuaci&oacute;n &eacute;l comenz&oacute; a
explicarme como resolverlo."</p>
<p>Escuchando la l&oacute;gica de la forma en que su hijo
atac&oacute; el problema, el escepticismo de Lippman,
r&aacute;pidamente desemboc&oacute; en incredulidad. "Quiero decir,
siempre supe que era un ni&ntilde;o brillante," ella cuenta, "pero
esta era la primera vez en que notaba algo que le sugir&iacute;a;
lo avanzado que en realidad estaba."</p>
<p>Treinta a&ntilde;os despu&eacute;s del hecho, Lippman precisa su
memoria con una risa. "Para decir verdad, no creo que nunca
habr&iacute;a yo de resolver el rompecabezas," ella relata. "Todo
lo que recuerdo es haberme sorprendido de que el supiera la
respuesta."</p>
<p>Sentada en el comedor de su segundo apartamento de Manhattan- el
mismo complejo espacioso de tres habitaciones que ella y su hijo
ocupar&iacute;an despu&eacute;s del matrimonio de ella en 1967 con
Maurice Lippman, ya fallecido- Alice Lippman exuda una mezcla de
orgullo de madre jud&iacute;a y de perplejidad cuando rememora los
primeros a&ntilde;os de vida de su hijo. El comedor
      <span class="SYSTEMITEM">aparador</span> contiguo ofrece una
      foto de ocho por diez de Stallman ofreciendo una mirada con
      el ce&ntilde;o fruncido, con barba completa y traje de
      doctorado. La imagen hace parecer peque&ntilde;as las fotos
      acompa&ntilde;antes de los sobrinos y nietos de Lippman, pero
      antes de que el visitante pueda sacar conclusiones de esto,
      Lippman se asegura de balancear su lugar prominente con un
      comentario ir&oacute;nico.&gt;</p>
<p>"Richard insisti&oacute; en que la tuviera despu&eacute;s de su
doctorado honorario de la Universidad de Glasgow," cuenta Lippman.
"El me dijo, `Adivina que, mam&aacute;? Es la primera ceremonia de
graduaci&oacute;n a la que he asistido.'"<a name="AEN375" href=
"#FTN.AEN375">[1]</a></p>
<p>Tales comentarios reflejan el sentido de humor que se desarrolla
cuando se educa a un ni&ntilde;o prodigio. No se equivoquen, por
cada historia que Lippman escucha o lee acerca de la testarudez y
del comportamiento inusual de su hijo, ella puede replicar con al
menos una docena de historias similares.</p>
<p>"El sol&iacute;a ser tan conservador," ella cuenta, lanzando sus
brazos con una mueca de exasperaci&oacute;n. "Sol&iacute;amos tener
las peores discusiones justo aqu&iacute; en este comedor. Yo hice
parte del primer grupo de maestros de escuelas p&uacute;blicas
locales que lucharon para formar un sindicato, y Richard estaba muy
furioso conmigo. El ve&iacute;a a los sindicatos como corruptos.
El, tambi&eacute;n, se opon&iacute;a a la seguridad social. El
pensaba que la gente pod&iacute;a hacer mucho m&aacute;s dinero
invirtiendo en s&iacute; mismos. Quien ir&iacute;a a imaginar, que
en menos de diez a&ntilde;os se habr&iacute;a de volver tan
idealista? Todo lo que recuerdo es a su hermana menor venir a mi
diciendo, `Qu&eacute; es lo que el ser&aacute; cuando grande? Un
fascista?'"</p>
<p>Como madre soltera por cerca de una d&eacute;cada -ella y el
padre de Richard, Daniel Stallman, que se casaron en 1948, se
divorciaron en 1958, y despu&eacute;s compartieron la custodia de
su hijo- Lippman puede atestiguar acerca de la aversi&oacute;n de
su hijo por la autoridad. Ella tambi&eacute;n puede atestiguar
acerca del deseo de conocimiento de su hijo. Fue cuando estas dos
fuerzas se conjugaron, Lippman dice, que ella y su hijo
experimentaron sus m&aacute;s grandes batallas.</p>
<p>"Fue como si el nunca hubiera querido comer," cuenta Lippman,
recordando el patr&oacute;n de comportamiento que estableci&oacute;
alrededor de los ocho a&ntilde;os de edad y que nunca
abandon&oacute; sino hasta la graduaci&oacute;n de bachillerato de
1970 de su hijo. "Lo llam&eacute; a comer, y el nunca me
oy&oacute;. Hube de llamarlo 9 o 10 veces tan s&oacute;lo para
obtener su atenci&oacute;n. El estaba totalmente inmerso."</p>
<p>Stallman, por su parte, recuerda cosas de una manera similar,
aunque con un giro pol&iacute;tico.</p>
<p>"Me encantaba leer," el dice. "Cuando quer&iacute;a leer, y mi
madre me llamaba a la cocina a comer e ir a dormir, no iba a
escucharla. No ve&iacute;a ninguna raz&oacute;n por la cual no
habr&iacute;a de seguir leyendo. Ninguna raz&oacute;n para que ella
me dijera lo que ten&iacute;a que hacer, punto. Esencialmente, las
ideas sobre las cuales habia le&iacute;do, tales como democracia y
libertad individual, las aplicaba a m&iacute; mismo. No ve&iacute;a
ninguna raz&oacute;n por la cual los ni&ntilde;os habr&iacute;an de
ser excluidos de estos principios."</p>
<p>La creencia en la libertad individual por encima de la autoridad
arbitraria se extendi&oacute; al colegio, tambi&eacute;n. Con dos
a&ntilde;os por delante de sus compa&ntilde;eros de clase para
cuando ten&iacute;a 11 a&ntilde;os de edad, Stallman sufri&oacute;
todas las frustraciones usuales en los ni&ntilde;os prodigio en las
escuelas publicas. No fue mucho despu&eacute;s del incidente con el
rompecabezas que su madre asisti&oacute; a la primera de la que
habr&iacute;a de ser una larga cadena de charlas entre padres y
maestros.</p>
<p>"El se negaba absolutamente a escribir textos," cuenta Lippman,
recordando una de sus primeras controversias. "Pienso que el
&uacute;ltimo texto que &eacute;l escribi&oacute; antes de su
&uacute;ltimo a&ntilde;o de bachillerato fue un ensayo acerca de la
historia del sistema num&eacute;rico occidental en para un profesor
de cuarto de primaria."</p>
<p>Con un don para todo aquello que requiriese pensamiento
anal&iacute;tico, Stallman se inclin&oacute; por las
matem&aacute;ticas y las ciencias a expensas del resto de materias.
Lo que algunos profesores vieron como una mente resuelta, sin
embargo, Lippman vi&oacute; como impaciencia. Las
matem&aacute;ticas y la ciencia simplemente ofrec&iacute;an
demasiadas oportunidades para aprender, especialmente en
comparaci&oacute;n con temas y b&uacute;squedas para las cuales su
hijo parec&iacute;a menos naturalmente inclinado. Alrededor de los
10 u 11, cuando los ni&ntilde;os en el curso de Stallman comenzaron
a jugar regularmente de f&uacute;tbol, ella recuerda cuando su hijo
regres&oacute; a casa envuelto en ira. "El quer&iacute;a tanto
jugar, pero simplemente no tenia las destrezas de
coordinaci&oacute;n requeridas," Lippman recuerda. "Eso lo puso muy
furioso."</p>
<p>La rabia eventualmente llev&oacute; a su hijo a enfocarse
a&uacute;n m&aacute;s en matem&aacute;ticas y ciencias. Aun en el
reino de la ciencia, sin embargo, la impaciencia de su hijo
podr&iacute;a llegar a ser problem&aacute;tica. Estudiando
detenidamente los libros de texto de c&aacute;lculo para cuando
contaba siete a&ntilde;os de edad, Stallman veia poca necesidad en
callar su su discurso ante los adultos. En alg&uacute;n momento,
durante sus a&ntilde;os de colegio, Lippman contrat&oacute; un
estudiante de la vecina, Universidad de Columbia para que hiciera
de hermano mayor de su hijo. El estudiante abandon&oacute; el
apartamento despu&eacute;s de su primera sesi&oacute;n y nunca
regres&oacute;.</p>
<p>Otra an&eacute;cdota favorita de la madre data de comienzos de
los a&ntilde;os 1960, poco despu&eacute;s del incidente con el
rompecabezas. Cuando ten&iacute;a alrededor de siete a&ntilde;os,
dos a&ntilde;os depu&eacute;s del divorcio y la
relocalizaci&oacute;n de Queens, Richard tom&oacute; el pasatiempo
de los modelos de lanzamiento de cohetes en el vecino Parque de
Riverside Drive. Lo que comenz&oacute; como una diversi&oacute;n
inofesiva pronto tom&oacute; un cariz de suma seriedad en la medida
que su hijo comenz&oacute; a registrar datos de cada lanzamiento.
Igual que el inter&eacute;s en juegos matem&aacute;ticos, la
actividad atrajo poca atanci&oacute;n hasta que un d&iacute;a,
justo antes de un gran lanzamiento de cohetes de la NASA, Lippman
inquiri&oacute; a Richard para ver si estaba interesado en
observar.</p>
<p>"El estaba echando humo," Lippman cuenta. "Todo lo que pudo
decirme fue, <span class="SYSTEMITEM">`Pero si no estoy listo para
publicar todav&iacute;a.'</span> Aparentemente el ten&iacute;a algo
que verdaderamente quer&iacute;a mostrarle a la NASA."</p>
<p>Tales an&eacute;cdotas ofrecen una evidencia temprana de la
intensidad que se convertir&iacute;a en la marca distintiva de
Stallman a lo largo de su vida. Cuando otros ni&ntilde;os se
sentaban a la mesa, Stallman permanec&iacute;a en su cuarto a leer.
Cuando otros ni&ntilde;os jugaban a ser Johnny Unitas, Stallman
jugaba a ser Werner von Braun. "Yo era extra&ntilde;o," Stallman
dice, recordando sus a&ntilde;os tempranos sucintamente en una
entrevista de 1999. "Despu&eacute;s de cierta edad, los
&uacute;nicos amigos que yo ten&iacute;a eran profesores."
   <a name="AEN394" href="#FTN.AEN394">[2]</a></p>
<p>Auncuando esto significara m&aacute;s comparecencias por
disciplina en el colegio, Lippman decidi&oacute; ser indulgente con
la pasi&oacute;n de su hijo. Cuando ten&iacute;a 12 a&ntilde;os de
edad, Richard atend&iacute;a a los campamentos de ciencia durante
el verano y al colegio privado durante el a&ntilde;o escolar.
Cuando un profesor le recomend&oacute; a ella que lo enrolara en el
Programa de Honores de Ciencia de Columbia, un programa
post-Sputnik dise&ntilde;ado para estudiantes talentosos de los
cursos medios y altos de colegio en New York City,
      <span class="SYSTEMITEM">Stallman acept&oacute; aumentar sus
      actividades extracurriculares y pronto se encontr&oacute;
      viajando a la</span> <span class="SYSTEMITEM">parte
      alta</span> de la ciudad para llegar al campus de la
      Universidad de Columbia todos los s&aacute;bados.</p>
<p>Dan Chess, un compa&ntilde;ero de clase en el Programa de
Honores de Ciencias de Columbia, recuerda a Richard Stallman
pareci&eacute;ndole un tanto extra&ntilde;o a&uacute;n entre
estudiantes que compart&iacute;an un deseo similar por
matem&aacute;ticas y ciencias. "Todos eramos geeks y nerds, pero
&eacute;l estaba inusualmente desadaptado," recuerda Chess, ahora
un profesor de matem&aacute;ticas en el Hunter College. "El
tambi&eacute;n era listo como el demonio. He conocido mucha gente
lista, pero creo que &eacute;l era la persona m&aacute;s lista que
jam&aacute;s he conocido."</p>
<p>Seth Breidbart, un compa&ntilde;ero y alumno del Programa de
Honores de Ciencias de Columbia, ofrece un testomonio
      <span class="SYSTEMITEM">reforzador</span>. Un programador de
      computadores que se ha mantenido en contacto con Richard
      Stallman gracias a una pasi&oacute;n compartida por la
      ciencia ficci&oacute;n y las convenciones de ciencia
      ficci&oacute;n, le recuerda a un Stallman de 15 a&ntilde;os
      <i class="FOREIGNPHRASE">buzz-cut-wearing</i> tan
      "intimidante", especialmente para un compa&ntilde;ero de 15
      a&ntilde;os de edad.</p>
<p>"Es dif&iacute;cil de describir," Breidbart dice. "No era como
si el fuera inabordable. El era simplemente demasiado intenso. [El
era] muy conocedor pero tambi&eacute;n muy testarudo de ciertas
formas."</p>
<p>Tales descripciones invitan a la especulaci&oacute;n: los
adjetivos cargados de juicio tales como "intenso" y "testarudo" son
simplemente una forma de describir rasgos que hoy en d&iacute;a
podr&iacute;an ser categorizados como un desorden juvenil de
comportamiento? Un diciembre del 2001, un art&iacute;culo de la
revista [ <span class="CITATION">Wired</span> ]intitulado "El
S&iacute;ndrome Geek" dibuja el retrato de varios ni&ntilde;os
cient&iacute;ficamente dotados diagnosticados con autismo
   <i class="FOREIGNPHRASE">high-functioning</i> o S&iacute;ndrome
   de Asperger. De varias formas, los recuerdos paternos
   registrados en el art&iacute;culo de [<span class=
   "CITATION">Wired</span>] article are eerily are eerily similar
   to the ones offered by Lippman. Even Stallman has indulged in
   psychiatric revisionism from time to time. During a 2000 profile
   for the [<span class="CITATION">Toronto Star</span>], Stallman
   described himself to an interviewer as "borderline
   autistic,"<a name="AEN427" href="#FTN.AEN427">[3]</a> a
   description that goes a long way toward explaining a lifelong
   tendency toward social and emotional isolation and the equally
   lifelong effort to overcome it.</p>
<p>Such speculation benefits from the fast and loose nature of most
so-called "behavioral disorders" nowadays, of course. As Steve
Silberman, author of "The Geek Syndrome," notes, American
psychiatrists have only recently come to accept Asperger Syndrome
as a valid umbrella term covering a wide set of behavioral traits.
The traits range from poor motor skills and poor socialization to
high intelligence and an almost obsessive affinity for numbers,
computers, and ordered systems.<a name="AEN442" href=
"#FTN.AEN442">[4]</a> Reflecting on the broad nature of this
umbrella, Stallman says its possible that, if born 40 years later,
he might have merited just such a diagnosis. Then again, so would
many of his computer-world colleagues.</p>
<p>"It's possible I could have had something like that," he says.
"On the other hand, one of the aspects of that syndrome is
difficulty following rhythms. I can dance. In fact, I love
following the most complicated rhythms. It's not clear cut enough
to know."</p>
<p>Chess, for one, rejects such attempts at back-diagnosis. "I
never thought of him [as] having that sort of thing," he says. "He
was just very unsocialized, but then, we all were."</p>
<p>Such descriptions give rise to speculation: are judgment-laden
adjectives like "intense" and "hardheaded" simply a way to describe
traits that today might be categorized under juvenile behavioral
disorder? A December, 2001, [<span class="CITATION">Wired</span>]
magazine article titled "The Geek Syndrome" paints the portrait of
several scientifically gifted children diagnosed with
high-functioning autism or Asperger Syndrome. In many ways, the
parental recollections recorded in the [<span class=
"CITATION">Wired</span>] article Lippman, on the other hand,
entertains the possibility. She recalls a few stories from her
son's infancy, however, that provide fodder for speculation. A
prominent symptom of autism is an oversensitivity to noises and
colors, and Lippman recalls two anecdotes that stand out in this
regard. "When Richard was an infant, we'd take him to the beach,"
she says. "He would start screaming two or three blocks before we
reached the surf. It wasn't until the third time that we figured
out what was going on: the sound of the surf was hurting his ears."
She also recalls a similar screaming reaction in relation to color:
"My mother had bright red hair, and every time she'd stoop down to
pick him up, he'd let out a wail."</p>
<p>In recent years, Lippman says she has taken to reading books
about autism and believes that such episodes were more than
coincidental. "I do feel that Richard had some of the qualities of
an autistic child," she says. "I regret that so little was known
about autism back then."</p>
<p>Over time, however, Lippman says her son learned to adjust. By
age seven, she says, her son had become fond of standing at the
front window of subway trains, mapping out and memorizing the
labyrinthian system of railroad tracks underneath the city. It was
a hobby that relied on an ability to accommodate the loud noises
that accompanied each train ride. "Only the initial noise seemed to
bother him," says Lippman. "It was as if he got shocked by the
sound but his nerves learned how to make the adjustment."</p>
<p>Para la mayor&iacute;a de las veces, Lippman recuerda a su hijo
exhibiendo la exitaci&oacute;n, energ&iacute;a y destrezas sociales
de cualquier ni&ntilde;o normal. No fue sino despu&eacute;s de una
serie de eventos traum&aacute;ticos que <span class=
"SYSTEMITEM">destruyeron</span> el hogar de Stallman, ella dice,
que su hijo se volvi&oacute; introvertido y emocionalmente
distante.</p>
<p>El primer evento traum&aacute;tico fue el divorcio de Alice y
Daniel Stallman, el padre de Richard. Aun cuando Lippman dice que
tanto ella como su ex-esposo trataron de preparar a su hijo para el
golpe, ella dice que el golpe fue devastador sin embargo. "El hizo
como si no hubiera prestado atenci&oacute;na cuando nosotros le
contamos lo que estaba sucediendo," Lippman recuerda. "Pero la
realidad le golpe&oacute; en la cara cuando &eacute;l y yo nos
trasteamos a un nuevo apartamento. La primera cosa que &eacute;l
dijo fue, `D&oacute;nde est&aacute;n los muebles de papa?'"</p>
<p>Durante la siguiente d&eacute;cada, Stallman habr&iacute;a de
emplear sus d&iacute;as de entre semana en el aprtamento de su
madre en Manhattan y sus fines de semana en el hogar de su padre en
Queens. El <span class="SYSTEMITEM">ir y venir</span> le di&oacute;
la oportunidad de estudiar el par de estilos contrastantes de ser
padres que, hasta este d&iacute;a, deja a Stallman firmemente
opuesto a la idea de criar un ni&ntilde;o el mismo. Hablando de su
padre, un veterano de la segunda guerra mundial que falleci&oacute;
a inicios del 2001, Stallman balancea respeto con rabia. Por un
lado, hay un hombre cuyo compromiso moral lo llev&oacute; a
aprender franc&eacute;s con el fin de poder ser mas &uacute;til
para los aliados cuando ellos finalmente vinieron. Por el otro
lado, ah&iacute; estaba un padre que siempre supo como ingeniarse
una humillaci&oacute;n para lograr un efecto cruel. <a name=
"AEN462" href="#FTN.AEN462">[5]</a></p>
<p>"Mi padre ten&iacute;a un temperamento horrible," Stallman dice.
"El nunca grit&oacute;, pero &eacute;l siempre encontr&oacute;
alguna forma de criticarlo a uno de una manera fr&iacute;a, y
dise&ntilde;ado para abatirlo a uno."</p>
<p>En lo que respecta a la vida en el apartamento de su madre,
Stallman es menos equ&iacute;voco. "Eso era guerra," el dice. "Yo
sol&iacute;a decir en mi miseria, `Quiero irme a casa,'
significando aqule lugar inexistente que yo nunca
tendr&eacute;."</p>
<p>Durante los primeros a&ntilde;os despu&eacute;s del divorcio,
Stallman encontr&oacute; la tranquilidad que lo eludi&oacute; en la
casa de sus abuelos paternos. Entonces, cuando estaba alrededor de
lo 10 a&ntilde;os de edad, sus abuelos murieron en una corta
sucesi&oacute;n. Para Stallman, la p&eacute;rdida fue devastadora.
"Yo sol&iacute;a ir y visitarlos y me sent&iacute;a en un ambiente
gentil y amoroso," Stallman recuerda. "Este era el &uacute;nico
lugar que yo habr&iacute;a de encontrar, hasta cuando entre al
college."</p>
<p>Lippman lista la muerte de los abuelos paternos de Richard como
el segundo evento traum&aacute;tico. "Esto realmente lo indispuso,"
ella dice. El era muy cercano a ambos abuelos. Antes de que ellos
murieran, &eacute;l era bastante extrovertido, casi del tipo de
l&iacute;der de la manada cuando estaba con los otros chicos.
Despu&eacute;s de que ellos murieran, el se volvi&oacute; mucho
m&aacute;s retraido emocionalmente."</p>
<p>Desde la perspectiva de Stallman, el retraimiento emocional era
meramente un intento por hacerse cargo con la gon&iacute;a de la
adolescencia. Etiquetando a sus a&ntilde;os adolescentes como
"horror puro," Stallman dice que &eacute;l usualmente se
sinti&oacute; como una persona sorda en medio de una multitud de
rechinantes escuchadores de m&uacute;sica.</p>
<p>"Usualmente tuve el sentimiento que yo nunca pude comprender
aquello de cual hablaban las dem&aacute;s personas," dice Stallman,
rememorando la burbuja emocional que lo aisl&oacute; del resto del
mudo adulto y adolescente. "Pod&iacute;a entender las palabras,
pero algo subyac&iacute;a en las conversaciones que yo no
pod&iacute;a entender. Yo no pod&iacute;a comprender porque la
gente estaba interesada en las cosas que otras personas
dec&iacute;an."</p>
<p>Para toda la agon&iacute;a que esto produjo, la adolescencia
habr&iacute;a de tener un efecto alentador en el sentido de
individualidad de Stallman. En un momento en que gran parte de sus
compa&ntilde;eros de clase estaban dej&aacute;ndose crecer el
cabello, Stallman preferi&oacute; tenerlo corto. En un tiempo en
que todo el mundo adolescente estaba escuchando el rock and roll ,
Stallman prefiri&oacute; la m&uacute;sica cl&aacute;sica. Siendo un
fan&aacute;tico devoto de la ciencia ficci&oacute;n,de la revista
[<span class="CITATION">Mad</span>] , y de la televisi&oacute;n
nocturna, Stallman cultiv&oacute; una personalidad distintivamente
arrolladora que llev&oacute; a un l&iacute;mite la
incomprensi&oacute;n de sus padres y de sus camaradas por
igual.</p>
<p>"Oh, los juegos de palabras," dice Lippman, todav&iacute;a
exasperada por el recuerdo de la personalidad adolescente de su
hijo. "No hab&iacute;a ninguna cosa que usted pudiera decir en la
mesa del comedor que &eacute;l no te fuera a responder con un juego
de palabras."</p>
<p>Fuera del hogar, Stallman guardaba estos chistes para
contarselos exclusivamente a los adultos, los cuales tend&iacute;an
a ser indulgentes con su naturaleza virtuosa. Uno de los primeros
fue el consejero del campamento de verano que le entreg&oacute; a
Stallman una impresi&oacute;n del manual del computador IBM 7094
cuando &eacute;l ten&iacute;a 12 a&ntilde;os de edad. Para un
preadolescente fascinado con los n&uacute;meros y las ciencias, el
regalo era como enviado de Dios.<a name="AEN476" href=
"#FTN.AEN476">[6]</a> Para finales del verano, Stallman estaba
escribiendo programas seg&uacute;n las especificaciones internas
del 7094 internal specifications, anxiosamente anticipando la
obtenci&oacute;n de una oportunidad de ensayarlos en una
m&aacute;quina real.</p>
<p>Con el primer computador personal todav&iacute;a a una decada de
distancia, Stallman estar&iacute;a forzado a esperar algunos
a&ntilde;os antes de obtener acceso a su primer computador. Su
primera oportunidad finalmente lleg&oacute; durante su
      <span class="SYSTEMITEM">pen&uacute;ltimo</span> a&ntilde;o
      de bachillerato. Contratado en el Centro Cient&iacute;fico
      IBM de Nueva York, un instituto de investigaci&oacute;n,
      ahora difunto, en el centro comercial de Manhanttan, Stallman
      emple&oacute; el verano despu&eacute;s de la
      graduaci&oacute;n de bachiller escribiendo su primer
      programa, un pre-procesador para el 7094 escrito en el
      lenguaje de programaci&oacute;n PL/I. "Yo primero lo
      escrib&iacute; en PL/I, entonces comenc&eacute; de nuevo en
      lenguaje assembler cuando el programa en PL/Iestaba demasiado
      grande para que cupiera en el computador," &eacute;
      recuerda.</p>
<p>Despu&eacute;s de ese trabajo en el Centro Cient&iacute;fico de
IBM, Stallman obtuvo la posici&oacute;n de asistente del
laboratorio en el departamento de biolog&iacute;a en la Universidad
Rockefeller. Aun cuando el ya se estaba encaminando hacia una
carrera en matem&aacute;ticas o f&iacute;sica, la mente
anal&iacute;tica de Stallman impresion&oacute; al director del
laboratorio lo suficiente para que a&ntilde;os despu&eacute;s de
que Stallman hubiera partido del <span class=
"SYSTEMITEM">colegio</span>, Lippman recibi&oacute; una inesperada
llamada telef&oacute;nica. "era el profesor del Rockefeller,"
Lippman dice. "El quer&iacute;a saber c&oacute;mo le estaba yendo a
Richard. El se sorprendi&oacute; de saber que &eacute;l estuviera
trabajando con computadores. El siempre pens&oacute; que Richard
tendr&iacute;a un gran futuro adelante como bi&oacute;logo."</p>
<p>Las destrezas anal&iacute;ticas de Stallman, tambi&eacute;n
impresionaron a los miembros de la facultad en Columbia, a&uacute;n
en el momento en que Stallman mismo se convirti&oacute; en blanco
de la ira de ellos. "T&iacute;picamente una o dos veces por hora
[Stallman] habr&iacute;a de descubrir alg&uacute;n error en la
conferencia," dice Breidbart. "Y &eacute;l no era nada
t&iacute;mido al momento de hacerles saber su error a los
profesores de manera inmediata. Esto le signific&oacute; mucho
respeto pero no mucha popularidad."</p>
<p>Oyendo la an&eacute;cdota relatada por Breidbart, este evoca una
mirada burlona de Stallman. "Yo era un poco un pat&aacute;n a
ratos," el admite. "Pero encontr&eacute; unos esp&iacute;ritus
afines entre los profesores, porque a ellos, tambi&eacute;n, les
gustaba aprender. A los muchachos, para la mayor parte de las veces
no les gustaba. Al menos no de la misma forma."</p>
<p>No obstante, pasando el tiempo con los muchachos avanzados
durante los s&aacute;bados, alent&oacute; a Stallman a pensar
m&aacute;s acerca de los m&eacute;ritos de una socializaci&oacute;n
<span class="SYSTEMITEM">mejorada</span>. Con el tiempo de la
universidad acercandose, Stallman, como muchos otros de los que
estaban en el Programa de Honores en Ciencias en Columbia,
hab&iacute;a estrechado la lista de sus universidades deseadas a
dos escogencias: Harvard y MIT. Sabiendo del deseo de su hijo de
trasladarse a la Liga Ivy, Lippman empez&oacute; a preocuparse.
Siendo &eacute;l un estudiante de bachillerato de 15 a&ntilde;os de
edad, Stallman todav&iacute;a ten&iacute;a encuentros con los
profesores y administradores. Tan s&oacute;lo un a&ntilde;o antes,
el hab&iacute;a sacado uniformemente Aes en Historia de Estados
Unidos, Qu&iacute;mica, Franc&eacute;s y Algebra, pero una notoria
F en Ingl&eacute;s reflejaba el boicott que llevaba a cabo contra
las tareas escritas. Tales pifias podr&iacute;a retratar una
conocida <span class="SYSTEMITEM">broma</span> en el MIT, pero en
Harvard, ellas eran una bandera roja.</p>
<p>Durante el pen&uacute;ltimo a&ntilde;o de su hijo, Lippman dice
que ella program&oacute; una cita con un terapeuta. El terapeuta
expres&oacute; instant&aacute;neamente una preocupaci&oacute;n
acerca de la negativa de Stallman a escribir textos y acerca de las
reyertas con los profesores. Su hijo ciertamente ten&iacute;a los
requisitos intelectuales para tener &eacute;xito en Harvard, pero
tendr&iacute;a &eacute;l la paciencia para sentarse a trav&eacute;s
de las clases del colegio que requer&iacute;a un <i class=
"FOREIGNPHRASE">term paper</i>? El terapeuta sugiri&oacute; un
ensayo. Si Stallman lograba permanecer todo un a&ntilde;o en las
escuelas p&uacute;blicas de la ciudad de Nueva York, incluyendo una
clase de ingl&eacute;s que requiriese la escritura de
      <span class="SYSTEMITEM">textos</span>, &eacute;l
      probablemente podr&iacute;a sobrevivir a Harvard. Siguiendo
      la finalizaci&oacute;n de su <span class=
      "SYSTEMITEM">pen&uacute;ltimo</span> a&ntilde;o, Stallman
      prontamente se enrol&oacute; en el colegio de verano en el
      Louis D. Brandeis High School, una escuela p&uacute;blica
      localizada en la Calle 84, y comenzo haciendo las clases
      obligatorias de arte que el hab&iacute;a evitado
      anteriormente durante su carrera de bachillerato.</p>
<p>Para el oto&ntilde;o, Stallman estaba de nuevo dentro de la
poblaci&oacute;n de estudiantes de bachillerato de la ciudad de
Nueva York que segu&iacute;a la corriente. No era f&aacute;cil
sentarse en clases que parec&iacute;an remediales en
comparaci&oacute;n con sus estudios de los s&aacute;bados en
Columbia, pero Lippman recuerda orgullosamente la habilidad de su
hijo para conservar las reglas.</p>
<p>"El fue forzado, hasta un cierto punto a hacer reverencias, pero
el lo logr&oacute;," Lippman dice. "Yo fui llamada una sola vez, lo
cual resultaba casi un milagro. Era el profesor de c&aacute;lculo
quej&aacute;ndose de que Richard siempre acusaba al profesor de
usar una falsa prueba. Yo le dije, `Bien, esta &eacute;l en lo
correcto?' El profesor dijo, `Si, pero yo no puedo dec&iacute;rselo
a la clase. Ellos no lo entender&iacute;an.'"</p>
<p>Para finales de su primer semestre en Brandeis, las cosas
estaban quedando en su lugar. Un 96 en Ingl&eacute;s
suprimi&oacute; gran parte del estigma de los 60 obtenidos 2
a&ntilde;os antes. En gran medida, Stallman se escud&oacute; con
alt&iacute;simas notas en Historia de los Estados Unidos,
C&aacute;lculo Avanzado, y Microbiolog&iacute;a. El remate fue un
perfecto 100 en F&iacute;sica. Aunque todav&iacute;a siendo un
<span class="SYSTEMITEM">marginado</span> social, Stallman
finaliz&oacute; sus 11 meses en Brandeis como el cuarto mejor
estudiante de una clase de 789.</p>
<p>Afuera del aula de clase, Stallman llev&oacute; a cabo sus
estudioa con una a&uacute;n mayor diligencia, afan&aacute;ndose
entre semana, para cumplir con sus tareas como asistente de
laboratorio en la Universidad Rockfeller y evadiendo a los
manifestantes contra la Guerra del Vietnam cuando iba camino a la
escuela en Columbia. Fue all&iacute;, mientras el resto de los
estudiantes del Programa de Honores en Ciencias se sentaban a
hablar acerca de sus escogencias en la universidad, que Stallman
finalmente tom&oacute; un momento para participar en la
      <span class="SYSTEMITEM">sesi&oacute;n
      preuniversitaria</span>.</p>
<p>Breidbart recuerda, "Muchos de los estudiantes iban a Harvard o
a MIT, naturalmente, pero tambi&eacute;n hab&iacute;a algunos pocos
que iban a otras universidades de la Liga Ivy. En la medida que la
conversaci&oacute;n se mov&iacute;a a trav&eacute;s del cuarto, se
hacia aparente que Richard no hab&iacute;a dicho nada
todav&iacute;a. No s&eacute; quien fue pero alguien tuvo el valor
de preguntarle acerca de lo que ten&iacute;a planeado hacer."</p>
<p>Treinta a&ntilde;os despu&eacute;s, Breidbart recuerda el
momento claramente. Tan pronto como Stallman solt&oacute; la
noticia de que &eacute;l tambi&eacute;n iba a asistir a la
Universidad de Harvard ese oto&ntilde;o, un extra&ntilde;o silencio
llen&oacute; el sal&oacute;n. Casi como en una mueca las esquinas
de la boca de Stallman se levantaron haciendo una sonrisa de
satisfacci&oacute;n personal.</p>
<p>Breidbart dice, "Era la forma silenciosa de de decir, `Es
correcto. ustedes todav&iacute;a no se han desembarazado de
mi.'"</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN375"
   href="chapter-3.html#AEN375">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>Michael Gross, "Richard Stallman: High School Misfit, Symbol of
Free Software, MacArthur-certified Genius" (1999). This interview
is one of the most candid Stallman interviews on the record. I
recommend it highly.
http://www.mgross.com/interviews/stallman1.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN394"
   href="chapter-3.html#AEN394">[2]</a></td>
<td align="left" valign="top" width="95%">
<p>Michael Gross, "Richard Stallman: High School Misfit, Symbol of
Free Software, MacArthur-certified Genius" (1999). This interview
is one of the most candid Stallman interviews on the record. I
recommend it highly.
http://www.mgross.com/interviews/stallman1.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN427"
   href="chapter-3.html#AEN427">[3]</a></td>
<td align="left" valign="top" width="95%">
<p>See Judy Steed, [<span class="CITATION">Toronto Star</span>],
BUSINESS, (October 9, 2000): C03. His vision of free software and
social cooperation stands in stark contrast to the isolated nature
of his private life. A Glenn Gould-like eccentric, the Canadian
pianist was similarly brilliant, articulate, and lonely. Stallman
considers himself afflicted, to some degree, by autism: a condition
that, he says, makes it difficult for him to interact with
people.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN442"
   href="chapter-3.html#AEN442">[4]</a></td>
<td align="left" valign="top" width="95%">
<p>See Steve Silberman, "The Geek Syndrome," [<span class=
"CITATION">Wired</span>] (December, 2001).
http://www.wired.com/wired/archive/9.12/aspergers_pr.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN462"
   href="chapter-3.html#AEN462">[5]</a></td>
<td align="left" valign="top" width="95%">
<p>Regrettably, I did not get a chance to interview Daniel Stallman
for this book. During the early research for this book, Stallman
informed me that his father suffered from Alzheimer's. When I
resumed research in late 2001, I learned, sadly, that Daniel
Stallman had died earlier in the year.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN476"
   href="chapter-3.html#AEN476">[6]</a></td>
<td align="left" valign="top" width="95%">
<p>Stallman, an atheist, would probably quibble with this
description. Suffice it to say, it was something Stallman welcomed.
See previous note 1: "As soon as I heard about computers, I wanted
to see one and play with one."</p></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="chapter-2.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="chapter-4.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">2001: La Odisea de un
Hacker</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">Impeach
God</td></tr></table></div>
</body>
</html>
