<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>2001: La Odisea de un Hacker</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="Todo por una impresora" href=
"chapter-1.html">
<link rel="NEXT" title="Un retrato del hacker adolescente"
      href="chapter-3.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href=
"chapter-1.html" accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"chapter-3.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-2">Cap&iacute;tulo 2. 2001: La Odisea de un
Hacker</a></h1>
<p>El departamento de ciencias de la computaci&oacute;n de la
Universidad de New York est&aacute; situado dentro del Hall Warren
Weaver, un edificio que parece una fortaleza localizado a dos
cuadras al oriente del Washington Square Park. Corrientes de aire
acondicionado de fuerza industrial crean un foso de aire caliente,
deslentando a holgazanes y a <span class=
"SYSTEMITEM">abogados</span> por igual. Los visitantes que logran
atravesar el foso encuentran otra formidable barrera, una
m&aacute;quina registradora de seguridad situada inmediatamente
adentro del &uacute;nico corredor de entrada de la
edificaci&oacute;n.</p>
<p>M&aacute;s all&aacute; del punto de registro de seguridad, la
atm&oacute;sfera se relaja en alguna medida. Pero todav&iacute;a,
subsisten numerosas se&ntilde;ales desparramadas a lo largo del
primer piso que previenen acerca de los peligros de las puertas no
aseguradas y de las salidas de incendio <i class=
"FOREIGNPHRASE">propped-open</i>. Tomados como un todo, las
se&ntilde;ales ofrecen un recordatorio: a&uacute;n los
relativamente tranquilos confines de antes del 11 de septiembre del
2001, uno nunca puede ser demasiado cuidadoso o demasiado
sospechoso.</p>
<p>Las se&ntilde;ales ofrecen un interesante punto de vista
contrario al creciente n&uacute;mero de visitantes que se agrupan
el atrio interior del hall. Unos pocos parecen estudiantes de la
Universidad de Nueva York. La mayor&iacute;a parecen asistentes
desgre&ntilde;ados a un concierto haciendo fila en las afueras de
una sala de m&uacute;sica en aniticipaci&oacute;n al acto
principal.. Por una breve ma&ntilde;ana, las masas se han tomado al
Hall Warren Weaver, dejando al guardi&aacute;n de seguridad vecino
sin nada mejor que observar a Ricki Lake en television y encoger
sus hombros hacia el auditorio contiguo cada vez que los visitantes
preguntan por "la charla".</p>
<p>Una vez dentro del auditorio, un visitante encuentra la persona
que ha forzado este colapso temporal de los procedimientos de
seguridad de la edificaci&oacute;n. La persona es Richard M.
Stallman, fundador del Proyecto GNU, presidente original de la
Fundaci&oacute;n del Software Libre (FSF- Free Software
Foundation), ganador del programa de Becas MacArthur en 1990,
ganador de Premio de Mec&aacute;nica Computacional de la
Asociaci&oacute;n Grace Murray Hopper (tambi&eacute;n en 1990),
corecipiente del Premio Takeda 2001 de la Fundaci&oacute;n Takeda,
y antiguo hacker del Laboratorio de Inteligencia Artificial. Tal
como fue anunciado en los sitios web relativos a hackers,
incluyendo el sitio del propio Proyecto GNU <a href="http://www.gnu.org"
target="_top">www.gnu.org</a>, Stallman est&aacute; en Manhattan,
su antiguo hogar, para presentar una muy esperada charla en
respuesta a la reciente campa&ntilde;a de la Corporaci&oacute;n
Microsoft en contra de la Licencia P&uacute;blica General de
GNU.</p>
<p>El tema de la conferencia de Stallman es la historia y el futuro
del movimiento de software libre. La ubicaci&oacute;n es
significativa. Menos de un mes antes, el vice presidente senior de
Microsoft Craig Mundie apareci&oacute; en la vecina Escuela de
Negocios Stern de la uNiversidad de Nueva York, presentando una
charla en la que solt&oacute; una andanada contra Licencia
P&uacute;blica General, o GPL, un dispositivo legal originalmente
concebido por Stallman 16 a&ntilde;os atr&aacute;s. Construida para
contrarrestar la ola creciente de secretividad en el software, ola
que est&aacute; en proceso de tomarse a la industria del software-
una ola que fue notada inicialmente por Stallman durante sus
problemas de 1980 troubles con la impresora l&aacute;ser Xerox
laser -la GPL ha evolucionado hacia una herramienta central de la
comunidad del software libre. En t&eacute;rminos m&aacute;s
simples, la GPL <span class="SYSTEMITEM">encierra</span> los
programas de software en una forma de propiedad comunal-lo que hoy
los eruditos legales llaman los "comunes digitales" ("digital
commons") -a trav&eacute;s del peso legal del copyright. Una vez
encerrados, los programas permanecen inamovibles. Versiones
derivadas deben llevar la misma protecci&oacute;n del
copyright-a&uacute;n versiones derivadas que contienen s&oacute;lo
una peque&ntilde;a porci&oacute;n del c&oacute;digo fuente
original. Por esta raz&oacute;n, algunos dentro de la industria del
software han dado en llamar a la GPL como una licencia "viral",
pues esta se disemina a todos los programas de software que toca.
<a name="AEN217" href="#FTN.AEN217">[1]</a></p>
<p>En una econom&iacute;a de informaci&oacute;n crecientemente
dependiente del software y agradecida de los est&aacute;ndares de
software, la GPL se ha convertido en el proverbial "gran garrote".
A&uacute;n las compa&ntilde;&iacute;as que una vez se rieron de
ella tach&aacute;ndola de socialismo de software se han juntando
alrededor reconociendo los beneficios. Linux, el n&uacute;cleo
similar a Unix desarrollado por el estudiante universitario
fin&eacute;s Linus Torvalds en 1991, est&aacute; licenciado bajo la
GPL, as&iacute; como lo est&aacute;n muchas de las m&aacute;s
populares herramientas de programaci&oacute;n: GNU Emacs, el GNU
Debugger, el Compilador GNU C, etc. Conjuntamente, estas
herramientas forman los componentes de un sistema operativo de
software libre desarrollado, mantenido y perteneciente a una
comunidad de hackers localizada en diferentes partes del mundo. En
lugar de ver esta comunidad como una amenaza, las
compa&ntilde;&iacute;as de alta tecnolog&iacute;a como IBM, Hewlett
Packard, y Sun Microsystems han llegado a depender de ella,
vendiendo aplicaciones de software y servicios construidos sobre la
siempre creciente infraestructura de software libre.</p>
<p>Ellos han llegado tambi&eacute;n a depender de esta
infraestructura, haciendo uso de esta como arma estrat&eacute;gica
en la guerra perenne de la comunidad hacker contra Microsoft,
aquella compa&ntilde;&iacute;a que tiene su base en Redmond,
Washington- y que, para bien o para mal, ha dominado el mercado de
software para PCCs desde finales de los 1980s. Como due&ntilde;o
del popular sistema operativo de Windows, Microsoft es quien puede
tener las mayores p&eacute;rdidas en este cambio en la industria
del software hacia la licencia GPL. Casi toda l&iacute;nea del
c&oacute;digo fuente del coloso de Windows esta protegida por
derechos reservados de autor reafirmando la naturaleza privada del
c&oacute;digo fuente subyacente o, al menos, reafirmando la
habilidad legal de Microsoft de tratar al c&oacute;digo fuente como
una propiedad privada. Desde el punto de vista de MIcrosoft,
incorporar programas protegidos por la licencia "viral" GPL dentro
del colosos de Windows equivaldr&iacute;a a que Superman se tomara
unas pastillas de Kriptonita. Compa&ntilde;&iacute;as rivales
podr&iacute;an de pronto copiar, modificar, y vender versiones
mejoradas de Windows, transformando instant&aacute;neamente la
posici&oacute;n dominante de la compa&ntilde;&iacute;a como
proveedor No. 1 de software orientado al consumidor en una
posici&oacute;n vulnerable. Por lo tanto, de ah&iacute; viene la
creciente preocupaci&oacute;n de la compa&ntilde;&iacute;a por la
tasa de adopci&oacute;n de la GPL. Y esta es la causa de la
reciente charla de Mundie en que solt&oacute; la andanada contra la
GPL y el abordaje de "fuente abierta" en lo referente al desarrollo
de software y las ventas. De donde provino la decisi&oacute;n de
Stallman de presentar una refutaci&oacute;n p&uacute;blica a tal
conferencia en el mismo campus y el d&iacute;a de hoy.</p>
<p>20 a&ntilde;os es mucho tiempo para la industria del software.
Considere esto: en 1980, cuando Richard Stallman estaba maldiciendo
la impresora l&aacute;ser Xerox del Laboratorio de IA, Microsoft,
la compa&ntilde;&iacute;a que los hackers modernos ven como la
fuerza m&aacute;s poderosa en la industria del software en todo el
mundo, era todav&iacute;a una <span class=
"SYSTEMITEM">principiante</span>. IBM, la compa&ntilde;&iacute;a
que los hackers usualmente miraban como la fuerza m&aacute;s
poderosa dentro de la industria del hardware en todo el mundo,
todav&iacute;a estaba por introducir el computador personal, y
entonces inaugurando el actual mercadoo de PCs de bajo costo.
Munchas de las tecnolog&iacute;as que ahora tomamos por dadas -el
World Wide Web, la televisi&oacute;n satelital, las consolas de
video-juegos de 32-bit-ni siquiera exist&iacute;an. Lo mismo va por
lo que tiene que ver con las compa&ntilde;&iacute;as que ahora
llenan los escalones de arriba del establecimiento corporativo,
compa&ntilde;&iacute;as como AOL, Sun Microsystems, Amazon.com,
Compaq, y Dell. La lista se prolonga a&uacute;n m&aacute;s.</p>
<p>El hecho que el mercado de alta tecnolog&iacute;a haya llegado
tan lejos en tan poco tiempo es combustible para ambos lados del
debate entorno de la licencia GPL. Los proponentes de la GPL
apuntan a la corta vida de muchas de las plataformas de hardware de
computador. Enfrentando el riesgo de comprar un producto obsoleto,
los consumidores tienden a conglomerarse en torno a
compa&ntilde;&iacute;as con mayor sobrevivencia a largo
t&eacute;rmino. Como resultado de esto, el mercado de software se
ha convertido en un campo de batalla donde el ganador lo toma todo.
<a name="AEN265" href="#FTN.AEN265">[2]</a> El actual, ambiente de
software apropiado privadamente, los proponentes del GPL dicen,
lleva al abuso del monopolio y al estancamiento. Fuertes
compa&ntilde;&iacute;as se chupan todo el ox&iacute;geno del
mercado quit&aacute;ndoselo a los competidores rivales y a los
principiantes innovadores.</p>
<p>Los oponentes al GPL argumentan exactamente lo opuesto. La venta
de software es tan riesgosa, sino m&aacute;s riesgosa que, la
compra de software, ellos dicen. Sin las garant&iacute;as legales
provistas por las licencias de software privadas, para no mencionar
los prospectos econ&oacute;micos de una "aplicaci&oacute;n
matadora" apropiada privadamente (i.e., una tecnolog&iacute;a de
punta que dispara un mercado enteramente nuevo), <a name="AEN272"
href="#FTN.AEN272">[3]</a> las compa&ntilde;&iacute;as pierden el
incentivo a participar. De nuevo, el mercado se estanca y la
innovaci&oacute;n declina. tal como Mundie puso en relieve en su
charla de&ntilde; 3 de mayo en el mismo campus, la naturaleza
"viral" de la licencia GPL "presenta una amenaza" contra cualquier
compa&ntilde;&iacute;a que dependa de la unicidad de su software
como activo de competitividad. Mundie agreg&oacute;:</p>
<a name="AEN275"></a>
<blockquote class="BLOCKQUOTE">
<p>Esta tambi&eacute;n socava fundamentalmente el sector de
software comercial independiente debido a que efectivamente hace
que sea imposible el distribuir software bajo una base donde los
compradores pagan por el producto algo m&aacute;s que tan
s&oacute;lo el costo de la distribuci&oacute;n. <a name="AEN277"
href="#FTN.AEN277">[4]</a></p></blockquote>
<p>El &eacute;xito mutuo de GNU/Linux, el sistema operativo
amalgamado contruido alrrededor del n&uacute;cleo Linux protegido
por la GPL, y de Windows a lo largo de los &uacute;ltimos 10
a&ntilde;os revela la sabidur&iacute;a de ambas perspectivas. Sin
embargo, la batalla por el <span class="SYSTEMITEM">impulso</span>
es muy importante en la industria del software. A&uacute;n
poderosos vendedores tales como Microsoft dependen del apoyo de
terceros desarrolladores cuyas herramientas, programas, y juegos de
computadores hacen a las plataformas de software subyacentes tales
como Windows, m&aacute;s atractivas para el consumidor promedio.
Citando la r&aacute;pida evoluci&oacute;n del mercado de
tecnolog&iacute;a a lo largo de los &uacute;ltimos 20
a&ntilde;os,para no mencionar el admirable registro de su propia
compa&ntilde;&iacute;a durante este &uacute;ltimo per&iacute;odo,
Mundie aconsej&oacute; a sus escuchas de no dejarse
      <span class="SYSTEMITEM">influenciar</span> demasiado por el
      impulso reciente del movimiento de sofwtare libre:</p>
<a name="AEN289"></a>
<blockquote class="BLOCKQUOTE">
<p>Dos d&eacute;cadas de experiencia han mostrado que un modelo
econ&oacute;mico que protege la propiedad intelectual y un modelo
de negocios que recorta los costos de investigaci&oacute;n y
desarrollo pueden crear beneficios econ&oacute;micos impresionantes
y tambi&eacute;n puede distribuir estos beneficios ampliamente.
<a name="AEN291" href="#FTN.AEN291">[5]</a></p></blockquote>
<p>Tales advertencias sirven como tel&oacute;n de fondo para la
charla de Stallman del d&iacute;a de hoy. Menos de un mes
depu&eacute;s de su declaraci&oacute;n, Stallman permace erguido
con su espalda hacia uno de los tableros al frente del cuarto,
inquieto por comenzar.</p>
<p>Si las &uacute;ltimas dos d&eacute;cadas han traido
dram&aacute;ticos cambios al mercado del software, ellos han traido
a&uacute;n m&aacute;s dram&aacute;ticos cambios para Stallman
mismo. Ya no est&aacute; el hacker delgado, afeitado limpiamente
que una vez emple&oacute; por entero sus d&iacute;as
comunic&aacute;ndose con su amada PDP-10. En su lugar est&aacute;
un hombre pesado de mediana edad con largos cabellos y barba de
rabino, un hombre que ahora emplea el grueso de sus d&iacute;as
escribiendo y respondiendo emails, arengando a sus colegas
programadores, y dando charlas como las de hoy. Vestido con una
camiseta <i class="FOREIGNPHRASE">aqua-colored</i> y pantalones
carmelitos de polyester, Stallman parece un ermita&ntilde;o del
desierto reci&eacute;n salido del vestier del Ej&eacute;rcito de
Salvaci&oacute;n.</p>
<p>El auditorio esta lleno de visitantes que comparten la moda y
los <i class="FOREIGNPHRASE">grooming</i> gustos de Stallman.
Muchos llegan portando computadores port&aacute;tiles y modems
celulares, tanto mejor para registrar y transmitir las palabras de
Stallman a una ansiosa audiencia de internet. El porcentaje de
hombres con respecto a las mujeres es de unos 15 hombres por cada
mujer, y una de cada 7 u 8 mujeres porta un mu&ntilde;eco de
pinguino, la mascota oficial de Linux, mientras que otras llevan un
osito de peluche.</p>
<p>Agitado, Stallman abandona su puesto al frente del sal&oacute;n
y toma un asiento de la primera fila, digitando unos pocos comandos
en un computador port&aacute;til previamente abierto. Por los
siguientes 10 minutos Stallman est&aacute; abstraido del creceinte
n&uacute;mero de estudiantes, profesores, y fan&aacute;ticos que
circulan en frente de &eacute;l al pi&eacute; de la tarima del
auditorio.</p>
<p>Antes de que la charla pueda comenzar los rituales barrocos de
la formalidad acad&eacute;mica deben de ser observados. La
aparici&oacute;n de Stallman merece no una sino dos presentaciones.
Mike Uretsky, codirector del Centro de Tecnolog&iacute;a Avanzada
de la Escuela Stern, provee la primera.</p>
<p>"El papel de una universidad es el de fomentar el debate y de
tener interesantes discusiones," dice Uretsky. "Esta
presentaci&oacute;n particular, este seminario casa perfectamente
en ese molde. Encuentro la discusi&oacute;n acerca de las Fuentes
Abiertas particularmente interesante."</p>
<p>Antes de que Uretsky pueda comenzar una nueva frase, Stallman
est&aacute; de pi&eacute; manote&aacute;ndole como un motorista
varado.</p>
<p>"Yo hago software libre," Stallman dice ante las carcajadas
crecientes. "Fuentes Abiertas es un movimiento diferente."</p>
<p>La risa da paso al aplauso. El cuarto esta repleto de
partidarios de Stallman, personas que saben de su reputaci&oacute;n
por la exactitud verbal, para no mencionar su muy publicitada
controversia con los proponentes de movimiento de Fuentes Abiertas.
Muchos han venido para anticipar tales explosiones del mismo modo
en que anteriormente los fan&aacute;ticos de la radio aguardaban
por la marca registrada de Jack Benny, la exclamaci&oacute;n de
"Cortala!" en cada uno de sus programas de radio.</p>
<p>Precipitadamente Uretsky finaliza su presentaci&oacute;n y cede
el escenario a Edmon Schonberg, un profesor del departamento de
ciencias de la computaci&oacute;n de la Universidad de Nueva York.
Como programador de computadores y colaborador del proyecto GNU,
Schonberg conoce las minas explosivas lingu&iacute;sticas que debe
de evitar. Diestramente sintetiza la carrera de Stallman desde la
perspectiva de un programador de hoy en d&iacute;a.</p>
<p>"Richard es el ejemplo perfecto de alguien que, actuando
localmente, comenz&oacute; a pensar globalmente [acerca] de los
problemas que conciernen a la no disponilbilidad del c&oacute;digo
fuente," dice Schonberg. "El ha desarrollado una filosof&iacute;a
coherente que nos ha forzado a todos nosotros a reexaminar nuestras
ideas acerca de como el software es producido, de lo que la
propiedad intelectual significa, y de lo que la comunidad de
software representa de hecho."</p>
<p>Schonberg da la bienvenida a Stallman con m&aacute;s aplausos.
Stallman se toma un momento para cerrar su computador
port&aacute;til, se levanta, y se toma el escenario.</p>
<p>Inicialmente, las palabras de Stallman parecen m&aacute;s una
rutina de comedia que un discurso pol&iacute;tico. "Quisiera
agradecer a Microsoft por darme la oportunidad de aparecer en esta
plataforma," Stallman hace el comentario agudo. "Durante las
&uacute;ltimas semanas, me he sentido como un escritor cuyo libro
hubiera sido fortuitamente prohibido en alguna parte."</p>
<p>Para los no-iniciados, Stallman se sumerge en una pronta
analog&iacute;a de calentamiento acerca del software libre. El
asemeja un programa de software a una receta de cocina. Ambos
proveen unas &uacute;tiles instrucciones paso a paso de como
completar una tarea deseada y pueden ser f&aacute;cilmente
modificadas si un usuario tiene deseos especiales o circustancias.
"Usted no tiene que seguir la receta al pie de la letra," Stallman
anota. "Usted puede prescindir de algunos ingredientes. Agregar
algunos hongos, 'pues a usted le gustan los hongos. Poner menos sal
pues su m&eacute;dico le recomend&oacute; que le bajara a la sal- o
lo que sea."</p>
<p>De manera m&aacute;s importante, Stallman dice, los programas y
las recetas son ambas f&aacute;ciles de compartir. Al dar una
receta a un invitado a cenar, el cocinero pierde solo un poquito de
tiempo y el costo del papel en el que la receta se escribe. Los
programas de sofwtare requieren a&uacute;n menos, usualmente unos
cuantos clicks del mouse y un poquito de electricidad. En ambas
instancias, sin embargo, la persona que da la informaci&oacute;n
gana dos cosas: una amistad incrementada y la habilidad para pedir
prestado interesantes recetas como intercambio.</p>
<p>"Imaginense lo que ser&iacute;a si las recetas vinieran
empacadas en cajas negras," Stallamn dice, cambiando la velocidad.
"Usted no podr&iacute;a saber los ingredientes que usan, tampoco
podr&iacute;a cambiarlos, e imaginense que pasar&iacute;a si usted
hace una copia para un amigo. Usted ser&iacute;a acusado de pirata
y tratar&iacute;an de ponerlo en prisi&oacute;n por a&ntilde;os.
Ese mundo atropellar&iacute;a tremendamente a todo aquel que
tuviera la costumbre de compartir cosas con los demas. Pero
as&iacute; es exactamente el mundo del software propietario. Un
mundo en el que la decencia hacia otras personas esta prohibida o
es evitada."</p>
<p>Presentada esta analog&iacute;a introductoria, Stallman se lanza
a contar el episodio de la impresora l&aacute;ser de Xerox. Igual
que con la analog&iacute;a de la receta, la historia de la
impresora l&aacute;ser resulta ser un dispositivo ret&oacute;rico
&uacute;til. Con su estructura que se asemeja al de una
par&aacute;bola, esta dramatiza acerca de que tan
r&aacute;pidamente las cosas pueden cambiar en el mundo del
software. Llevando a sus oyentes a una &eacute;poca antes de la
compra con un solo click de Amazon.com, de Microsoft Windows, y de
las bases de datos de Oracle, &eacute;l lleva al escucha a examinar
la noci&oacute;n de propiedad del software liberado de los logos
corporativos actuales.</p>
<p>Stallamn presenta la historia con todo el pulimiento y la
pr&aacute;ctica de un fiscal de distrito local que conduce un
argumento de cierre. Cuando llega a la parte en que el profesor de
Carnegie Mellon se rehusa a entregarle una copia del c&oacute;digo
fuente de la impresora , Stallman hace una pausa.</p>
<p>"El nos ha traicionado," Stallman dice. "Pero el no solo nos lo
hizo a nosotros. ES bien probable que tambi&eacute;n lo
traicion&oacute; a usted."</p>
<p>En la palabra "usted," Stallman se&ntilde;ala con su dedo
&iacute;ndice acusador a un insospechado miembro de la audiencia.
Las cejas de este miembro de la audiencia titubean levemente, pero
los propios ojos de Stallman se han movido. Lenta y
deliberadamente, Stallman escoge a un segundo miembro de la
audiencia que rie disimulada y nerviosamente. "Y creo, que muy
probablemente, se lo hizo a usted, tambi&eacute;n," el dice,
se&ntilde;alando a un miembro de la audiencia que esta tres filas
detr&aacute;s del primero.</p>
<p>Para cuando Stallman ha escogido a un tercer miembro de la
audiencia, las risas entre dientes han desembocado en risa general.
El gesto parece un tanto preparado, puesto que lo es. A&uacute;n,
cuando llega el momento de guardar la historia de la impresora
l&aacute;ser de Xerox, Stallman lo hace con un gesto ceremonioso de
hombre de espect&aacute;culo. "El probablemente se lo hizo a la
mayor&iacute;a de las personas que estan aqu&iacute; Para cuando
Stallman ha elegido a un tercer miembro de la audiencia, las
t&iacute;midas sonrisas han dado paso a una risa general. El gesto
parece un tanto preparado, puesto que lo es. A&uacute;n, para
cuando es la hora de cerrar la hostoria de la impresora
l&aacute;ser Xerox, Stallman lo hace con un gesto ceremonioso de
hombre del espect&aacute;culo. "Probablemente el traicion&oacute; a
casi todos los que nos encontramos en este sal&oacute;n-- excepto
unos pocos, que tal vez, no hab&iacute;an nacido todav&iacute;a en
1980," Stallman dice, levantando m&aacute;s risas. "[Esto es]
porque &eacute;l prometi&oacute; rehusarse a cooperar con
justamente toda la poblaci&oacute;n del planeta tierra."</p>
<p>Stallman deja que el comentario se asiente por un segundo "El
hab&iacute;a firmado un acuerdo de no revelar (nondisclosure
agreement)," agrega Stallman.</p>
<p>El ascenso de Richard Matthew Stallman de acad&eacute;mico
frustrado a l&iacute;der pol&iacute;tico durante los &uacute;ltimos
20 a&ntilde;os habla de muchas cosas. Habla de la naturaleza terca
de stallman y de su voluntad prodigiosa. Habla acerca de la
visi&oacute;n articulada y los valores del movimiento del software
libre que Stallman ayud&oacute; a construir. Habla de la alta
calidad de los programas de software que Stallman construy&oacute;,
programas que han cimentado la reputaci&oacute;n de Stallman como
programador legendario. Habla del momentum creciente de la GPL, una
innovaci&oacute;n legal, que muchos de los observadores de Stallman
ven como su mayor logro.</p>
<p>De manera m&aacute;s importante, habla de la naturaleza
cambiante del poder pol&iacute;tico en un mundo crecientemente
obligado por gratitud ante la tecnolog&iacute;a de los computadores
y los programas de software que potencian esta
tecnolog&iacute;a.</p>
<p>Quiz&aacute; por esto, a&uacute;n en un tiempo en que gran parte
de las estrellas de la alta tecnolog&iacute;a est&aacute;n
declinando, la estrella de Stallman crece. Puesto que el
lanzamiento del Proyecto GNU en 1984,<a name="AEN326" href=
"#FTN.AEN326">[6]</a></p>
<p>Stallman ha sido a ratos ignorado, satirizado, calumniado, y
atacado --tanto desde adentro como desde afuera del movimiento de
software libre. A trav&eacute;s de todo este proceso, el proyecto
GNU ha logrado marcar sus propios hitos, a&uacute;n con unos pocos
notables retrasos, y ha logrado mantener su relevancia en un
mercado de software varios ordenes de magnitud m&aacute;s complejo
que aquel al cual entraron 18 a&ntilde;os antes. As&iacute;
tambi&eacute;n ha pasado con la ideolog&iacute;a del software
libre, una ideolog&iacute;a que ha sido meticulosamente cuidada y
mantenida por el mismo Stallman.</p>
<p>Para entender las razones detr&aacute;s de esta
      <span class="SYSTEMITEM">situaci&oacute;n</span>, ayuda el
      examinar a Richard Stallman tanto en sus propias palabras
      como en las palabras de la gente que ha colaborado y
      batallado al lado de &eacute;l a lo largo del camino. El
      esbozo del car&aacute;cter de Richard Stallman no es
      complicado. Si cualquier persona ejemplifica el antiguo
      adagio "lo que usted ve es lo que usted obtiene," ese es
      Stallman.</p>
<p>"Pienso que si ustde quiere entender a Richard Stallman el ser
humano, ustde necesita ver todas las partes como un todo
consistente," advierte Eben Moglen, consejero legal de la
Fundaci&oacute;n de Software Libre y profesor de leyes del Colegio
de Leyes de la Universidad de Columbia. "Todas esas excentridades
personales que mucha gente ve como obstaculos para llegar a conocer
al verdadero Stallman <em>son</em> Stallman: el fuerte sentido de
frustraci&oacute;n personal de Richard, su enorme sentido de
compromiso con los principios &eacute;ticos, su poca capacidad para
tranzar, especialmente en aquellos asuntos que considera
fundamentales. Estas son las verdaderas razones por las cuales
Richard hizo lo que hizo."</p>
<p>Explicar como una jornada que empez&oacute; con una impresora
l&aacute;ser habr&iacute;a de desembocar eventualmente en una
confrontaci&oacute;n <i class="FOREIGNPHRASE">sparring</i> con la
m&aacute;s rica corporaci&oacute;n del mundo no resulta ser una
f&aacute;cil tarea. Requiere un examen atento de las fuerzas que
han hecho de la propiedad del software algo tan importante en la
sociedad de hoy en d&iacute;a. Tambi&eacute;n requiere de un examen
cuidadoso de un hombre que, como muchos otros l&iacute;deres
pol&iacute;ticos antes que &eacute;l, comprenda la maleabilidad de
la memoria humana. Requiere de una habilidad para interpretar los
mitos y las palabras-c&oacute;digos cargadas pol&iacute;ticamente
que se han construido alrededor de Stallman a trav&eacute;s del
tiempo. Finalmente, require de la comprensi&oacute;n del genio de
Stallman como programador y sus fracasos y &eacute;xitos al
transmitir tal genio a otras empresas.</p>
<p>Cuando llega el momento de ofrecer su propio resumen de la
jornada, Stallman testifica acerca de la fusi&oacute;n de
personalidad y principios observadas por Moglen. "La terquedad es
mi <span class="SYSTEMITEM">sello personal</span> ," el dice.
"Mucha gente que intenta hacer cualquier cosa que entra&ntilde;e
cierta gran dificultad eventualmente se desalienta y se rinde. Yo
nunca me rindo."</p>
<p>El tambi&eacute;n le da cr&eacute;dito al ciego azar. Si no
hubiera sido por ese incidente con la impresora l&aacute;ser Xerox,
si no hubiera sido por los conflictos personales y pol&iacute;ticos
que clausuraron su carrera como empleado del MIT, si no hubiera
sido por la media docena de factores que se presentaron de manera
sincronizada, Stallman encuentra que hubiera sido muy f&aacute;cil
que su vida hubiera cogido por otro camino diferente.
Habi&eacute;ndose dicho esto, Stallman agradece a las fuerzas y
circustancias que lo pusieron en la posici&oacute;n de hacer la
diferencia.</p>
<p>"Ten&iacute;a justamente las destrezas requeridas," dice
Stallman, recapitulando su decision de lanzar el Proyecto GNU ante
la audiencia. "Nadie m&aacute;s hab&iacute;a que yo, as&iacute; que
me sent&iacute; como, `He sido elegido. He de trabajar en esto. Si
no soy yo, qui&eacute;n entonces?"</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN217"
   href="chapter-2.html#AEN217">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>De hecho, los poderes de la GPL no son tan potentes. De acuerdo
con la secci&oacute;n 10 de la Licencia P&uacute;blica General GNU,
Version 2 (1991), la naturaleza viral de la licencia depende
fuertemente de la disposici&oacute;n de la Fundaci&oacute;n de
Software Libre de ver tal programa como un trabajo derivado, para
no mencionar la licencia existente que la GPL reemplazar&iacute;a.
Si usted desea incorporar partes del programa dentro de otros
programas libres cuyas condiciones de distribuci&oacute;n son
diferentes, escriba al autor pidi&eacute;ndole permiso. Para
software de la Fundaci&oacute;n de Software Libre, escriba a
&eacute;sta; algunas veces hacemos excepciones para esto. Nuestra
decisi&oacute;n estar&aacute; guiada por los dos objetivos de
preservar el estatus de libertad de todos los derivados de nuestro
software libre y el de promover el que se comparta y se reuse del
software en general. "El comparar algo a un virus es muy severo,"
dice Stallman "Una planta de reproducci&oacute;n vegetativa es una
comparaci&oacute;n m&aacute;s exacta; esta continua
reproduci&eacute;ndose si ustde activamente corta un pi&eacute;."
Para m&aacute;s informaci&oacute;n acerca de la Licencia
P&uacute;blica General GNU, visite
http://www.gnu.org/copyleft/gpl.html.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN265"
   href="chapter-2.html#AEN265">[2]</a></td>
<td align="left" valign="top" width="95%">
<p>See Shubha Ghosh, "Revealing the Microsoft Windows Source Code,"
[<span class="CITATION">Gigalaw.com</span>] (January, 2000).
http://www.gigalaw.com/articles/ghosh-2000-01-p1.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN272"
   href="chapter-2.html#AEN272">[3]</a></td>
<td align="left" valign="top" width="95%">
<p>Las aplicaciones matadoras no tienen que ser propietarias.
Testigo de esto, por supuetso, el visor Mosaic, un programa cuyos
derechos de copia permiten derivados comerciales con ciertas
restricciones. A&uacute;n, creo que el lector entiende el punto: el
mercado del software es como una loter&iacute;a. Mientras mayor es
la ganancia potencial m&aacute;s personas estan dispuestas a
participar. Para un buen resumen del fen&oacute;meno de las
aplicaciones matadoras, vea Philip Ben-David, "Whatever Happened to
the `Killer App'?" (Qu&eacute; sucedi&oacute; con las aplicaciones
matadoras?) [<span class="CITATION">e-Commerce News</span>]
(December 7, 2000).
http://www.ecommercetimes.com/perl/story/5893.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN277"
   href="chapter-2.html#AEN277">[4]</a></td>
<td align="left" valign="top" width="95%">
<p>Vea Craig Mundie, "The Commercial Software Model," (El Modelo de
Software Comercial) senior vicepresidente, Microsoft Corp. Citado
de un transcrito en l&iacute;nea del discurso de Mundie ante la
Escuela Stern de Negocios de la Universidad de Nueva York, el 3 de
mayo de 2001.
http://www.microsoft.com/presspass/exec/craig/05-03sharedsource.asp</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN291"
   href="chapter-2.html#AEN291">[5]</a></td>
<td align="left" valign="top" width="95%">
<p>Vea Craig Mundie, "The Commercial Software Model," (El Modelo de
Software Comercial) senior vicepresidente, Microsoft Corp. Citado
de un transcrito en l&iacute;nea del discurso de Mundie de Mayo 3
de 2001 ante la Escuela Stern de Negocios de la Universidad de
Nueva York.
http://www.microsoft.com/presspass/exec/craig/05-03sharedsource.asp</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN326"
   href="chapter-2.html#AEN326">[6]</a></td>
<td align="left" valign="top" width="95%">
<p>El acr&oacute;nimo GNU significa "GNU no es Unix." En otra
porci&oacute;n de su discurso en la Universidad de Nueva York de
mayo 29, 2001, Stallman recapitul&oacute; el origen del
acr&oacute;nimo:</p>
<a name="AEN328"></a>
<blockquote class="BLOCKQUOTE">
<p>Nosotros los hackers siempre buscamos un nombre que sea bonito o
picante para un programa, puesto que el nombrar un programa es la
mitad del gozo de escribir un programa. Nosotros tenemos
tambi&eacute;n la tradici&oacute;n de los acr&oacute;nimos
recursivos, para expresar el hecho que el programa que estamos
escribiendo es similar a alg&uacute;n otro programa
existente&hellip; Estuve buscando por un acr&oacute;nimo recursivo
para Algo No Es UNIX. Y ensay&eacute; todas las 26 letras y
descubr&iacute; que con ninguna de ellas se formaba una palabra.
Decid&iacute; hacer de ela una contracci&oacute;n. De esta manera
tendr&iacute;a un acr&oacute;nimo de 3 letras, para Algo No es
UNIX. Ensay&eacute; diferentes letras y me cruc&eacute; con la
palabra "GNU". Esa era. Aun siendo un hincha de los juegos de
palabras, Stallman recomienda que los usuarios de software
pronuncien la "g" al comienzo del acr&oacute;nimo (en ingl&eacute;s
i.e., "gah-new"). Esto no s&oacute;lo evita la confusi&oacute;n con
la palabra "gnu", el nombre del mam&iacute;fero Africano,
<em>Connochaetes gnou</em>, tambi&eacute;n se evita la
confusi&oacute;n con el adjetivo ingl&eacute;s "new". "Hemos estado
trabajando en &eacute;l por los &uacute;ltimos 17 a&ntilde;os
as&iacute; que &eacute;l no es exactamente nuevo," dice
Stallman.</p></blockquote>
<p>Fuente: notas del autor y transcrito en l&iacute;nea de "Free
Software: Freedomand Cooperation," charla de Richard Stallman de
mayo 29, 2001, en la Universidad de Nueva York.
http://www.gnu.org/events/rms-nyu-2001-transcript.txt</p></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="chapter-1.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="chapter-3.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">Todo por una
impresora</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">Un retrato del hacker
adolescente</td></tr></table></div>
</body>
</html>
