<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>La comuna de Emacs</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="Peque&ntilde;o Charco de Libertad"
      href="chapter-5.html">
<link rel="NEXT" title="Una Decisi&oacute;n Moral Dif&iacute;cil"
href="chapter-7.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href=
"chapter-5.html" accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"chapter-7.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-6">Cap&iacute;tulo 6. La comuna de
Emacs</a></h1>
<p>El laboratorio de Inteligencia Artificial (IA) de 1970 era desde
donde se le viera un lugar especial. Proyectos de frontera e
investigadores de primera categor&iacute;a le dieron una
posici&oacute;n eleveda en el mundo de la ciencia de los
computadores. As&iacute; mismo, la cultura hacker interna y sus
pol&iacute;ticas an&aacute;rquicas llevaron a una m&iacute;stica
revolucionaria. Solo despu&eacute;s, cuando muchos de los
cient&iacute;ficos y superestrellas del software del laboratorio
hab&iacute;an partido, se dar&iacute;an cuenta los hackers del
mundo &uacute;nico y ef&iacute;mero en el que cual una vez
hab&iacute;an vivido.</p>
<p>"Era un poco como el Jard&iacute;n del Ed&eacute;n", dice
Stallman, resumiendo al laboratorio y a su ethos de compartir de
software en un art&iacute;culo de 1998 en Forbes. "No se nos
hab&iacute;a ocurrido no cooperar". <a name="AEN1073" href=
"#FTN.AEN1073">[1]</a></p>
<p>Tales descripciones mitol&oacute;gicas, a pesar de ser extremas,
subrayan un hecho importante. El piso noveno de 545 Tech Square era
m&aacute;s que un lugar de trabajo para muchos. Para hackers como
Stallman, esto era el hogar.</p>
<p>La palabra "hogar" es un t&eacute;rmino pesado en el
l&eacute;xico de Stallman. En una cr&iacute;tica a su padres,
Stallman, hasta el d&iacute;a presente, se niega a aceptar
cualquier otro hogar antes de Currier House, el dormitorio en el
cual vivi&oacute; durante sus d&iacute;as en Harvard.
Tambi&eacute;n se conoce que el describe la partida de ese hogar en
t&eacute;rminos tragic&oacute;micos. Una vez, mientras
describ&iacute;a su a&ntilde;os en Harvard, Stallman dijo que su
&uacute;nico resentimiento era que lo hab&iacute;an echado. No fue
hasta que le pregunt&eacute; a Stallman que precipit&oacute; su
<span class="SYSTEMITEM">salida</span>, que me di cuenta que
hab&iacute;a entrado en una de sus frases cl&aacute;sicas.</p>
<p>"En Harvard ten&iacute;an la pol&iacute;tica de que si usted
pasaba demasiadas clases ellos le ped&iacute;an que partiera", dice
Stallman.</p>
<p>Sin dormitorio ni deseos de regresar a New York, Stallman
sigui&oacute; un camino iluminado por Sussman, y muchos otros
hackers antes de el. Cuando ingres&oacute; a MIT como un estudiante
graduado, Stallman rent&oacute; un apartamento en el cercano
Cambridge pero muy pronto vio al laboratorio de IA como su hogar
<i class="FOREIGNPHRASE">de facto</i>. En un discurso de 1986,
Stallman record&oacute; las memorias del laboratorio de IA durante
ese per&iacute;odo:</p>
<a name="AEN1094"></a>
<blockquote class="BLOCKQUOTE">
<p>Yo habr&eacute; vivido m&aacute;s dentro del laboratorio que la
mayor&iacute;a de la gente, porque por alguna raz&oacute;n cada uno
o dos a&ntilde;os no ten&iacute;a apartamento y entonces
viv&iacute;a unos cuantos meses en el laboratorio. Siempre lo
encontr&eacute; bastante c&oacute;modo, as&iacute; como agradable y
fr&iacute;o en el verano. Pero no era extra&ntilde;o encontrar
gente qued&aacute;ndose dormida dentro del laboratorio, por el
entusiasmo; uno se quedaba despierto tanto como pudiera
   <i class="FOREIGNPHRASE">hack</i>eando, porque uno no
   quer&iacute;a detenerse. Y cuando uno estaba completamente
   exhausto, uno escalaba a la m&aacute;s pr&oacute;xima superficie
   horizontal suave. Una atm&oacute;sfera muy informal. <a name=
   "AEN1097" href="#FTN.AEN1097">[2]</a></p></blockquote>
<p>La atm&oacute;sfera hogare&ntilde;a del laboratorio pod&iacute;a
ser un problema algunas veces. Lo que algunos ve&iacute;an como un
dormitorio, otros los ve&iacute;an como un guarida del opio
electr&oacute;nico. En el libro de 1976, [<span class=
"CITATION">Computer Power and Human Reason</span>], el investigador
del MIT Joseph Weizenbaum ofreci&oacute; una cr&iacute;tica mordaz
de los "<i class="FOREIGNPHRASE">computer bums</i>", t&eacute;rmino
acu&ntilde;ado por Weizenbaum para los hackers que poblaban los
cuartos de computadores como el laboratorio de IA. "Sus ropas
arrugadas, su pelo sin ba&ntilde;ar y sus caras sin afeitar, y su
pelo enmara&ntilde;ado testificaban que ellos eran indiferentes a
sus cuerpos y al mundo en el que se mov&iacute;an", escribe
Weizenbaum. "[Los <i class="FOREIGNPHRASE">computer bums</i>]
exist&iacute;an, al menos cuando estaban conectados, solo a
trav&eacute;s y para los computadores". <a name="AEN1111" href=
"#FTN.AEN1111">[3]</a></p>
<p>Despu&eacute;s de un cuarto de siglo despu&eacute;s de su
publicaci&oacute;n, Stallman todav&iacute;a <span class=
"SYSTEMITEM">se le erizan los pelos</span> cuando oye la
descripci&oacute;n de "<i class="FOREIGNPHRASE">computer bum</i>"
de Weizenbaum, discutiendola en tiempo presente como si Weizenbaum
mismo estuviera en el cuatro. "El quiere que la gente sea tan solo
profesionales, haci&eacute;ndolo por el dinero y queri&eacute;ndose
ir y olvidarse del asunto lo m&aacute;s pronto posible", dice
Stallman. "Lo que el ve como estado normal de las cosas yo lo veo
como una tragedia".</p>
<p>La vida de <i class="FOREIGNPHRASE">hacker</i>, sin embargo, no
estaba excenta de la tragedia. Stallman caracteriza su
transici&oacute;n de hacker de fin de semana a morador de tiempo
completo en el laboratorio de IA como una serie de dolorosos
infortunios que solo podian ser remediados a trav&eacute;s de la
euforia de <i class="FOREIGNPHRASE">hack</i>ear. Como Stallman lo
dice, el primer infortunio fue su graduaci&oacute;n de Harvard.
Ansioso de continuar sus estudios en f&iacute;sica, Stallman
entr&oacute; como estudiante graduado en el MIT. La escogencia de
universidad fue natural. No solo le dio a Stallman la oportunidad
de seguir los pasos de los grandes alumnos del MIT: William
Shockley ('36), Richard P. Feynman ('39), y Murray Gell-Mann ('51),
tambi&eacute;n lo puso dos millas m&aacute;s cerca del laboratorio
de IA y de su nuevo computador PDP-10. "Mi atenci&oacute;n iba
hacia la programaci&oacute;n, pero pens&eacute;, bueno, tal vez
pueda hacer ambas", dice Stallman.</p>
<p>Trabajando en los campos de la ciencia de nivel graduado en el
d&iacute;a y programando en los confines mon&aacute;sticos del
laboratorio de IA en la noche, Stallman trat&oacute; de adquirir un
balance perfecto. El <i class="FOREIGNPHRASE">folcrum</i> de su
<i class="FOREIGNPHRASE">geek teeter-totterr</i> fueron sus salidas
semanales con la tropa de danza folcr&oacute;rica, su &uacute;nica
actividad social que le garantizaba una interacci&oacute;n
m&oacute;dica con el sexo opuesto. Hacia el final del primer
a&ntilde;o en el MIT, sin embargo, el desastre golpe&oacute;. Una
lesi&oacute;n en la rodilla forz&oacute; a Stallman a renunciar a
la tropa. Al principio vi&oacute; la lesi&oacute;n como un problema
temporal, dedicando el tiempo disponible que el hubiera gastado en
bailar a trabajar en el laboratorio de IA a&uacute;n m&aacute;s. Al
final del verano, cuando la rodilla todav&iacute;a dol&iacute;a y
las clases volv&iacute;an a comenzar, Stallman comenz&oacute; a
preocuparse. "Mi rodilla no mejoraba", Stallman recuerda, "lo que
significaba que deb&iacute;a detener la danza completamente. Yo
estaba destrozado".</p>
<p>Sin dormitorio y sin baile, el universo social de Stallman hizo
implosi&oacute;n. Como un astronauta experimentando los efectos de
la gravedad cero, Stallman descubri&oacute; que su habilidad de
interactuar con no <i class="FOREIGNPHRASE">hackers</i>,
especialmente mujeres no <i class="FOREIGNPHRASE">hackers</i> se
hab&iacute;a atrofiado significativamente. Despu&eacute;s de 16
semanas en el laboratorio de IA, la autoconfianza que hab&iacute;a
acumulado durante los cuatro a&ntilde;os en Harvard estaba
virtualmente desaparecida.</p>
<p>"Yo sent&iacute;a basicamente que hab&iacute;a perdido mi
energ&iacute;a", recuerda Stallman. "Yo hab&iacute;a perdido al
energ&iacute;a de hacer cualquier cosa excepto lo que me tentaba
m&aacute;s inmediatamente. La energ&iacute;a de hacer cualquier
otra cosa se hab&iacute;a ido. Yo estaba en un total
desbalance".</p>
<p>Stallman se retir&oacute; del mundo a&uacute;n m&aacute;s,
enfoc&aacute;ndose enteramente en su trabajo en el laboratorio de
IA. En Octubre de 1975, el se retiraba del MIT, para no volver
m&aacute;s. El <i class="FOREIGNPHRASE">hack</i>eo de software, que
alguna vez hab&iacute;a sido un hobby, se convirti&oacute; en su
llamada.</p>
<p>Regresando a tal per&iacute;odo, Stallman ve la
transici&oacute;n de estudiante de tiempo completo a <i class=
"FOREIGNPHRASE">hacker</i> de tiempo completo como inevitable.
M&aacute;s temprano que tarde, el cree, la llamada de sirena del
<i class="FOREIGNPHRASE">hack</i>eo de computadores habr&iacute;a
superado su inter&eacute;s en otros asuntos profesionales. "Con las
matem&aacute;ticas y la f&iacute;sica, nunca hubiera encontrado una
forma de contribuir", dice Stallman, recordando su esfuerzo
anterior a la lesi&oacute;n de la rodilla". "Yo hubiera estado
orgulloso de hacer avances en cualquiera de esos campos, pero nunca
encontr&eacute; una forma de hacer esto. No sab&iacute;a donde
comenzar. Con el software, vi inmediatamente como escribir cosas
que correr&iacute;an y ser&iacute;an &uacute;tiles. El placer de
tal conocimiento me llev&oacute; a querer hacerlo m&aacute;s".</p>
<p>Stallman no fue el primero en igualar a el <i class=
"FOREIGNPHRASE">hack</i>eo con el placer. Muchos de los
   <i class="FOREIGNPHRASE">hackers</i> que trabajaban en el
   laboratorio de IA pose&iacute;an hojas de vida acad&eacute;micas
   similares. La mayor&iacute;a de ellos hab&iacute;an venido a
   alcanzar grados en matem&aacute;ticas o ingenier&iacute;a
   el&eacute;ctrica solo para rendir su carrera acad&eacute;micas y
   sus ambiciones profesionales con la alegr&iacute;a total que
   proven&iacute;a de resolver problemas nunca antes tratados. Como
   Santo Tom&aacute;s de Aquino, el escol&aacute;stico conocido por
   trabajar durante largo tiempo en su Summa Teol&oacute;gica, que
   alcanzaba visiones espirituales, los programadores alcanzaban
   estados trascendentales internos a trav&eacute;s de total
   concentraci&oacute;n mental y cansancio f&iacute;sico. A pesar
   de que Stallman desprecia las drogas, como la mayor&iacute;a de
   <i class="FOREIGNPHRASE">hackers</i>, el disfrutaba de la
   <i class="FIRSTTERM">alta</i> (en ingl&eacute;s <i class=
   "FOREIGNPHRASE">high</i>) que ven&iacute;a cerca del final de
   una jornada de codificaci&oacute;n de 20 horas.</p>
<p>Tal vez la sensaci&oacute;n m&aacute;s placentera, fue el
sentimiento de plenitud personal. Cuando se trataba de <i class=
"FOREIGNPHRASE">hack</i>ear, Stallman era un natural. Una infancia
llena de jornadas de estudio hasta tarde en la noche, le dio la
habilidad de trabajar durante largas horas con poco sue&ntilde;o.
Como un rechazado social desde los 10 a&ntilde;os, el ten&iacute;a
poca dificultad en trabajar solo. Como un matem&aacute;tico con un
el don incorporado para la l&oacute;gica y la previs&oacute;n
Stallman pose&iacute;a la habilidad de rodear las barreras de
dise&ntilde;o que dejaban a muchos <i class=
"FOREIGNPHRASE">hackers</i> dando vueltas en c&iacute;rculo.</p>
<p>"El era especial" recuerda Gerald Sussman, un miembro de la
facultad del MIT y un ex-investigador en el laboratorio de IA.
Describe a Stallman como "un pensador claro y un dise&ntilde;ador
claro", Sussman emple&oacute; a Stallman como un asistente de
investigaci&oacute;n de un proyecto en 1975. El proyecto era
complejo, involucrando la creaci&oacute;n de un programa de IA que
pudiera analizar diagramas de circutios. No s&oacute;lo involucraba
un dominio experto de Lisp, un lenguaje de programaci&oacute;n
construido espec&iacute;ficamente para las aplicaciones de IA, sino
que tambi&eacute;n requer&iacute;a la compresi&oacute;n de como un
humano se aproximar&iacute;a a la misma tarea.</p>
<p>Cuando no estaba trabajando en proyectos oficiales como el
programa de Sussman de an&aacute;lisis autom&aacute;tico de
circuitos, Stallman dedicaba su tiempo a proyectos mascota. Era
parte del mejor inter&eacute;s de un <i class=
"FOREIGNPHRASE">hacker</i>, el mejorar la infraestructura de
software del laboratorio, y un uno de los proyectos mascota
m&aacute;s grandes de Stallman durante este per&iacute;odo fue el
programa de edici&oacute;n del laboratorio TECO.</p>
<p>La historia del trabajo de Stallman en TECO durante 1970
est&aacute; inextrincablemente unida con el liderazgo del
movimiento del software libre. Fue un paso significativo en la
historia de la evoluci&oacute;n de los computadores, tanto que una
peque&ntilde;a recapitulaci&oacute;n de tal evoluci&oacute;n es
necesaria. Durante los decenios de 1950 y 1960, cuando los
computadores primero aparec&iacute;an en las universidades, la
programaci&oacute;n de computadores era un asunto
incre&iacute;blemente abstracto. Para comunicarse con la
m&aacute;quina, los programadores crearon una serie detarjetas
perforadas, con cada tarjeta representando un comando individual de
software. Los programadores dejaban las tarjetas al administrador
central de la m&aacute;uqina quien despu&eacute;s las insertaba,
una a una, dentro de la m&aacute;quina, esperando que la
m&aacute;quina perforara un nuevo conjunto de tarjetas perforadas,
las cuales el programador decifraba como salida. Este proceso,
conocido como "procesamiento en bloque" era engorroso y lento.
Tambi&eacute;n era susceptible de abusos de autoridad. Uno de los
factores motivantes detr&aacute;s de la aversi&oacute;n visceral a
la centralizaci&oacute;n por parte de los <i class=
"FOREIGNPHRASE">hackers</i> era el poder esgrimido por los
operadores de sistema quienes dictaminaban que tareas ten&iacute;an
prioridad.</p>
<p>En 1962, los cient&iacute;ficos de la computaci&oacute;n y los
<i class="FOREIGNPHRASE">hackers</i> involucrados en el proyecto
MAC del MIT , un proyecto pionero en el laboratorio de IA, tomaron
pasos para aliviar esta frustaci&oacute;n. El tiempo compartido,
originalmente conocido como "tiempo robado", hizo posible a
m&uacute;ltiples programas tomar ventaja de las capacidades
operativas de la m&aacute;quina. Las interfaces de teletipo
hicieron posible comunicarse con la m&aacute;quina, no a
trav&eacute;s de una serie de tarjetas perforadas sino a
trav&eacute;s de texto. Un programador escrib&iacute;a los comandos
y le&iacute;a la salida generada por la m&aacute;quina l&iacute;nea
a l&iacute;nea.</p>
<p>Durante los &uacute;ltimos a&ntilde;os de 1960, el dise&ntilde;o
de interfaz dio saltos adicionales. En una famosa conferencia de
1968, Doug Engelbart, un cient&iacute;fico que trabajaba en en el
Instituto de Investigaci&oacute;n de Stanford, revel&oacute; un
prototipo de las modernas interfaces gr&aacute;ficas.
A&ntilde;adiendo un televisor al computador y adicionado una
aparato apuntador que Engelbarg llamaba un " rat&oacute;n", el
cient&iacute;fico creo un sistema a&uacute;n m&aacute;s interactivo
que el sistema de tiempo compartido del MIT. Tratando el
dispositivo de video como una impresora de alta velocidad, el
sistema de Engelbart le di&oacute; al usuario la habilidad de mover
el cursor alrededor de la pantalla y ver la posici&oacute;n del
cursor actualizada por el computador en tiempo real. El usuario
ten&iacute;a s&uacute;bitamente la habilidad de posicionar texto en
cualquier lugar de la pantalla.</p>
<p>Tales innovaciones tomar&iacute;an otras dos d&eacute;cadas en
hacer su debut en el territorio comercial. Sin embargo, en la
d&eacute;cada de 1970, las pantallas de video hab&iacute;an
empezado a reemplazar los teletipos como terminales de despliegue,
creando el potencial de la pantalla completa opuesto a la capacidad
de edici&oacute;n l&iacute;nea por l&iacute;nea.</p>
<p>Uno de los primeros programas que tom&oacute; ventaja de la
capacidad de pantalla completa fue <span class=
"ACRONYM">TECO</span> del laboratorio de IA del <span class=
"ACRONYM">MIT</span>. La abreviaci&oacute;n proviene de Editor de
Texto y COrrector (en ingl&eacute;s <i class="FOREIGNPHRASE">Text
Editor y COrrector</i>), el programa hab&iacute;a sido actualizado
por programadores desde un editor de teletipo para la
m&aacute;quina PDP-6 del laboratorio. <a name="AEN1203" href=
"#FTN.AEN1203">[4]</a></p>
<p>TECO fue una mejora sustancial sobre editores antiguos, pero sin
embargo ten&iacute;a sus limitaciones. Para crear y editar un
documento, un programador ten&iacute;a que escribir una serie de
comandos de software especificando cada edici&oacute;n. Era un
proceso abstracto. En contraste con los modernos procesadores de
palabra, que actualizan el texto con cada tecla, TECO exig&iacute;a
que el usuario ingresar&aacute; una serie de instrucciones de
edici&oacute;n seguido de una secuencia de "fin de comando", solo
para cambiar el texto. Con el tiempo, un <i class=
"FOREIGNPHRASE">hacker</i> se hac&iacute;a lo suficientemente
eficiente para escribir documentos enteros en modo de
edici&oacute;n, pero como Stallman indicar&iacute;a despu&eacute;s,
el proceso requer&iacute;a "la habilidad mental del ajedrez a
ciegas" <a name="AEN1210" href="#FTN.AEN1210">[5]</a></p>
<p>Para facilitar el proceso, los <i class=
"FOREIGNPHRASE">hackers</i> del laboratorio de IA hab&iacute;an
construido un sistema que desplegaba modos de "fuente" y
"resultado" en una pantalla dividida. A pesar de este <i class=
"FOREIGNPHRASE">hack</i> innovador, cambiar entre modo y modo era
una molestia.</p>
<p>TECO no era el &uacute;nico editor de pantalla completa que
flotaba alrededor del mundo de los computadore en ese tiempo.
Durante una visita al Laboratorio de Inteligencia Artificial de
Stanford en 1976, Stallman encontr&oacute; un programa de
edici&oacute;n llamado E. El programa ten&iacute;a una
caracter&iacute;stica interna, que permit&iacute;a al usuario
actualizar el texto despu&eacute;s de que pulsara cada tecla. En el
lenguaje de la programaci&oacute;n de 1970, E fue uno de los
primeros y rudimentario editores <span class=
"ACRONYM">WYSIWYG</span>. Abreviaci&oacute;n para "lo que ves es lo
que obtienes" (en ingl&eacute;s "<i class="FOREIGNPHRASE">what you
see is what you get</i>") <span class="ACRONYM">WYSIWYG</span>
significaba que un usuario pod&iacute;a manipular el archivo
movi&eacute;ndose a trav&eacute;s del texto desplegado, en
contraste con trabajar con un programa de edici&oacute;n a
trav&eacute;s de comandos. <a name="AEN1225" href=
"#FTN.AEN1225">[6]</a></p>
<p>Impresionado por este <i class="FOREIGNPHRASE">hack</i>,
Stallman busc&oacute; maneras de expandir la funcionalidad de TECO
en una forma similar al regreso al MIT. El encontr&oacute; una
caracter&iacute;stica de TECO llamada Control-R, escrita por Carl
Mikkelson y nombrada a ra&iacute;z de la combinaci&oacute;n de dos
teclas que activaba su funcionamiento. El <i class=
"FOREIGNPHRASE">hack</i> de Mikkelson cambiaba a TECO de su modo
abstracto de ejecuci&oacute;n de comandos hacia un modo m&aacute;s
intuitivo de tecla a tecla. Stallman revis&oacute; la
caracter&iacute;stica de una forma s&uacute;til pero significativa.
El hizo posible activar algunos comandos de cadena o " macros,"
usando otras combinaciones de dos teclas. Donde los usuarios
hab&iacute;an entrado solo cadenas de comandos y las descartaban
despu&eacute;s de ingresarlas, el programa de Stallman hizo posible
salvar trucos de macro en un archivo y llamarlos despu&eacute;s a
voluntad. El <i class="FOREIGNPHRASE">hack</i> de Mikkelson
hab&iacute;a llevado TECO al nivel de un editor WYSIWYG. El
<i class="FOREIGNPHRASE">hack</i> de Stallman lo hab&iacute;a
llevado al nivel de un editor WYSIWYG programable por el usuario.
"Eso fue realmente un avance", dice Guy Steele, un compa&ntilde;ero
<i class="FOREIGNPHRASE">hacker</i> del AI en ese tiempo.
   <a name="AEN1237" href="#FTN.AEN1237">[7]</a></p>
<p>Debido a la propia cosecha de Stallman, el <i class=
"FOREIGNPHRASE">hack</i> de macros trajo una una explosi&oacute;n
de innovaci&oacute;n futura. "Todas las personas y su hermano
estaban escribiendo su propia colecci&oacute;n de comandos de
edici&oacute;n, un comando para cada cosa que el t&iacute;picamente
quisiera hacer", Stallman recuerda. "La gente se pasaba luego las
macros y las mejoraba, haci&eacute;ndolas m&aacute;s poderosas y
general. La colecci&oacute;n de redefiniciones gradualmente se
volvieron programas en s&iacute; mismos". <a name="AEN1242"
   href="#FTN.AEN1242">[8]</a></p>
<p>Tanta gente encontr&oacute; las innovaciones de las macros
&uacute;tiles y las incorpor&oacute; de sus programas de TECO que
el editor TECO se volvi&oacute; secundario en comparaci&oacute;n
con la macroman&iacute;a que hab&iacute;a despertado. "Comenzamos a
categorizarlo mentalmente como un lenguaje de programaci&oacute;n
en vez de un editor", dice Stallman. Los usuarios experimentaban su
propio placer modificando el software e intercambiando nuevas
ideas. <a name="AEN1246" href="#FTN.AEN1246">[9]</a></p>
<p>Dos a&ntilde;os despu&eacute;s de la explosi&oacute;n, la rata
de innovaci&oacute;n comenz&oacute; a exhibir efectos de borde
peligrosos. El crecimiento explosivo hab&iacute;a provisto una
excitante validaci&oacute;n de la aproximaci&oacute;n colaborativa
de los programadores, pero tambi&eacute;n hab&iacute;a conducido a
una complejidad excesiva. "Ten&iacute;amos un efecto de Torre de
Babel" dice Guy Steele.</p>
<p>El efecto amenazaba matar el esp&iacute;ritu que lo hab&iacute;a
creado, dice Steele. Los <i class="FOREIGNPHRASE">hackers</i>
hab&iacute;an dise&ntilde;ado al ITS para facilitar la habilidad de
los programadores de compartir conocimiento y mejorar el trabajo de
cada uno. Esto significaba ser capaz de sentarse en otro escritorio
de un programador, abrir el trabajo del programa y hacer
comentarios y modificaciones directamente sobre el software.
"Algunas veces la manera m&aacute;s f&aacute;cil de mostrar como
programar o encontrar errores a algu&iacute;en, era simplemente
sentarse en la terminal y hacerlo por &eacute;l", explica
Steele.</p>
<p>La caracter&iacute;stica de las macros, despu&eacute;s de su
segundo a&ntilde;o, comenz&oacute; a impedir esta capacidad. En su
ansia por abrazar las nueva capacidades de pantalla completa, los
<i class="FOREIGNPHRASE">hackers</i> hab&iacute;an configurado sus
versiones de TECO hasta el punto donde un hacker sent&aacute;ndose
en otra terminal de programador ten&iacute;a que gastar la primera
hora encontrando qu&eacute; comandos de macro hac&iacute;an cada
actividad.</p>
<p>Frustado, Steele se di&oacute; a la tarea de resolver el
problema. El comenz&oacute; a recolectar los cuatro distintos
paquetes de macros y comenz&oacute; a ensamblar una tabla
documentando los comandos m&aacute;s &uacute;tiles. En el curso de
la implementaci&oacute;n del dise&ntilde;o especificado en la
tabla, Steele dice que atrajo la atenci&oacute;n de Stallman.</p>
<p>"El comenz&oacute; a mirar sobre mi hombro, pregunt&aacute;ndome
que estaba haciendo", recuerda Steele.</p>
<p>Para Steele, un programador de voz suave que interactuaba con
Stallman poco frecuentemente, el recuerdo todav&iacute;a lo
acompa&ntilde;a. Mirar sobre el hombro de otro programador mientra
este programaba era una actividad com&uacute;n en el laboratorio de
IA. Stallman, el mantenedor de TECO en el laboratorio, le
pareci&oacute; el trabajo de Steele "interesante" y prontamente se
di&oacute; a la tarea de terminarlo.</p>
<p>"Como me gusta decirlo, yo hice el primer 0.001 por ciento de la
implementaci&oacute;n y Stallman hizo el resto", dice Steele en
medio de una risa.</p>
<p>El nombre del nuevo proyecto, <span class=
"ACRONYM">Emacs</span>, vino cortes&iacute;a de Stallman.
Abreviaci&oacute;n de "macros de edici&oacute;n" (en ingl&eacute;s
"editing macros"), signific&oacute; la trascendencia evolutiva que
hab&iacute;a tomado lugar durante la explosi&oacute;n de las macros
dos a&ntilde;os antes. Tambi&eacute;n tom&oacute; ventaja de un
hueco en el l&eacute;xico de la programaci&oacute;n de software.
Notando una ausencia de programas en ITS que comenzaron con la
letra "E", Stallman escogi&oacute; Emacs, haciendo posible
referenciar al programa con una sola letra. Una vez m&aacute;s, el
deseo del <i class="FOREIGNPHRASE">hacker</i> de la eficiencia,
hab&iacute;a dejado su marca. <a name="AEN1266" href=
"#FTN.AEN1266">[10]</a></p>
<p>En el transcurso de desarrollar un sistema est&aacute;ndar de
comandos de macros, Stallman y Steele tuvieron que atravesar una
cuerda floja pol&iacute;tica. En crear un programa est&aacute;ndar,
Stallman estaba en clara violaci&oacute;n del principio
   <i class="FOREIGNPHRASE">hacker</i> fundamental de
   "promoci&oacute;n de la descentralizaci&oacute;n". El
   tambi&eacute;n estaba amenazando de cortar la misma flexibilidad
   que hab&iacute;a alimentado la innovaci&oacute;n explosiva de
   TECO en primer lugar.</p>
<p>"De un lado, estabamos tratando de tener un conjunto uniforme de
comandos de nuevo; pero de otro lado, quer&iacute;amos mantenerlo
abierto, porque la programabilidad era importante", recuerda
Steele.</p>
<p>Para resolver el problema, Stallman, Steele y sus
compa&ntilde;eros <i class="FOREIGNPHRASE">hackers</i> David Moon y
David Weinreib limitaron el esfuerzo de estandarizaci&oacute;n a
los comandos WYSIWYG que controlaban como aparec&iacute;a el texto
en la pantalla. El resto del esfuerzo en Emacs ser&iacute;a
dedicado a retener la extensiblidad del programa.</p>
<p>Stallamn se enfrentaba ahora a otro dilema: si los usuarios
hacian cambios pero no comunicaban dichos cambios al resto de la
comunidad, el efecto de la Torre de Babel volver&iacute;a a emerger
en algunos sitios. Recayendo en la doctrina <i class=
"FOREIGNPHRASE">hacker</i> de compartir la innovaci&oacute;n,
Stallman incrust&oacute; una frase dentro del c&oacute;digo fuente
que fijaba los t&eacute;rminos de uso. Los usuarios eran libres de
modificar y redistribuir el c&oacute;digo con la condici&oacute;n
de que devolvieran las extensiones que ellos hicieran. Stallman lo
llam&oacute; la "comuna de Emacs". Justo como TECO se hab&iacute;a
convertido en algo m&aacute;s que un simple editro, Emacs se
hab&iacute;a convertido en algo m&aacute;s que un simple programa.
Para Stallman, era un contrato social. En un temprano memo en el
que documentaba el proyecto, Stallman escribi&oacute; los
t&eacute;rminos de tal contrato. "EMACS", el escribi&oacute;n, "fue
distribuido con base en la cooperaci&oacute;n comunal, que
significa que todas las mejoras deb&iacute;an ser devueltas a mi
para ser incorporadas y distribuidas". <a name="AEN1278" href=
"#FTN.AEN1278">[11]</a></p>
<p>No todos aceptaban el contrato. La innovaci&oacute;n explosiva
continu&oacute; durante toda la d&eacute;cada, resultando en un
gr&aacute;n n&uacute;mero de programas similares a Emacs con
diferentes grados de compatibilidad. Unos cuantos citaban su
relaci&oacute;n con el Emacs original de Stallman con nombres
graciosos y recursivos: Sine (Sine no es Emacs), Eine (Eine no es
Emacs), y Zwei (Zwei fue Eine inicialmente). Como un dedicado
exponente de la &eacute;tica <i class="FOREIGNPHRASE">hacker</i>,
Stallman no vi&oacute; razones para frenar la innovaci&oacute;n a
trav&eacute;s de acciones legales. Sin embargo, el hecho de que
algunas personas tomaran tan ansiosamente el software del pecho de
la comunidad, lo alteraran, y le colocaran un nuevo nombre en el
software resultante mostraba una incre&iacute;ble falta de
cortes&iacute;a.</p>
<p>Tal compartimiento descort&eacute;s se reflej&oacute; contra
otros, inquietando a los desarrollos en la comunidad <i class=
"FOREIGNPHRASE">hacker</i>. La decisi&oacute;n de Brian Reid en
1979 de incrustar "<i class="FIRSTTERM">bombas de tiempo</i>" en
Scribe, haciendo posible que Unilogic limitar&aacute; el
n&uacute;mero de accesos no pagados al software fue un mal augurio
para Stallman, "El consideraba esto la cosa m&aacute;s Nazi que
hab&iacute;a visto en su vida", recuerda Reid. A pesar de alcanzar
la fama en Internet, como el creador de la jerarqu&iacute;a
<em>alt</em> en Usenet, Reid dice que todav&iacute;a debe vivir con
la decisi&oacute;n que tom&oacute; en 1979, por lo menos ante los
ojos de Stallman. "El dijo que todo el software deber&iacute;a ser
libre y que el prospecto de cobrar dinero por el software era un
crimen contra la humanidad". <a name="AEN1294" href=
"#FTN.AEN1294">[12]</a></p>
<p>A pesar de que Stallman fue impotente para oponerse a la venta
de Reid, el ten&iacute;a la habilidad para restringir otras formas
de comportamiento juzgadas contrarias al <i class=
"FOREIGNPHRASE">ethos</i> del <i class="FOREIGNPHRASE">hacker</i>.
Como mantenedor central del c&oacute;digo para la "comuna" de
Emacs, Stallman comenz&oacute; a esgrimir su poder en favor de
efectos pol&iacute;ticos. Durante las fases finales del conflicto
acerca de los sistemas de palabras claves, con los administradores
en el Laboratorio para la Ciencia del Computador, Stallman
inici&oacute; una huelga de "software" <a name="AEN1308" href=
"#FTN.AEN1308">[13]</a> en la que se negaba a enviar la
&uacute;ltima versi&oacute;n de Emacs a los miembros del
laboratorio hasta que ellos rechazaran el sistema de seguridad en
los computadores del laboratorio. La acci&oacute;n no hizo mucho
por mejorar la creciente reputaci&oacute;n de extremista de
Stallman, pero hizo ver su punto de vista: esperaba que los
miembros de la comuna hablaran de los valores b&aacute;sicos del
<i class="FOREIGNPHRASE">hacker</i>.</p>
<p>"Una gran cantidad de personas estaban furiosas conmigo,
diciendo que yo estaba tratando de hacerlos rehenes o de
chantajearlos, lo cual en alg&uacute;n sentido era lo que yo
hac&iacute;a", dir&iacute;a posteriormente Stallman al autor Steven
Levy". "Yo estaba entablando violencia con ellos porque yo pensaba
que ellos estaban entablando violencia con todos los dem&aacute;s".
<a name="AEN1313" href="#FTN.AEN1313">[14]</a></p>
<p>Con el tiempo, Emacs se volvi&oacute; un a herramienta de venta
la &eacute;tica <i class="FOREIGNPHRASE">hacker</i>. La
flexibilidad que Stallman le hab&iacute;a dado al software no solo
alentaba a la colaboraci&oacute;n, la demandaba. Los usuarios que
no quer&iacute;an quedar relegados de los &uacute;ltimos
desarrollos en la evoluci&oacute;n de Emacs o no quer&iacute;an
contribuir sus contribuciones de vuelta a Stallman corr&iacute;an
el riesgo de perderse los &uacute;ltimos cambios. Y los cambios
fueron muchos. Veinte a&ntilde;os despu&eacute;s, los usuarios han
modificado a Emacs para tantos usos como lo son hojas de
c&aacute;lculo, calculadoras, bases de datos y navegador web, que
los desarrolladores m&aacute;s recientes de Emacs adoptaron una
<i class="FOREIGNPHRASE">overflowing sink</i> para representar su
funcionalidad vers&aacute;til. "Esta era la idea en que
quer&iacute;amos convenir", dijo Stallman. "La cantidad de cosas
que conten&iacute;a es al mismo tiempo maravillosa y terrible".</p>
<p>Los contempor&aacute;neos del laboratorio de IA era m&aacute;s
caritativos. Hal Abelson, un estudiante graduao del MIT que
trabaj&oacute; con Stallman durante 1970 y que luego
asistir&iacute;a Stallman como miembro de la mesa directiva de la
Fundaci&oacute;n para el Software Libre, describe a Emacs como "una
creaci&oacute;n absolutamente brillante". Dando a los programadores
la forma de a&ntilde;adir nuevas caracter&iacute;sticas y
librer&iacute;as de software sin entrometerse con el sistema, dice
Abelson, Stallman paviment&oacute; la v&iacute;a para futuros
proyectos de software de gran escala colaborativos. "Su estructura
era lo suficiente robusta como para tener gente colaborando
independientemente alrededor del mundo [y] contribuy&eacute;ndole",
dice Abelson. "No se si eso se hab&iacute;a hecho antes".
   <a name="AEN1323" href="#FTN.AEN1323">[15]</a></p>
<p>Guy Steele expresa una adminiraci&oacute;n similar. Actualmente
es un cient&iacute;fico investigador para <i class=
"FOREIGNPHRASE">Sun Microsystem</i>, el recuerda a Stallman
principalmente como un "programador brillante con la habilidad de
generar grandes cantidades de c&oacute;digo relativamente sin
errores". Aunque sus personalidades no concuerdan, Steele y
Stallman colaboraron lo suficiente para que Steele echara un
vistazo al intenso estilo de Stallman para codificar. El recuerda
un episodio notable a finales de la d&eacute;cada de 1970 cuando
los dos programadores colaboraron para escribir la
caracter&iacute;stica de "<span class="SYSTEMITEM">impresi&oacute;n
bonita</span>" del editor. Originalmente concebida por Steele, la
impresi&oacute;n bonita fue una caracter&iacute;stica activada por
una combinaci&oacute;n de teclas, que reformateaba el c&oacute;digo
visto en Emacs de tal forma que fuera al mismo tiempo m&aacute;s
legible y tomara menos espacio, avanzando a&uacute;n m&aacute;s las
caracter&iacute;sticas <span class="ACRONYM">WYSIWYG</span> del
programa. La caracter&iacute;stica fue lo suficientemente
estrat&eacute;gica para atraer el inter&eacute;s activo de
Stallman, y no mucho despu&eacute;s de que Steele la
escribi&oacute;, el y Stallman estaban planeando una versi&oacute;n
mejorada.</p>
<p>"Nos sentamos una ma&ntilde;ana", recuerda Steele. "Yo estaba en
el teclado, y el estaba en mi hombro", dice Steele. "El
ten&iacute;a la toda la voluntad de dejarme escribir, pero el me
dijo que deb&iacute;a escribir".</p>
<p>La sesi&oacute;n de programaci&oacute;n dur&oacute; 10 horas.
Durante todo ese tiempo, dice Steele, ni Stallman tom&oacute; un
descaso, ni hiz&oacute; una peque&ntilde;a caminata. Al final de la
sesi&oacute;n, ellos hab&iacute;an logrado escribir el <i class=
"FOREIGNPHRASE">hack</i> de la impresi&oacute;n bonita en menos de
100 l&iacute;neas. "Mis dedos estuvieron en el teclado todo el
tiempo", recuerda Steele, "pero se sent&iacute;a como si nuestras
ideas est&aacute;n flotando dentro de la pantalla. El me
dec&iacute;a que deb&iacute;a escribir, y yo lo
escrib&iacute;a".</p>
<p>La longitud de la sesi&oacute;n se revel&oacute; a s&iacute;
misma cuando Steele finalmente dejo el laboratorio de IA. Parado
afuera del edificio en la 545 <i class="FOREIGNPHRASE">Tech
Square</i>, el estaba sorprendido de encontrarse a s&iacute; mismo
rodeado de la oscuridad noctura. Como programador, Steele estaba
acostumbrado a sesiones de codificaci&oacute;n marat&oacute;nicas.
Sin embargo, algo de la sesi&oacute;n fue diferente. Trabajando con
Stallman hab&iacute;a forzado a Steele a bloquear todos los
est&iacute;mulos externos y a concentrar sus energ&iacute;as
mentales enteras en la tarea que estaba realizando. Recordando,
Steele dice que el ritmo mental de Stallman era al mismo tiempo
alegre y miedoso. "Mi primer pensamiento despu&eacute;s fue: Ha
sido una gran experiencia, muy intensa, y no quiero volver a
tenerla en mi vida"</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1073"
   href="chapter-6.html#AEN1073">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Josh McHugh, "For the Love of Hacking," [<span class=
"CITATION">Forbes</span>] (Agosto 10, 1998). <a href=
"http://www.forbes.com/forbes/1998/0810/6203094a.html" target=
"_top">http://www.forbes.com/forbes/1998/0810/6203094a.html</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1097"
   href="chapter-6.html#AEN1097">[2]</a></td>
<td align="left" valign="top" width="95%">
<p>See Stallman (1986).</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1111"
   href="chapter-6.html#AEN1111">[3]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Joseph Weizenbaum, [<span class="CITATION">Computer Power
and Human Reason: From Judgment to Calculation</span>] (W. H.
Freeman, 1976): 116.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1203"
   href="chapter-6.html#AEN1203">[4]</a></td>
<td align="left" valign="top" width="95%">
<p>De acuerdo con el archivo de Jargon (<i class=
"FOREIGNPHRASE">Jargon File</i>), el nombre original de TECO
provino de Editor de Cinta y Corrector (en ingl&eacute;s
   <i class="FOREIGNPHRASE">Tape Editor and Corrector</i>). Ver
   <a href="http://www.catb.org/~esr/jargon/html/entry/TECO.html"
   target=
   "_top">http://www.catb.org/~esr/jargon/html/entry/TECO.html</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1210"
   href="chapter-6.html#AEN1210">[5]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "EMACS: The Extensible, Customizable,
Display Editor" Memo del laboratorio de IA (1979). Una
versi&oacute;n actualizada en <span class="ACRONYM">HTML</span> de
este memo, del cual estoy citado, est&aacute; disponible en
   <a href="http://www.gnu.org/software/emacs/emacs-paper.html"
   target=
   "_top">http://www.gnu.org/software/emacs/emacs-paper.html</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1225"
   href="chapter-6.html#AEN1225">[6]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "Emacs: el editor de pantalla completa"
(1987). <a href=
"http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt"
   target="_top">http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1237"
   href="chapter-6.html#AEN1237">[7]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "Emacs the Full Screen Editor" (1987).
<a href="http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt"
target=
"_top">http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1242"
   href="chapter-6.html#AEN1242">[8]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "Emacs the Full Screen Editor" (1987).
<a href="http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt"
target=
"_top">http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1246"
   href="chapter-6.html#AEN1246">[9]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "Emacs the Full Screen Editor" (1987).
<a href="http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt"
target=
"_top">http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1266"
   href="chapter-6.html#AEN1266">[10]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "Emacs the Full Screen Editor" (1987).
<a href="http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt"
target=
"_top">http://www.lysator.liu.se/history/garb/txt/87-1-emacs.txt</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1278"
   href="chapter-6.html#AEN1278">[11]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "EMACS: El extendible y configurable
editor de despliegue" Memo del laboratorio de IA (1979). Una
versi&oacute;n actualizada en <span class="ACRONYM">HTML</span> de
este memo, del cual estoy citado, est&aacute; disponible en
   <a href="http://www.gnu.org/software/emacs/emacs-paper.html"
   target=
   "_top">http://www.gnu.org/software/emacs/emacs-paper.html</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1294"
   href="chapter-6.html#AEN1294">[12]</a></td>
<td align="left" valign="top" width="95%">
<p>En una entrevista de 1996 con el magaz&iacute;n en l&iacute;nea
[<span class="CITATION">MEME</span>], Stallman cit&oacute; la venta
de Scribe como molesta, pero dud&oacute; en mencionar a Reid por su
nombre. "El problema fue que nadie censur&oacute; o castig&oacute;
al estudiante por lo que hizo", dijo Stallman, "El resultado fue
que alguna gente fue tentada para seguir su ejemplo". Ver
[<span class="CITATION">MEME</span>] 2.04. <a href=
"http://memex.org/meme2-04.html" target=
"_top">http://memex.org/meme2-04.html</a></p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1308"
   href="chapter-6.html#AEN1308">[13]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Steven Levy, [<span class="CITATION">Hackers</span>](Penguin
USA [paperback], 1984): 419.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1313"
   href="chapter-6.html#AEN1313">[14]</a></td>
<td align="left" valign="top" width="95%">
<p>See Steven Levy, [<span class="CITATION">Hackers</span>]
(Penguin USA [paperback], 1984): 419.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1323"
   href="chapter-6.html#AEN1323">[15]</a></td>
<td align="left" valign="top" width="95%">
<p>Durante la escritura de este cap&iacute;tulo, he elegido
enfocarme m&aacute;s en la significancia social de Emacs, que en su
significancia como software. Para leer m&aacute;s acerca del lado
de software, recomiendo el memo de 1979 de Stallman.
Particularmente recomiedo la secci&oacute;n titulada
"Investigaci&oacute;n a trav&eacute;s del desarrollo de
herramientas instaladas" (#SEC27). No s&oacute;lo es accesible para
el lector no t&eacute;cnico, tambi&eacute;n arroja luces de que tan
cercanas es la filosof&iacute;a pol&iacute;tica de Stallman con su
filosof&iacute;a de desarrollo de software. Una peque&ntilde;a
parte dice:</p>
<a name="AEN1325"></a>
<blockquote class="BLOCKQUOTE">
<p>EMACS no pudo haber sido alcanzado por un proceso de
dise&ntilde;o cuidadoso, porque tales procesos llegan s&oacute;lo a
metas que son visibles en el <i class="FOREIGNPHRASE">outset</i>, y
cuya deseabilidad est&aacute; establecida en la fase inicial del
<i class="FOREIGNPHRASE">outset</i>. Ni siquiera yo o cualquier
otro hubiera visualizado un editor extensible hasta que yo hice
uno, ni hubiera apreciado su valor hasta que lo hubiera
experimentado. EMACS existe porque yo me sent&iacute; libre de
hacer peque&ntilde;as mejoras en un camino cuyo final no estaba a
la vista.</p></blockquote></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="chapter-5.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="chapter-7.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">Peque&ntilde;o Charco de
Libertad</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">Una Decisi&oacute;n
Moral <span class=
"SYSTEMITEM">Dif&iacute;cil</span></td></tr></table></div>
</body>
</html>
