<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>Todo por una impresora</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="Acknowledgments" href="x33.html">
<link rel="NEXT" title="2001: La Odisea de un Hacker" href=
"chapter-2.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href="x33.html"
accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"chapter-2.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-1">Cap&iacute;tulo 1. Todo por una
impresora</a></h1>
<table border="0" width="100%" cellspacing="0" cellpadding="0"
class="EPIGRAPH">
<tr>
<td width="45%">&nbsp;</td>
<td width="45%" align="left" valign="top">
<p><i>Temo a los Griegos. A&uacute;n cuando traigan
regalos.</i></p></td></tr>
<tr>
<td width="45%">&nbsp;</td>
<td width="45%" align="right" valign="top"><i><span class=
"ATTRIBUTION">Virgilio. La Eneida</span></i></td></tr></table>
<p>La nueva impresora estaba <span class=
"SYSTEMITEM">atascada</span>, otra vez.</p>
<p>Richard M. Stallman, un miembro de la plana mayor de
programadores de software en el Laboratorio de Inteligencia
Artificial del Instituto de Tecnolog&iacute;a de Massachusetts,
descubri&oacute; la falla de la manera m&aacute;s dolorosa. Una
hora despu&eacute;s de enviar un archivo de 50 p&aacute;ginas a la
impresora l&aacute;ser, Stallman, de 27 a&ntilde;os,
interrumpi&oacute; una sesi&oacute;n productiva de trabajo para
recoger sus documentos. Cuando lleg&oacute; hasta donde estaba la
impresora, encontr&oacute; s&oacute;lo cuatro p&aacute;ginas en la
bandeja de salida de la impresora. Para hacer las cosas a&uacute;n
m&aacute;s frustrantes, las cuatro p&aacute;ginas
pertenec&iacute;an al trabajo de impresi&oacute;n de otra persona,
lo cual significaba que el trabajo de impresi&oacute;n de Stallman
y la porci&oacute;n sin terminar del trabajo de impresi&oacute;n de
algui&eacute;n m&aacute;s estaban todav&iacute;a atrapados en
alguna parte dentro de la tuber&iacute;a el&eacute;ctrica de la red
de computadores del laboratorio.</p>
<p>El tener que quedarse esperando por las m&aacute;quinas es uno
de los gajes del oficio de los programadores de software, por lo
tanto Stallman tom&oacute; su frustraci&oacute;n con cierta
tranquilidad. Adem&aacute;s la diferencia entre esperar por una
m&aacute;quina y esperar dentro de una m&aacute;quina, es
apreciable. No era la primera vez en que &eacute;l era forzado a
pararse frente a la impresora a observar las p&aacute;ginas
imprimi&eacute;ndose una tras otra. Siendo una persona que emplea
el grueso de sus d&iacute;as y sus noches mejorando la eficiencia
de las m&aacute;quinas y de los programas de software que las
controlan, Stallman sinti&oacute; una urgencia natural de abrir la
m&aacute;quina, mirarle las entra&ntilde;as, y buscar la
ra&iacute;z del problema.</p>
<p>Desafortunadamente, las destrezas de Stallman como programador
de computadoras no se extend&iacute;an al reino de la
ingenier&iacute;a mec&aacute;nica. En la medida que documentos
reci&eacute;n impresos sal&iacute;an de la m&aacute;quina, Stallman
tuvo una oportunidad de reflexionar en otras formas de solucionar
el problema del atascamiento del papel.</p>
<p>Hace cuanto tiempo que los miembros de la plana mayor del
Laboratorio de Inteligencia Artificial le hab&iacute;an dado la
bienvenida con los brazos abiertos a esta nueva impresora? Stallman
se preguntaba. La m&aacute;quina hab&iacute;a sido una
donaci&oacute;n de la Corporaci&oacute;n Xerox. Siendo un prototipo
de vanguardia, era una versi&oacute;n modificada de la popular
fotocopiadora Xerox. Solo que en lugar de sacar fotocopias, ella
depend&iacute;a de datos enviados por una red de computadoras para
convertir estos datos en documentos presentados profesionalmente.
Creada por los ingenieros del mundialmente famoso Instituto de
Investigaci&oacute;n de Palo Alto, era, visto de manera un tanto
simple, un adelanto de la revoluci&oacute;n en la impresi&oacute;n
para los computadores de escritorio que habr&iacute;a de tomarse al
resto de la industria de los computadores para los finales de esa
d&eacute;cada.</p>
<p>Llevados por una urgencia instintiva de jugar con el mejor
equipo posible, los programadores del Laboratorio de Inteligencia
Artificial prontamente integraron la nueva m&aacute;quina a la
sofisticada infraestructura computacional del laboratorio. El
resultado fue inmediatamente placentero. A diferenecia de la
antigua impresora l&aacute;ser del laboratorio, la nueva
m&aacute;quina Xerox era r&aacute;pida. Las p&aacute;ginas volaban
a una tasa de una por segundo, convirtiendo a un trabajo de
impresi&oacute;n de 20 minutos en uno de tan s&oacute;lo 2 minutos.
La nueva m&aacute;quina era tambi&eacute;n precisa. Los
c&iacute;rculos eran dibujados como c&iacute;rculos, no como
&oacute;valos. Las l&iacute;neas rectas parec&iacute;an
l&iacute;neas rectas, no ondas sinusoidales de baja amplitud.</p>
<p>Era, para todos los prop&oacute;sitos, un regalo demasiado bueno
para ser rechazado.</p>
<p>Fue, s&oacute;lo despu&eacute;s de algunas semanas de su llegada
que empezaron a hacerse evidentes las fallas de la impresora. La
principal entre todas era la susceptibilidad inherente a los
atascamientos de papel. Programadores con mente dotada para la
ingenier&iacute;a pronto entendieron la causa detr&aacute;s los
fallos. Igual que una fotocopiadora, la m&aacute;quina generalmente
requer&iacute;a de la directa supervisi&oacute;n de un operador
humano. Asumiendo que estos operadores humanos estar&iacute;an a la
mano para arreglar los atascamientos de papel, en caso de que
ocurrieran, los ingenieros de Xerox dedicaron su tiempo y sus
energ&iacute;as a solucionar otros problemas molestos. En
t&eacute;rminos ingenieriles, la diligencia del usuario estaba
incorporada en el sistema</p>
<p>Al modificar el uso de la impresora, los ingenieros de Xerox
hab&iacute;an cambiado la relaci&oacute;n usuario-m&aacute;quina en
una manera sutil pero profunda. En lugar de volver a la
m&aacute;quina un subsirviente del operador humano individual,
ellos volvieron un subsirviente a toda una poblaci&oacute;n de
operadores humanos interconectados a la red. En lugar de tener que
pararse frente a la impresora, un usuario humano en un extremo de
la red env&iacute;a su comando de impresi&oacute;n a trav&eacute;s
de una cadena de m&aacute;quinas, esperando que el contenido
deseado llegue al destino previsto y de la manera apropiada. No fue
sino hasta cuando &eacute;l fue a revisar el resultado final cuando
se di&oacute; cuenta de lo poco del contenido deseado que
hab&iacute;a logrado llegar hasta el final.</p>
<p>Stallman mismo hab&iacute;a sido de los primeros en identificar
el problema y en proponer un remedio. A&ntilde;os atras, cuando el
laboratorio todav&iacute;a usaba su antigua impresora, Stallman
hab&iacute;a resuelto un problema similar por medio del examen y
modificaci&oacute;n del programa de software que regulaba la
impresora en la m&aacute;quina PDP-11 del laboratorio. Stallman no
pudo eliminar los atascos de papel, pero pudo insertar una
instrucci&oacute;n de software que ordenaba a la PDP-11 revisar
peri&oacute;dicamente la impresora y reportar este estado de la
impresora a la PDP-10, la computadora central del laboratorio. Para
asegurar que la negligencia de ning&uacute;n usuario fuera a poner
en peligro la l&iacute;nea completa de trabajos de
impresi&oacute;n, Stallman tambi&eacute;n insert&oacute; un comando
de software que le instru&iacute;a a la PDP-10 de notificar a cada
usuario si algun trabajo de impresi&oacute;n pendiente que la
impresora estaba atascada. El aviso era simple, algo as&iacute;
como "La impresora esta atascada, por favor destrabela," y debido a
que iba dirigido a las personas con la necesidad m&aacute;s urgente
de arreglar tal problema, las posibilidades eran altas de que el
problema fuera solucionado prontamente.</p>
<p>Realizando arreglos, Stallman era evasivo pero elegante. No
arreglaba el lado mec&aacute;nico del problema, pero hacia la
siguiente mejor cosa cerrando el bucle de informaci&oacute;n entre
el usuario y la m&aacute;quina. Gracias a unas pocas l&iacute;neas
adicionales de c&oacute;digo de software, los empleados del
Laboratorio de Inteligencia Artificial lograron eliminar entre 10 y
15 minutos de tiempo perdido cada semana ejecutando un ir y venir
revisando el estado de la impresora. En t&eacute;rminos de
programaci&oacute;n, el arreglo de Stallman tom&oacute; ventaja de
la inteligencia ampliflicada de toda la red de computadores.</p>
<p>"Si ha usted le llegaba tal mensaje, usted no pod&iacute;a
asumir que alguien m&aacute;s ir&iacute;a a arreglar el problema,"
dice Stallman rememorando la l&oacute;gica. "usted ten&iacute;a que
ir tras la impresora. Un minuto o dos despu&eacute;s de que tuviera
problemas, las dos o tres personas que recibieron el mensaje
llegaban a arreglar la m&aacute;quina. De esas dos o tres personas,
uno de ellos, al menos, usualmente sabr&iacute;a c&oacute;mo
arreglar el problema."</p>
<p>Tales arreglos ingeniosos eran la marca registrada del
Laboratorio de Inteligencia Artificial y de su poblaci&oacute;n
nativa de programadores. De hecho, los mejores programadores del
Laboratorio de IA desde&ntilde;aban el t&eacute;rmino programador,
prefiriendo el t&iacute;tulo m&aacute;s coloquial de "hacker", en
su lugar. Este t&iacute;tulo cubr&iacute;a una serie de actividades
-de todo desde el creativo gozo de mejorar el software existente y
los sistemas de computadores. Impl&iacute;cito dentro del
t&iacute;tulo, sin embargo, estaba la anticuada noci&oacute;n de la
ingenuidad yanqui. Para ser un hacker, uno ten&iacute;a que aceptar
la filosof&iacute;a que la escritura de programas de software era
s&oacute;lo el comienzo. Mejorar un programa era la verdadera
prueba de las destrezas de un hacker. <a name="AEN70" href=
"#FTN.AEN70">[1]</a></p>
<p>Tal filosof&iacute;a era una raz&oacute;n central por la cual
las compa&ntilde;&iacute;as como Xerox ten&iacute;an la
pol&iacute;tica de donarles sus m&aacute;quinas y programas de
software a sitios donde t&iacute;picamente se congregaban hackers.
Si los hackers mejoraban el software, las compa&ntilde;&iacute;as
pod&iacute;an pedir prestadas estas mejoras, incorpor&aacute;ndolas
en versiones actualizadas para el mercado comercial. En
t&eacute;rminos corporativos, los hackers eran un
      <span class="SYSTEMITEM">activo comunitario
      apalancable</span>, una divisi&oacute;n auxiliar de
      investigaci&oacute;n y desarrollo disponible a un costo
      m&iacute;nimo.</p>
<p>Fue, debido a esta filosof&iacute;a de toma-y-daca que, cuando
Stallman se encontr&oacute; con ese defecto del atascamiento de
papel en la impresora l&aacute;ser, &eacute;l no entr&oacute; en
p&aacute;nico. El simplemente busc&oacute; la forma de volver a
implementar el antiguo arreglo o de "hackear" el nuevo sistema. En
el proceso de mirar el software de la impresora l&aacute;ser Xerox,
sin embargo, Stallman realiz&oacute; un descubrimiento
problem&aacute;tico. La impresora no ten&iacute;a ning&uacute;n
software, por lo menos nada que Stallman o sus colegas
programadores pudieran leer. Hasta entonces, la mayor&iacute;a de
las compa&ntilde;&iacute;as ten&iacute;an como una forma de
cortes&iacute;a el h&aacute;bito de publicar el c&oacute;digo
fuente en archivos legibles, los archivos texto que documentaba los
comandos individuales de software que le dec&iacute;an lo que
deb&iacute;a de hacer la m&aacute;quina. Xerox, en esta instancia,
hab&iacute;a provisto archivos de software en forma precompilada, o
binaria. Los programadores eran libres de abrir y examinar los
archivos si as&iacute; lo deseaban, pero a menos que fueran unos
expertos en decifrar una cadena sinf&iacute;n de unos y zeros, el
texto resultante era pura jerigonza.</p>
<p>A&uacute;n cuando Stallman sab&iacute;a bastante de
computadores, &eacute;l no era un experto en traducir archivos
binarios. Siendo un hacker, sin embargo, el ten&iacute;a otros
recursos a su disposici&oacute;n. La noci&oacute;n de compartir
informaci&oacute;n era tan central a la cultura de los hackers que
Stallman sab&iacute;a que era s&oacute;lo cuesti&oacute;n de tiempo
antes de que alg&uacute;n hacker en alg&uacute;n laboratorio
universitario o en alg&uacute;n sal&oacute;n de computadores de
alguna corporaci&oacute;n brindar&iacute;a una versi&oacute;n del
c&oacute;digo fuente de la impresora l&aacute;ser, obteniendo
as&iacute; los archivos deseados de c&oacute;digo fuente.</p>
<p>Despu&eacute;s de los primeros atascos de la impresora, Stallman
se confortaba a s&iacute; mismo con el recuerdo de una
situaci&oacute;n similar algunos a&ntilde;os antes. El laboratorio
necesitabaun programa de red para ayudar a que el PDP-11 trabajara
mas eficientemente junto con el PDP-10. Los hackers del laboratorio
estaban m&aacute;s que listos para realizar la tarea, pero
Stallman, un alumno de Harvard, se record&oacute; de un programa
similar escrito por programadores del departamento de ciencias de
la computaci&oacute;n en Harvard. El laboratorio de computadores de
Harvard usaba el mismo modelo de computadores, el PDP-10, pero con
un diferente sistema operativo. El computador del laboratorio de
Harvard tambi&eacute;n ten&iacute;a la pol&iacute;tica de requerir
que todos los programas instalados en el PDP-10 ten&iacute;an que
venir con los archivos de c&oacute;digo fuente publicados.</p>
<p>Tomando ventaja de su acceso al laboratorio de computadores de
Harvard, Stallman entr&oacute; al sistema, hizo una copia del
c&oacute;digo fuente del programa de comunicaci&oacute;n de redes,
y se lo llev&oacute; para el Laboratorio de Inteligencia
Artificial. El entonces reescribi&oacute; el c&oacute;digo fuente
para hacerlo m&aacute;s adecuado para el sistema operativo del
Laboratorio de Inteligencia Artificial. <span class=
"SYSTEMITEM">Sin problema y con poca alharaca</span>, el
Laboratorio de IA se hizo cargo de una brecha mayor en su
infrastructura de software. Stallman a&uacute;n agreg&oacute; unas
cuantas caracter&iacute;sticas que no se encontraban en el programa
original de Harvard, volviendo el programa a&uacute;n m&aacute;s
&uacute;til. "Nos las arreglamos us&aacute;ndolo durante varios
a&ntilde;os," Stallman dice.</p>
<p>Desde la perspectiva de un programador de la era de los 1970s,
la transacci&oacute;n fue el equivalente en software de una persona
que pide prestada una herramienta o una tasa de az&uacute;car al
vecino. La &uacute;nica diferencia era que al tomar prestada la
copia de software para el laboratorio de IA, Stallman no
hab&iacute;a hecho nada para privar a los hackers de Harvard del
uso de su programa original. Si acaso algo hab&iacute;an ganado los
hackers de Harvard en el proceso, debido a que Stallman
hab&iacute;a introducido caracter&iacute;sticas adicionales al
programa, caracter&iacute;sticas estas que los hackers de Harvard
eran perfectamente libres de tomar prestadas a su vez. A&uacute;n
cuando nadie en Harvard lleg&oacute; a pedir prestado el programa
modificado, Stallman recuerda a un programador de una firma privada
de ingenier&iacute;a, Bolt, Beranek &amp; Newman, que pidi&oacute;
prestado el programa y le agreg&oacute; a su vez nuevas
caracter&iacute;sticas, las cuales Stallman eventualmente
habr&iacute;a de reintegrar al archivo del c&oacute;digos fuente
propio del Laboratorio de IA.</p>
<p>"Un programa se desarrolla de la misma forma que una ciudad se
desarrolla," dice Stallman, recordando la infraestructura de
software del Laboratorio de IA. "Partes son reemplazadas o
reconstruidas. Nuevas cosas ser&aacute;n agregadas. Pero usted
siempre podr&aacute; mirar hacia cierta parte y decir, `Hmm, por el
estilo, veo que esta parte fue escrita a comienzos de los 60s y
esta otra parte fue escrita a mediado de los 1970s.'"</p>
<p>A trav&eacute;s de este simple sistema de crecimiento
intelectual, los hackers en el Laboratorio de IA y de otros sitios
construyeron creaciones robustas. En la costa occidental, lo
cient&iacute;ficos de la computaci&oacute;n en la UC de Berkeley,
que trabajaban en cooperaci&oacute;n con unos pocos ingenieros de
bajo nivel en la AT&amp;T, hab&iacute;an construido todo un sistema
operativo usando este sistema. Apodado Unix, un juego de palabras
hecho a partir de otro sistema operativo m&aacute;s antiguo y
m&aacute;s respetable acad&eacute;micamente, llamado Multics, el
sistema operativo estaba disponible para cualquier programador
dispuesto a pagar el costo de copiar el programa en una nueva cinta
magn&eacute;tica y el costo del env&iacute;o. No todo programador
que participaba de esta cultura se describ&iacute;a a si mismo como
un hacker, pero muchos de ellos compart&iacute;an los sentimientos
de Richard M. Stallman. Si un programa o una mejora al software era
lo suficientemente bueno como para resolver sus problemas, entonces
era lo suficientemente bueno como para resolver los problemas de
alguien m&aacute;s. Por qu&eacute; no compartirlo, siguiendo un
simple deseo de tener un buen karma?</p>
<p>El hecho que Xerox se hubiera negado a compartir sus archivos de
c&oacute;digo fuente, al comienzo pareci&oacute; como una molestia
menor. Al empe&ntilde;arse en buscar una copia de los archivos de
c&oacute;digo fuente, Stallman dice que &eacute;l no se
preocup&oacute; por siquiera contactar a Xerox. "Ellos ya nos
hab&iacute;an dado la impresora l&aacute;ser," Stallman dice. "Por
qu&eacute; habr&iacute;a yo de molestarlos con algo
m&aacute;s?"</p>
<p>Despu&eacute;s de que hubo pasado un tiempo y los deseados
archivos no hubieran aparecido, a Stallman le comenzaron a entrar
sospechas. El a&ntilde;o anterior, Stallman hab&iacute;a
experimentado un estallido en c&oacute;lera con un estudiante de
doctorado en laUniversidad de Carnegie Mellon. El estudiante, Reid,
era el autor de un programa &uacute;til de formateo de texto
apodado Scribe. Uno de los primeros programas que le di&oacute; al
usuario el poder de definir fuentes y <span class=
"SYSTEMITEM">estilos de tipo</span> cuando se enviaba un documento
a trav&eacute;s de una red de computadores. El programa era un
precursor temprano de HTML, la lingua franca de la World Wide Web.
En 1979, Reid tom&oacute; la decisi&oacute;n de vender Scribe a una
compa&ntilde;&iacute;a del &aacute;rea de Pittsburgh llamada
Unilogic. Finalizando su carrera como estudiante graduado, Reid
dice que &eacute;l simplemente estaba buscando una forma para
entregar el programa a un conjunto de desarrolladores que se fueran
a encargar de &eacute;l y as&iacute; evitar que el programa se
deslizara al dominio p&uacute;blico. Para endulzar el trato, Reed
tambi&eacute;n acord&oacute; insertar un conjunto de funciones
dependientes del tiempo - "bombas de tiempo" en la jerga de
programadores- este era un dispositivo que desactivaba las
versiones copiadas libremente despu&eacute;s de un per&iacute;odo
de expiraci&oacute;n de 90 d&iacute;as. Para evitar la
desactivaci&oacute;n, los usuarios hab&iacute;an de pagar a la
compa&ntilde;&iacute;a de software, la cual generaba un
c&oacute;digo que anulaba la bomba de tiempo.</p>
<p>Para Reid, el trato era de ganador-ganador. Scribe no
ca&iacute;a en el dominio p&uacute;blico y Unilogic se
resarc&iacute;a de su inversi&oacute;n. Para Stallman, era una
traici&oacute;n a la &eacute;tica del programador, pura y simple.
En lugar de honrar la noci&oacute;n de compartir, Reid hab&iacute;a
insertado una forma en que las compa&ntilde;&iacute;as obligaban a
los programadores a pagar por el acceso a la
informaci&oacute;n.</p>
<p>Las semanas pasaron y sus intentos para rastrear el
c&oacute;digo fuente de la impresora l&aacute;ser encontraron un
muro de ladrillos, entonces Stallman comenz&oacute; a sentir que se
llevaba a cabo un escenario similar de
dinero-a-cambio-de-c&oacute;digo. Antes de que Stallman pudiera
hacer o decir nada al respecto,sin embargo, buenas noticias
finalmente gotearon a trav&eacute;s del <span class=
"SYSTEMITEM">vi&ntilde;edo del programador</span> . Le lleg&oacute;
la voz que un cient&iacute;fico del departamento de Ciencias de la
Computaci&oacute;n de la Universidad de Carnegie Mellon acababa de
renunciar a su empleo en el Centro de Investigaci&oacute;n de Palo
Alto de Xerox. No s&oacute;lo hab&iacute;a este cient&iacute;fico
trabajado en la impresora l&aacute;ser en cuesti&oacute;n, pero
seg&uacute;n el rumor, &eacute;l todav&iacute;a estaba trabajando
en ella como parte de sus tareas de investigaci&oacute;n en el
Carnegie Mellon.</p>
<p>Poniendo a un lado su sospecha inicial, Stallman se hizo el
firme prop&oacute;sito de buscar a la persona en cuesti&oacute;n
durante su pr&oacute;xima visita al campus de Carnegie Mellon.</p>
<p>No tuvo que esperar mucho tiempo. El Carnegie Mellon
tambi&eacute;n ten&iacute;a un laboratorio especializado en
investigaci&oacute;n de la inteligencia artificial, y en pocos
meses, Stallman tuvo una raz&oacute;n relacionada con su trabajo
para visitar al campus de Carnegie Mellon. Durante aquella visita,
se asegur&oacute; de hacer una parada en el departamento de
ciencias de la computaci&oacute;n. Los empleados del departamento
lo encaminaron a la oficina del miembro de la facultad que lideraba
el proyecto Xerox. Cuando Stallman lleg&oacute; a la oficina,
encontr&oacute; al profesor trabajando ah&iacute; mismo.</p>
<p><span class="SYSTEMITEM">En un estilo cl&aacute;sico de
ingeniero a ingeniero</span> , la conversaci&oacute;n fue cordial
pero <span class="SYSTEMITEM">directa</span>. Despu&eacute;s de
presentarse brevemente como un visitante del MIT, Stallman le
solicit&oacute; una copia del c&oacute;digo fuente para la
impresora l&aacute;ser para poder portarla al PDP-11. Para su
sorpresa, el profesor se neg&oacute; a cumplir con su
solicitud.</p>
<p>"El me dijo que &eacute;l hab&iacute;a prometido el no
entregarme ninguna copia," Stallman dice.</p>
<p>La memoria es una cosa graciosa. Veinte a&ntilde;os
despu&eacute;s del suceso, la cinta mental de Stallman acerca de
esta historia presenta notoriamente espacios en blanco. No
s&oacute;lo &eacute;l no recuerda la raz&oacute;n que motiv&oacute;
su viaje ni siquiera la &eacute;poca del a&ntilde;o durante la cual
realiz&oacute; tal viaje, el tampoco tiene ning&uacute;n recuerdo
acerca del profesor o estudiante de doctorado que le sirvi&oacute;
de interlocutor. Seg&uacute;n Reid, la persona m&aacute;s probable
que le neg&oacute; el c&oacute;digo a Stallman es Robert Sproull,
un antiguo investigador del Centro de Investigaciones de Palo Alto
de Xerox y actual director de Laboratorios Sun, una divisi&oacute;n
de investigaci&oacute;n del conglomerado de tecnolog&iacute;a de
los computadores de Sun Microsystems. Durante los a&ntilde;os de
1970s, Sproull hab&iacute;a sido el desarrollador primario del
software de la impresora l&aacute;ser en cuesti&oacute;n mientras
estaba en el Centro de Investigaciones de Palo Alto de Xerox.
Alrededor de 1980, Sproull tom&oacute; una posici&oacute;n de
investigaci&oacute;n en la facultad en el Carnegie Mellon donde el
continu&oacute; su trabajo en la impresora l&aacute;ser entre otros
proyectos.</p>
<p>El c&oacute;digo que Stallman estaba solicitando era un
c&oacute;digo <span class="SYSTEMITEM">de &uacute;ltima
tecnolog&iacute;a</span> que Sproull hab&iacute;a escrito
m&aacute;s o menos el a&ntilde;o anterior al de su llegada a
Carnegie Mellon," recuerda Reid. "sospecho que Sproull llevaba
menos de un mes en Carnegie Mellon cuando la solicitud de Stallman
lleg&oacute;."</p>
<p>Cuando se le pregunta directamente acerca de esta solicitud, sin
embargo, Sproull no afirma ni niega nada. "No puedo hacer un
comentario basado en hechos reales," escribe Sproull a
trav&eacute;s del correo electr&oacute;nico. "No tengo
absolutamente ninguna memoria acerca del incidente."</p>
<p>Con ambos participantes de la corta conversaci&oacute;n luchando
por recordar detalles claves -incluyendo la de si la
conversaci&oacute;n siquiera tuvo lugar- es dif&iacute;cil calibrar
la rudeza de la negativa de Sproull, al menos como la recuerda
Stallman. Cuando se ha dirigido a audiencias, Stallman ha hecho
repetidas referencias al incidente, notando que la
indisposici&oacute;n de Sproull a entregar el c&oacute;digo fuente
provino de un <em>acuerdo de no revelar</em> (<em>nondisclosure
agreement</em>), un acuerdo contractual entre Sproull y la
Corporaci&oacute;n Xerox d&aacute;ndole a Sproull, o cualquier otro
signatario, acceso al c&oacute;digo fuente del software a cambio de
una promesa de mantenerlo en secreto. Actualmente este es un
&iacute;tem est&aacute;ndar en el negocio de la industria de
software, pero el acuerdo de no revelar, o NDA por sus siglas en
ingl&eacute;s, era un desarrollo nuevo en esa &eacute;poca, un
reflejo de tanto el valor comercial de la impresora l&aacute;ser de
Xerox y de la informaci&oacute;n requerida para manejarla. "Xerox
estaba en esa &eacute;poca tratando de hacer de la impresora
l&aacute;ser un producto comercial," recuerda Reid. "Habr&iacute;a
sido una locura el entregar el c&oacute;digo fuente".</p>
<p>Para Stallman, el darse cuenta que Xerox hab&iacute;a forzado a
su colega programador de participar en este reci&eacute;n inventado
sistema de secreto obligatorio le tom&oacute; alg&uacute;n tiempo
para <span class="SYSTEMITEM">digerirlo</span>. Al comienzo, todo
en lo que pudo enfocarse fue en la naturaleza personal de la
negativa. Siendo una persona que se sent&iacute;a extra&ntilde;o y
fuera de sincron&iacute;a en la mayor&iacute;a de encuentros cara a
cara, el intento de Stallman de presentarse sin anunciarse ante un
colega programador era un intento por demostrar buena vecindad.
Ahora que la petici&oacute;n hab&iacute;a sido denegada, se
sent&iacute;a como si le hubiera cometido una equivocaci&oacute;n
mayor. "Yo estaba tan furioso, que no encontraba la manera de
expresarlo. As&iacute; que lo que hice fue retirarme del lugar sin
decir ninguna otra palabra," Stallman recuerda. "Yo pude haber
tirado la puerta. Qui&eacute;n sabe? Todo lo que recuerdo es que
quer&iacute;a irme de ah&iacute; inmediatamente."</p>
<p>Veinte a&ntilde;os despu&eacute;s del hecho, la rabia
todav&iacute;a subsiste, tanto como para que Stallman haya elevado
el evento equipar&aacute;ndolo a un punto de quiebre primordial.
Dentro de los siguientes meses, una serie de eventos habr&iacute;an
de sobrevenir tanto para Stallman como para la comunidad de hackers
del laboratorio de IA que habr&iacute;an de hacer parecer a los 30
segundos llenos de tensi&oacute;n en una remota oficina de Carnegie
Mellon como triviales en comparaci&oacute;n. No obstante, cuando
llega el momento de ordenar los eventos que habr&iacute;an de
transformar a Stallman, de ser un hacker solitario,
instinctivamente sospechoso de la autoridad centralizada, en un
activista cruzado que aplica las nociones de libertad, igualdad, y
fraternidad al mundo del desarrollo del software, Stallman
singulariza de manera especial el encuentro de Carnegie Mellon.</p>
<p>"Me alent&oacute; el pensar acerca de algo en lo cual yo
hab&iacute;a estado pensando," dice Stallman. "Yo ya ten&iacute;a
la idea que el software deb&iacute;a de ser compatido, pero no
estaba seguro acerca de como pensar en eso. Mis pensamientos no
estaban tan claros ni organizados hasta el punto en que pudiera
expresarlos en una manera concisa al resto del mundo."</p>
<p>A&uacute;n cuando otros eventos previos hab&iacute;an depertado
la ira de Stallman, &eacute;l dice que no fue sino hasta cuando
sucedi&oacute; el encuentro de Carnegie Mellon que &eacute;l
tom&oacute; conciencia que los eventos estaban comenzando a
entrometerse en una cultura que &eacute;l consideraba desde hace
mucho tiempo como sacrosanta. Siendo un programador de &eacute;lite
en una de las instituciones &eacute;lite del mundo, Stallman
hab&iacute;a perfectamente ignorado los compromisos y transacciones
que hab&iacute;an hecho sus colegas programadores, esto en la
medida que estas no hab&iacute;an interferido con su propio
trabajo. Hasta la llegada de la impresora l&aacute;ser de Xerox,
Stallman <span class="SYSTEMITEM">hab&iacute;a estado satisfecho
mirando hacia abajo a las m&aacute;quinas y programas que otros
usuarios sombr&iacute;amente toleraban</span>. En la rara
ocasi&oacute;n en que tal programa cre&oacute; una brecha en las
paredes del laboratorio de IA-cuando el laboratorio
reemplaz&oacute; su venerable sistema operativo Incompatible de
Tiempo Compartido (<i class="FOREIGNPHRASE">Incompatible Time
Sharing</i> - ITS) con una variante comercial, la TOPS 20, por
ejemplo- Stallman y sus colegas hackers hab&iacute;an gozado de la
libertad de reescribir, reconstruir y renombrar el software
seg&uacute;n el gusto personal.</p>
<p>Ahora que la impresora l&aacute;ser se hab&iacute;a insinuado en
la red del Laboratorio de IA, sin embargo, algo hab&iacute;a
cambiado. La m&aacute;quina funcionaba bien, salvo ocasionales
atascos de papel, pero la habilidad para modificar seg&uacute;n el
gusto personal hab&iacute;a desaparecido. Desde el viejo punto de
vista de toda la industria de software, el caso de la impresora era
como un llamado para despertarse. El software se hab&iacute;a
convertido en una posesi&oacute;n tan valiosa que las
compa&ntilde;&iacute;as dejaron de sentir la necesidad de publicar
el c&oacute;digo fuente, especialmente cuando la publicaci&oacute;n
significaba entregar a potenciales competidores la oportunidad de
duplicar algo de manera econ&oacute;mica. Desde el punto de vista
de Stallman, la impresora era una caballo de Troya. Despu&eacute;s
de una d&eacute;cada de fracaso, el software apropiado privadamente
-los futuros hackers usar&iacute;an el t&eacute;rmino software "
propietario" -hab&iacute;a ganado una posici&oacute;n firme dentro
del Laboratorio de IA a trav&eacute;s uno de los m&eacute;todos
m&aacute;s solapados. Hab&iacute;a llegado disfrazado de
regalo.</p>
<p>El hecho que Xerox hubiera ofrecido a algunos programadores
acceso a regalos adicionales a cambio del secreto, tambi&eacute;n
era irritante, pero a Stallman <span class="SYSTEMITEM">le
cost&oacute; trabajo</span> notar que, si le hubiera sido
presentada tal transacci&oacute;n quid pro quo a una edad
m&aacute;s joven, el probablemente hubiera aceptado la oferta de la
Corporaci&oacute;n Xerox. La torpeza del encuentro de Carnegie
Mellon, sin embargo, tuvo un efecto afirmador sobre la propia
lasitud moral de Stallman. No s&oacute;lo &eacute;ste le di&oacute;
la necesaria rabia para ver todas las futuras <span class=
"SYSTEMITEM">s&uacute;plicas</span> con sospecha, tambi&eacute;n lo
forz&oacute; a plantearse la inc&oacute;moda pregunta: qu&eacute;
pasar&iacute;a si un colega hacker pasa un d&iacute;a por la
oficina de Stallman y es el deber de Stallman el de rehusarse a
responderle a la solicitud del hacker de entregar un c&oacute;digo
fuente?</p>
<p>"Fue mi primer encuentro con un acuerdo de no revelar (NDA) , e
inmediatamente me ense&ntilde;o que los acuerdos de no revelar
ten&iacute;an v&iacute;ctimas," dice Stallman, firmemente. "En este
caso yo fui una v&iacute;ctima. Mi laboratorio y yo fuimos
v&iacute;ctimas."</p>
<p>Fue una lecci&oacute;n que Stallman habr&iacute;a de cargar con
&eacute;l a trav&eacute;s de los tumultuosos a&ntilde;os de 1980s,
una d&eacute;cada durante la cual muchos de sus colegas de MIT
habr&iacute;an de partir del Laboratorio de AI y habr&iacute;an de
firmar muchos acuerdos de no revelar (NDA) por su propia cuenta.
Debido a que muchos de los acuerdos de no revelar (NDAs) tienen
fechas de expiraci&oacute;n, pocos hackers de los que los firmaron
ven poca necesidad de introspecci&oacute;n personal. Tarde o
temprano, ellos razonaron, el software habr&iacute;a de volverse de
p&uacute;blico conocimiento. Mientras tanto, el prometer de
mantener el software en secreto durante sus primeras etapas de
desarrollo era parte de un acuerdo de compromiso que
permit&iacute;a a los hackers el trabajar en los mejores proyectos.
Para Stallman, sin embargo, era su primer paso hacia una pendiente
resbaladiza.</p>
<p>"Cuando algui&eacute;n me invita a que traicione a todos mis
colegas de esa manera, me recuerdo de lo furioso que me puse cuando
algui&eacute;n m&aacute;s me hab&iacute;a hecho eso a mi y a mi
propio laboratorio," Stallman dice. "Entonces yo dije, `Muchas
gracias por ofrecerme este lindo paquete de software pero no puedo
aceptarlo en las condiciones que usted me lo ofrece, por lo tanto
voy a renunciar a &eacute;l.'"</p>
<p>Como Stallman habr&iacute;a de aprender r&aacute;pidamente, el
rehusar tales peticiones involucraban algo m&aacute;s que un
sacrificio personal. Involucraba el segregarse a si mismo de sus
colegas hackers los cuales, aunque compart&iacute;an un desagrado
similar por el secreto, tend&iacute;an a expresar este disgusto de
una manera moralmente m&aacute;s flexible. No fue mucho antes que
Stallman, cuando se convert&iacute;a cada vez m&aacute;s en un
paria a&uacute;n dentro del laboratorio de Inteligencia Artificial,
que comenz&oacute; a autocalificarse como "el &uacute;ltimo hacker
verdadero", aisl&aacute;ndose m&aacute;s y m&aacute;s del mercado
dominado por el software propietario. Rehus&aacute;ndole a
algui&eacute;n m&aacute;s el c&oacute;digo fuente, Stallman
decidi&oacute;, era no s&oacute;lo una traici&oacute;n a la
misi&oacute;n cient&iacute;fica que hab&iacute;a nutrido el
desarrollo del software desde el final de la Segunda Guerra
Mundial, era tambi&eacute;n una violaci&oacute;n de la Regla
Dorada, la moraleja que dictaba el no hacer a los dem&aacute;s lo
que no quer&iacute;as que los otros te hicieran.</p>
<p>Por lo tanto, la importancia de la impresora l&aacute;ser y el
encuentro que surgi&oacute; de ah&iacute;. Sin el, Stallman dice,
su vida habr&iacute;a podido seguir un camino m&aacute;s ordinario,
uno que balanceara las riquezas de un programador comercial con la
frustraci&oacute;n final de pasarse la vida escribiendo
c&oacute;digo de software invisible. No habr&iacute;a habido un
sentido de claridad, ninguna urgencia de hacerse cargo de un
problema que otros no estuvieran ya haci&eacute;ndolo. De manera
m&aacute;s importante a&uacute;n, no habr&iacute;a una ira
originada en razones virtuosas, una emoci&oacute;n que, como pronto
veremos, ha empujado la carrera de Stallman de forma tan segura
como cualquier ideolog&iacute;a pol&iacute;tica o creencia
&eacute;tica.</p>
<p>"Desde d&iacute;a en adelante, decid&iacute; que esto era algo
en lo cual yo nunca participar&iacute;a," dice Stallman, haciendo
alusi&oacute;n a la pr&aacute;ctica de intercambiar la libertad
personal a cambio de la conveniencia personal -la
descripci&oacute;n de Stallman del acuerdo de no revelar -NDA
-as&iacute; como toda la cultura que alentaba ese trato de rasgos
tan sospechosos desde un punto de vista &eacute;tico, en primer
lugar. "Decid&iacute; nunca convertir a otras personas en
v&iacute;ctimas as&iacute; como yo hab&iacute;a sido una
v&iacute;ctima."</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN70"
   href="chapter-1.html#AEN70">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>Para m&aacute;s sobre el t&eacute;rmino "hacker," <a href=
"appendix-b.html">Ap&eacute;ndice B</a>.</p></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="x33.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="chapter-2.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">Acknowledgments</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">2001: La Odisea de un
Hacker</td></tr></table></div>
</body>
</html>
