<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta content=
"HTML Tidy for Linux/x86 (vers 1st December 2002), see www.w3.org"
name="generator">
<title>Peque&ntilde;o Charco de Libertad</title>
<meta name="GENERATOR" content=
"Modular DocBook HTML Stylesheet Version 1.76b+">
<link rel="HOME" title="Libre como en Libertad" href="index.html">
<link rel="PREVIOUS" title="Impeach God" href="chapter-4.html">
<link rel="NEXT" title="La comuna de Emacs" href="chapter-6.html">
<link rel="STYLESHEET" type="text/css" href="base.css">
</head>
<body class="CHAPTER" bgcolor="#FFFFFF" text="#000000" link=
"#0000FF" vlink="#840084" alink="#0000FF">
<div class="NAVHEADER">
<table summary="Header navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<th colspan="3" align="center">Libre como en Libertad:</th></tr>
<tr>
<td width="10%" align="left" valign="bottom"><a href=
"chapter-4.html" accesskey="P">Anterior</a></td>
<td width="80%" align="center" valign="bottom"></td>
<td width="10%" align="right" valign="bottom"><a href=
"chapter-6.html" accesskey="N">Siguiente</a></td></tr></table>
<hr align="left" width="100%"></div>
<div class="CHAPTER">
<h1><a name="CHAPTER-5">Cap&iacute;tulo 5. Peque&ntilde;o Charco de
Libertad</a></h1>
<p>Preg&uacute;ntele a cualquiera que haya permanecido m&aacute;s
de un minuto en presencia de Richard Stallman y obtendra los mismos
comentarios: olv&iacute;dese del cabello largo. Olv&iacute;dese del
comportamiento extravagante. Lo primero que se nota es la mirada,
prolongada y penetrante. Con una sola mirada a los ojos verdes de
Stallman, usted sabe que se encuentra ante un verdadero
creyente.</p>
<p>Calificar a la mirada de Stallman como intensa es subestimarla.
Los ojos de Stallman no solo miran hac&iacute;a usted; miran a
trav&eacute;s de usted. Incluso cuando sus propios ojos
moment&aacute;neamente cambian de direcci&oacute;n, por simple
cortes&iacute;a, los ojos de Stallman permanecen bloqueados,
ardiendo en el lado de su cabeza como rayos de fotones gemelos.</p>
<p>Tal vez sea por eso que muchos escritores, al describir a
Stallman, tienden a buscar el &aacute;ngulo religioso. En un
art&iacute;culo de 1998 en Salon.com, titulado "El Santo del
Software Libre", Andrew Leonard describe los ojos de Stallman
"irradiando el poder de un profeta del Antiguo Testamento".
   <a name="AEN803" href="#FTN.AEN803">[1]</a> Un art&iacute;culo
   de 1999 en la revista [<span class="CITATION">Wired</span>]
   describe la barba de Stallman como "similar a la de
   Rasput&iacute;n", <a name="AEN808" href="#FTN.AEN808">[2]</a>
   mientras que un p&eacute;rfil elaborado por el [<span class=
   "CITATION"><i class="FOREIGNPHRASE">London Guardian</i></span>]
   describe la sonrisa de Stallman como la de "un disc&iacute;pulo
   buscando a Jes&uacute;s". <a name="AEN815" href=
   "#FTN.AEN815">[3]</a></p>
<p>Todas estas analog&iacute;as sirven a un prop&oacute;sito pero
terminan siendo insuficientes. Fallan porqu&eacute; no toman en
cuenta el lado vulnerable en la personalidad de Stallman. Observe
la mirada de Stallman por un periodo prolongado de tiempo y
comenzar&aacute; a notar un cambio sutil. Lo que parece en
principio un intento de intimidar o hipnotizar se revela a si mismo
al cabo de una segunda y una tercera observaci&oacute;n como un
intento fallido para entablar y mantener contacto. Si, como
Stallman mismo ha sospechado a veces, su personalidad es el fruto
del autismo, o S&iacute;ndrome de Asperger, sus ojos con seguridad
confirman el diagn&oacute;stico. Incluso cuando se encuentran en el
nivel m&aacute;s alto de intensidad, tienen una tendencia a
volverse nublados y distantes, como los ojos de un animal herido
prepar&aacute;ndose para rendirse ante el fantasma.</p>
<p>Mi primer encuentro con la legendaria mirada de Stallman se
remonta a la Convenci&oacute;n y Exposici&oacute;n Linuxworld en
San Jos&eacute;, California, en 1999. Llamada una
      <span class="SYSTEMITEM">"fiesta de lanzamiento"</span> para
      la comunidad de software de Linux, la convenci&oacute;n
      tambi&eacute;n es conocida por haber sido el evento que
      reintroduj&oacute; a Stallman a los medios de
      comunicaci&oacute;n. Decidido a obtener su parte del
      cr&eacute;dito, Stallman utiliz&oacute; el evento para
      inducir tanto a los espectadores como a los reporteros, en la
      historia del Proyecto GNU y de sus objetivos
      pol&iacute;ticos.</p>
<p>C&oacute;mo un periodista enviado a cubrir el evento,
recib&iacute; mi propio tutorial de Stallman durante una
conferencia de prensa anunciando el lanzamiento de GNOME 1.0, una
interfaz gr&aacute;fica de usuario hecha con Software Libre.
Inadvertidamente, toqu&eacute; una gran cantidad de fibras
sensibles cuando le hice la primera pregunta a Stallman mismo:
&iquest;Piensa usted que la madurez de GNOME afectar&aacute; la
popularidad comercial del Sistema Operativo Linux?</p>
<p>"Le pido que por favor deje de llamar al sistema operativo
Linux", responde Stallman, sus ojos inmediatamente fij&aacute;ndose
en los mios. "El kernel de Linux es solamente una peque&ntilde;a
parte del sistema operativo. Muchos de los programas de software
que constituyen el sistema operativo que usted llama Linux no
fueron desarrollados por Linus Torvalds en absoluto. Fueron creados
por voluntarios del Proyecto GNU, que ofrecieron su propio tiempo
para que los usuarios tuvieran un sistema operativo libre como el
que tenemos hoy. No reconocer la contribuci&oacute;n de esos
programadores es descort&eacute;s y una tergiversaci&oacute;n de la
historia. Por eso es que les pido que cuando se refieran al sistema
operativo, por favor lo llamen con el nombre correcto,
GNU/Linux."</p>
<p>Anotando las palabras en mi cuaderno de reportero, noto un
misterioso silencio en la congestionada sala. Cuando finalmente
miro hac&iacute;a adelante, encuentro los ojos de Stallman
esper&aacute;ndome, sin parpadear. T&iacute;midamente, un segundo
periodista hace una pregunta, asegur&aacute;ndose de usar del
t&eacute;rmino "GNU/Linux" en lugar de Linux. Miguel de Icaza,
l&iacute;der del proyecto GNOME, responde a la pregunta. No es sino
hasta la mitad de la respuesta de Icaza que los ojos de Stallman
finalmente dejan de fijarse en los mios. En el momento en que lo
hacen, un leve temblor recorre mi espalda. Cuando Stallman comienza
a reprender a otro reportero por un error de dicci&oacute;n siento
una culpable pizca de alivio. Por lo menos no esta
mir&aacute;ndome, me digo a mi mismo.</p>
<p>Para Stallman, aquellos momentos cara a cara cumplir&iacute;an
su cometido. Para el momento en que la primera conferencia de
LinuxWorld termina, la mayor&iacute;a de periodistas han aprendido
a no usar el t&eacute;rmino Linux en su presencia, y wired.com esta
realizando una historia en la que compara a Stallman con un
revolucionario pre Stalinista borrado de los libros de historia por
hackers y empresarios reacios a aceptar los objetivos excesivamente
pol&iacute;ticos del proyecto GNU. <a name="AEN853" href=
"#FTN.AEN853">[4]</a> Otros art&iacute;culos siguen a este, y
aunque muy pocos periodistas llaman al sistema operativo GNU/Linux
en el papel, la mayor&iacute;a se apresuran a dar cr&eacute;dito a
Stallman por lanzar la idea de construir un sistema operativo libre
quince a&ntilde;os antes.</p>
<p>No me encontrar&eacute; de nuevo con Stallman sino hasta 17
meses despu&eacute;s de estos eventos. Durante ese tiempo, Stallman
volver&aacute; de nuevo a <i class="FOREIGNPHRASE">Silicon
Valley</i> una vez m&aacute;s para el LinuxWorld de 1999. A pesar
de no estar invitado como orador, Stallman a&uacute;n se las
arregla para ser el autor del "comentario del evento". En el
momento de aceptar el Premio Linus Torvalds al Servicio Comunitario
--un premio bautizado en honor al creador de Linux -- en
representaci&oacute;n de la <i class="FOREIGNPHRASE">Free Software
Foundation</i>, Stallman dice, "Darle el Premio Linus Torvalds a la
Free Software Foundation es un poco como darle el premio Han Solo a
la Alianza Rebelde."</p>
<p>Esta vez, sin embargo, los comentarios no hacen mucho
esc&aacute;ndalo en los medios. En la mitad de la semana Red Hat,
Inc. un prominente vendedor de GNU/Linux, sale a la bolsa. Las
noticias simplemente confirman lo que muchos reporteros, como yo,
ya sospech&aacute;bamos: "Linux" se ha convertido en una palabra de
moda en Wall Street, como "e-commerce" y "punto com". Con el
mercado accionario aproxim&aacute;ndose al cambio de milenio como
una hip&eacute;rbola acerc&aacute;ndose a su as&iacute;ntota
vertical, todo lo que se habla de software libre o c&oacute;digo
fuente abierto como un fen&oacute;meno pol&iacute;tico es dejado a
un lado.</p>
<p>Tal vez es por eso que cuando LinuxWorld contin&uacute;a sus dos
primeras versiones con un tercer LinuxWorld en agosto del 2000,
Stallman esta notablemente ausente.</p>
<p>Mi segundo encuentro con Stallman y su mirada de marca
registrada ocurre poco despu&eacute;s del tercer LinuxWorld.
Enterado de que Stallman iba a estar en Silicon Valley,
arregl&eacute; una entrevista a la hora del almuerzo en Palo Alto,
California. El lugar de encuentro parece ir&oacute;nico, no
s&oacute;lo por la reciente no asistencia de Stallman sino por el
ambiente en general. Adem&aacute;s de Redmond, Washington, muy
pocas ciudades ofrecen un homenaje m&aacute;s directo al valor
econ&oacute;mico del software propietario. Curioso por saber como
Stallman, un hombre que ha empleado sus mejores a&ntilde;os
batallando contra nuestra predilecci&oacute;n cultural hac&iacute;a
la avaricia y el egoismo, se comporta en una ciudad donde incluso
las habitaciones del tama&ntilde;o de un garaje tienen precios del
orden de medio mill&oacute;n de d&oacute;lares, conduzco hasta
all&iacute; desde Oakland.</p>
<p>Sigo las direcciones que Stallman me ha dado, hasta que
lleg&oacute; al centro de operaciones de Art.net, una "colectividad
de artistas virtuales" sin &aacute;nimo de lucro. Localizado en una
casa cubierta por arbustos en la esquina norte de la ciudad, las
oficinas de Art.net se encuentran refrescantemente
      <span class="SYSTEMITEM">descuidadas</span>De repente, la
      idea de Stallman <span class="SYSTEMITEM">acechando</span> en
      el coraz&oacute;n de <i class="FOREIGNPHRASE">Silicon
      Valley</i> no parece tan extra&ntilde;a despu&eacute;s de
      todo.</p>
<p>Encuentro a Stallman sentado en un cuarto oscuro, tecleando en
su computador port&aacute;til gris. El voltea hac&iacute;a mi en el
momento en que entro al cuarto, entreg&aacute;ndome de un golpe
todo el poder de su mirada de 200 vatios. Cuando me ofrece un
reconfortante "Hola", yo ofrezco un saludo de vuelta. Antes de que
las palabras salgan de mi boca, sus ojos ya han vuelto a la
pantalla de su port&aacute;til.</p>
<p>"Estoy terminando un art&iacute;culo acerca del esp&iacute;ritu
del hacking", dice Stallman, mientras sus dedos contin&uacute;an
tecleando. "Mire."</p>
<p>Yo observo. El cuarto esta pobremente iluminado, y el texto
aparece como letras blancas-verdosas sobre un fondo negro, un
esquema de colores opuesto a aquel utilizado por la mayor&iacute;a
de procesadores de palabras, por lo que mis ojos necesitan un
momento para ajustarse. Cuando lo hacen, me encuentro a mi mismo
leyendo el relato de Stallman de una comida reciente en un
restaurante Coreano. Antes de la comida Stallman hace un
descubrimiento interesante: la persona encargada de arreglar la
mesa ha dejado seis palilos, en lugar de los acostumbrados dos en
el puesto de Stallman. La mayor&iacute;a de comensales de un
restaurante habr&iacute;an ignorado los pares sobrantes, Stallman
lo toma como un reto: encontrar una manera de usar los seis
palillos al tiempo. Como muchos hacks de software la
soluci&oacute;n es a la vez inteligente y tonta. De ah&iacute; la
decisi&oacute;n de Stallman de usar la an&eacute;cdota como una
ilustraci&oacute;n.</p>
<p>A medida que leo la historia, siento a Stallman
observ&aacute;ndome atento. Yo miro de reojo y observo una media
sonrisa en su cara, un gesto de orgullo infantil. Cuando alabo el
ensayo, mi comentario merece simplemente un leve arqueo de sus
cejas.</p>
<p>"Estar&eacute; listo para salir en un momento", dice.</p>
<p>Stallman vuelve a escribir en su port&aacute;til. Este es gris y
cuadrado, no como los elegantes port&aacute;tiles de &uacute;ltima
moda, preferidos entre los programadores que asistieron a
LinuxWorld. Encima del teclado se encuentra un teclado m&aacute;s
peque&ntilde;o y liviano, un homenaje a las envejecidas manos de
Stallman. A finales de los a&ntilde;os ochenta, cuando Stallman
estaba trabajando en semanas de 70 y 80 horas, escribiendo las
primeras herramientas y programas de software libre para el
proyecto GNU, el dolor en sus manos se hizo tan insoportable que se
vi&oacute; obligado a contratar un digitador. Hoy en d&iacute;a,
Stallman usa un teclado cuyas teclas requieren menos presi&oacute;n
que las de un teclado t&iacute;pico.</p>
<p>Stallman tiende a bloquear todos los est&iacute;mulos externos
mientras se encuentra trabajando. Al ver sus ojos fijarse en la
pantalla y sus dedos bailar, r&aacute;pidamente se ve la imagen de
dos amigos involucrados en una profunda conversaci&oacute;n.</p>
<p>La sesi&oacute;n termina con un par de teclazos fuertes y el
lento proceso de desarmar el port&aacute;til.</p>
<p>"&iquest;Listo para almorzar?" Pregunta Stallman.</p>
<p>Caminamos hac&iacute;a mi autom&oacute;vil. Aduciendo una
lesi&oacute;n de tobillo, Stallman cojea lentamente. Stallman culpa
a la lesi&oacute;n de un tend&oacute;n de su pie izquierdo. La
lesi&oacute;n tiene tres a&ntilde;os y se ha vuelto tan grave que
Stallman, un fan&aacute;tico entusiasta de las dazas
folcl&oacute;ricas, se ha visto obligado a dejar todas las
actividades de baile. "Amo la danza folcl&oacute;rica como parte de
m&iacute;", lamenta Stallman. "No ser capaz de bailar ha sido una
tragedia para m&iacute;."</p>
<p>El cuerpo de Stallman permanece como testigo de esta tragedia.
La falta de ejercicio ha dejado a Stallman con las mejillas
infladas y una barriga que era mucho menos visible hace un
a&ntilde;o. Uno se da cuenta de que la subida de peso ha sido
dram&aacute;tica ya que, cuando Stallman camina, arquea su columna
como una mujer embarazada tratando de acomodar una carga otrora
desconocida.</p>
<p>La caminata es demorada a&uacute;n mas por el deseo de Stallman
de pararse a oler las rosas, literalmente. Al encontrar un
ramillete particularmente hermoso, cosquillea los p&eacute;talos
mas ocultos con su prodigiosa nariz, aspira profundamente y regresa
con un suspiro satisfecho,</p>
<p>"Mmm, <em>rinofitofilia</em>", <a name="AEN895" href=
"#FTN.AEN895">[5]</a> dice, frotando su espalda.</p>
<p>El viaje hasta el restaurante toma menos de tres minutos. Por
recomendaci&oacute;n de Tim Ney, antiguo director ejecutivo de la
Fundaci&oacute;n para el Software Libre, he dejado a Stallman
escoger el restaurante. A pesar de que muchos periodistas se
concentran en el estilo de vida casi monacal de Stallman, lo cierto
es que Stallman es un epicuro comprometido en cuanto se refiere a
la comida. Uno de los beneficios adicionales de ser un misionero
viajero por la causa del Software Libre es la posibilidad de probar
comida exquisita de todas partes del mundo. "Visite cualquier
ciudad del mundo, y es probable que Richard sepa cu&aacute;l es el
mejor restaurante", dice Ney. "Richard tambi&eacute;n esta muy
orgulloso de saber que esta en el men&uacute;, y de ordenar para
toda la mesa."</p>
<p>Para la comida de hoy, Stallman ha escogido un
      <span class="SYSTEMITEM">restaurante canton&eacute;s</span> a
      dos calles de <i class="FOREIGNPHRASE">University Avenue</i>,
      la calle m&aacute;s importante de Palo Alto. La
      elecci&oacute;n esta parcialmente inspirada en la reciente
      visita de Stallman a China, con una parada para dictar una
      conferencia en la provincia de Guangdong, sumada a la
      aversi&oacute;n personal de Stallman hac&iacute;a la comida
      Hunanesa y Szechuana, m&aacute;s condimentada. "No soy
      realmente un fan&aacute;tico de la comida condimentada",
      admite Stallman.</p>
<p>Llegamos unos minutos despu&eacute;s de las 11 a.m. y ya somos
sometidos a una espera de veinte minutos. Dada la aversi&oacute;n
de los hackers por el tiempo perdido, yo contengo la
respiraci&oacute;n moment&aacute;neamente, esperando una
explosi&oacute;n. Stallman, contrariando mis expectativas, toma las
noticias con calma.</p>
<p>"Es una l&aacute;stima no haber podido encontrar nadie
m&aacute;s para que nos acompa&ntilde;ara", me dice. "Siempre es
mas divertido comer con un grupo de gente."</p>
<p>Mientras esperamos, Stallman practica unos pasos de danza. Sus
movimientos son t&iacute;midos pero h&aacute;biles. Discutimos
acerca de las &uacute;ltimas noticias. Stallman dice que su lo
&uacute;nico que lamenta de no haber asistido a LinuxWorld es no
haber podido estar presente en una conferencia que anunciaba el
lanzamiento de la Fundaci&oacute;n GNOME. Respaldada por Sun
Microsystems e IBM la fundaci&oacute;n es, de muchas maneras una
reivindicaci&oacute;n para Stallman, qui&eacute;n ha dicho por
mucho tiempo que el software libre y la econom&iacute;a de libre
mercado no tienen porqu&eacute; ser mutuamente excluyentes. Sin
embargo, Stallman permanece insatisfecho por el mensaje que
finalmente lleg&oacute; al p&uacute;blico.</p>
<p>"De la manera en que fue presentado, las compa&ntilde;ias
hablaron de Linux sin mencionar para nada al Proyecto GNU", dice
Stallman.</p>
<p>Estas decepciones contrastan la c&aacute;lida respuesta que
viene del otro lado del oceano, especialmente de Asia, nota
Stallman. Una mirada r&aacute;pida al itinerario de viajes de
Stallman durante el a&ntilde;o 2000 habla de la creciente
popularidad del mensaje del software libre. Entre sus recientes
visitas a India, China y Brasil, Stallman solo ha estado doce de
los &uacute;ltimos 115 d&iacute;as en suelo de los Estados Unidos.
Sus viajes le han dado la oportunidad de ver como el concepto de
software libre se traduce a diferentes idiomas y culturas.</p>
<p>"En la India mucha gente esta interesada en el software libre,
porqu&eacute; lo ven como una manera de crear una infraestructura
computacional sin gastar demasiado dinero", dice Stallman. "En
China el concepto se ha demorado mucho en ser entendido. Hacer la
comparaci&oacute;n entre software libre y libertad de
expresi&oacute;n es m&aacute;s dif&iacute;cil cuando no hay
libertad de expresi&oacute;n. A&uacute;n as&iacute;, el nivel de
inter&eacute;s en el software libre durante mi &uacute;ltima visita
era muy profundo."</p>
<p>La conversaci&oacute;n comienza a girar en torno a Napster, la
compa&ntilde;&iacute;a de software de San Mateo, California, que se
ha convertido en uno de los temas favoritos de los medios en los
&uacute;ltimos meses. La compa&ntilde;&iacute;a produce una
controvertida herramienta de software que les permite a los
mel&oacute;manos buscar y copiar los archivos de m&uacute;sica de
otros fan&aacute;ticos de la m&uacute;sica. Gracias al poder
magnificador de Internet, este programa de "persona a persona"
(<i class="FOREIGNPHRASE">peer to peer</i>) se ha convertido en una
caja de m&uacute;sica en l&iacute;nea, d&aacute;ndoles a todos los
aficionados a la m&uacute;sica la posibilidad de escuchar archivos
de MP3 en el computador sin pagar derechos, para disgusto de las
compa&ntilde;&iacute;as disqueras.</p>
<p>A pesar de estar basado en software propietario, el sistema de
Napster se inspira en la convicci&oacute;n de Stallman, largamente
sostenida, de que una vez un trabajo incursiona en el &aacute;mbito
digital --en otras palabras, una vez hacer una copia deja de ser
asunto de duplicar sonidos o duplicar &aacute;tomos, para
convertirse en asunto de duplicar informaci&oacute;n-- entonces es
m&aacute;s dif&iacute;cil restringir el impulso humano de compartir
un trabajo. En lugar de imponer restricciones, los ejecutivos de
Napster han decido aprovecharse de este impulso. D&aacute;ndole a
los mel&oacute;manos un lugar central para intercambiar archivos de
m&uacute;sica, la compa&ntilde;&iacute;a ha jugado con su habilidad
de enviar el tr&aacute;fico de usuarios resultante hac&iacute;a
otras oportunidades comerciales.</p>
<p>El repentino &eacute;xito del modelo de Napster ha asustado a
las compa&ntilde;&iacute;as de discos tradicionales, con muy buenas
razones. S&oacute;lo unos d&iacute;as antes de mi encuentro con
Stallman en Palo Alto, la juez de distrito Marilyn Patel
fall&oacute; a favor de la Asociaci&oacute;n de la Industria
Disquera de Am&eacute;rica (<i class="FOREIGNPHRASE">Recording
Industry Association of America</i>) en su moci&oacute;n contra el
sistema de compartir archivos. El fall&oacute; fue posteriormente
suspendido por la Novena Corte de Apelaciones de Distrito, pero
para principios de 2001 la misma Corte de Apelaciones
encontrar&iacute;a que la compa&ntilde;&iacute;a de San Mateo
estaba violando las leyes de derechos de autor, <a name="AEN924"
href="#FTN.AEN924">[6]</a> una decisi&oacute;n que la portavoz de
la RIAA, Hillary Rosen llamar&iacute;a mas tarde "una clara
victoria de la comunidad de contenido creativo y del
leg&iacute;timo mercado en l&iacute;nea" <a name="AEN928" href=
"#FTN.AEN928">[7]</a></p>
<p>Para hackers como Stallman, el modelo de negocios de Napster es
preocupante de varias maneras. La velocidad de la
compa&ntilde;&iacute;a para apropiarse de principios hackers
gastados por el tiempo, como el de compartir archivos y el de la
posesi&oacute;n comunal de la informaci&oacute;n, mientras que al
mismo tiempo venden un servicio basado en software propietario,
env&iacute;an un mensaje distorsionado de manera preocupante.
C&oacute;mo una persona que de por si tiene suficientes problemas
para hacer llegar su propio mensaje, cuidadosamente
art&iacute;culado, a los medios de comunicaci&oacute;n, es
entendible la reticencia de Stallman en el momento de hablar acerca
de la compa&ntilde;&iacute;a. Sin embargo, Stallman admite haber
aprendido una cosa o dos de la faceta social del fen&oacute;meno
Napster.</p>
<p>"Antes de Napster, yo pensaba que podr&iacute;a ser correcto que
la gente redistribuyera privadamente obras de entretenimiento",
dice Stallman. "La cantidad de personas a quienes Napster les
pareci&oacute; &uacute;til, sin embargo, me dice que el derecho de
redistribuir copias, no solo entre vecinos, sino para el
p&uacute;blico en general, es esencial y por lo tanto no puede ser
usurpado."</p>
<p>No ha terminado Stallman de decir esto y la puerta del
restaurante se abre y somos invitados adentro por el acomodador. Al
cabo de unos pocos segundos, estamos sentados en una esquina del
restaurante, adyacente a una gran pared cubierta con un espejo.</p>
<p>La carta del restaurante se dobla como un formulario de compra,
y Stallman esta marcando opciones antes incluso de que nos hayan
traido agua. "Rollo de camar&oacute;n frito envuento en nata de
fr&iacute;jol", lee Stallman. "Nata de fr&iacute;jol. Es una
textura tan interesante. Creo que deber&iacute;amos ordenarlo."</p>
<p>Este comentario nos lleva a una improvisada discusi&oacute;n
sobre la comina China y la reciente visita de Stallman a ese
pa&iacute;s. "La comida en China es absolutamente exquisita", dice
Stallman, a medida que su voz adquiere un toque de emoci&oacute;n
por primera vez en toda la ma&ntilde;ana. "Tantas cosas diferentes
que nunca he visto en EEUU, cosas locales hechas con hongos locales
y vegetales locales. Lleg&oacute; hasta el punto en el que
comenc&eacute; a llevar un diario, solo para llevar la cuenta de
cada una de las maravillosas comidas."</p>
<p>La conversaci&oacute;n contin&uacute;a con una discusi&oacute;n
sobre la cocina Coreana. Durante el mismo recorrido asi&aacute;tico
de Junio del 2000, Stallman hizo una visita a Corea del Sur. Su
llegada motiv&oacute; una peque&ntilde;a tormenta entre los medios
locales, gracias a una conferencia de software Coreano a la que
asisti&oacute; en fundador y presidente de Microsoft, Bill Gates y
que se llev&oacute; a cabo esa misma semana. Despu&eacute;s de ver
su foto encima de la de Gates en la primera p&aacute;gina del
principal peri&oacute;dico de Se&uacute;l, Stallman dice que lo
mejor del viaje fue la comida. "Prob&eacute; una taza de naeng
myun, que son fideos fr&iacute;os", dice Stallman. "Eran unos
fideos que causaban una sensaci&oacute;n muy interesante. La
mayor&iacute;a de lugares no usan exactamente el mismo tipo de
fideos para el naeng myun, por lo que puedo decir, con completa
certeza, que este fue el naeng myun mas exquisito que jam&aacute;s
haya probado."</p>
<p>El t&eacute;rmino "exquisito" es un gran elogio, viniendo de
Stallman. Se esto, porqu&eacute; unos momentos despu&eacute;s de
escuchar a Stallman poetizar acerca de naeng myun, siento sus ojos
de rayos l&aacute;ser perforando la parte de arriba de mi hombro
derecho.</p>
<p>"Detr&aacute;s de usted esta sentada la mujer m&aacute;s
exquisita", dice Stallman.</p>
<p>Me doy la vuelta para mirar, y s&oacute;lo alcanzo a echar una
ojeada a la espalda de una mujer. La mujer es joven,
aproximadamente de 25 a&ntilde;os y lleva un vestido blanco. Ella y
su compa&ntilde;ero est&aacute;n terminando de pagar la cuenta.
Cuando ambos se paran de la mesa, para abandonar el restaurante, me
entero sin mirar, porqu&eacute; los ojos de Stallman de repente
pierden algo de su intensidad.</p>
<p>"Oh, no," dice. "Se fueron. Y pensar que probablemente no la
vuelva a ver nunca."</p>
<p>Tras un breve suspiro, Stallman se recupera. El momento me da
una oportunidad para discutir la reputaci&oacute;n de Stallman
<span class="SYSTEMITEM">hac&iacute;a el sexo opuesto</span>. Esta
reputaci&oacute;n es a veces un poco contradictoria. Varios hackers
hablan de la predilecci&oacute;n de Stallman por saludar a las
mujeres con un beso en el dorso de la mano. <a name="AEN953"
   href="#FTN.AEN953">[8]</a> Un art&iacute;culo de Salon.com,
   aparecido el 26 de mayo del 2000, retrata a Stallman un poco
   como un hacker libertino. Documentando la relaci&oacute;n entre
   el software libre y el amor libre, la reportera Analee Newitz
   muestra a Stallman como algui&eacute;n que rechaza los valores
   tradicionales de la familia, cuando le dice "Yo creo en el amor,
   no en la monogamia" <a name="AEN955" href=
   "#FTN.AEN955">[9]</a></p>
<p>Stallman deja caer ligeramente su men&uacute; cuando traigo a
colaci&oacute;n el tema. "Bueno, la mayor&iacute;a de los hombres
parecen querer sexo y parecen tener una actitud bastante
despreciativa hac&iacute;a las mujeres", dice."Todas las mujeres
con las que se relacionan. No lo entiendo en absoluto."</p>
<p>Menciono el pasaje del libro [<span class="CITATION">Open
Sources</span>] en el que Stallman confiesa haber querido nombrar
el kernel de GNU, de destino incierto, con el nombre de su novia
del momento. El nombre de la novia era Alix, un nombre que encajaba
perfectamente con la conveci&oacute;n de los desarrolladores de
poner una "x" al final de cada nuevo nombre de kernel-- por
ejemplo, "Linux". Puesto que ella era administradora de un sistema
Unix, Stallman dice que habr&iacute;a sido un tributo a&uacute;n
m&aacute;s sentido. Desafortunadamente, anota Stallman, el
desarrollador principal del proyecto del kernel eventualmente lo
llam&oacute; HURD. <a name="AEN967" href="#FTN.AEN967">[10]</a> A
pesar de que Stallman y la mujer despu&eacute;s rompieron, la
historia suscita una pregunta casi autom&aacute;tica: A pesar de
todos las creaciones de los medios, que muestran a Stallman como un
fan&aacute;tico, &iquest;Es Richard Stallman realmente s&oacute;lo
un rom&aacute;ntico sin esperanzas, un Quijote errante, atacando
molinos corporativos en un esfuerzo por impresionar a una Dulcinea
a&uacute;n no identificada?</p>
<p>"Realmente no estaba tratando de ser rom&aacute;ntico", dice
Stallman recordando la historia de Alix. "Era m&aacute;s un asunto
de provocaci&oacute;n. Es decir, era rom&aacute;ntico pero a la vez
era provocativo. &iquest;Sabe? Habr&iacute;a sido una sorpresa
estupenda."</p>
<p>Por primera vez en toda la ma&ntilde;ana, Stallman rie. Yo
traigo al tema el asunto de los besos en la mano. "Si, yo hago
eso", dice Stallman. "He encontrado que es una manera de ofrecer
algo de afecto que muchas mujeres disfrutar&aacute;n. Es una
oportunidad de dar algo de afecto y de ser estimado por ello."</p>
<p>El afecto es un tema constante que aparece repetidamente en la
vida de Richard Stallman, y el es dolorosamente abierto al respecto
cuando se hacen las preguntas. "Realmente no ha habido demasiado
afecto en mi vida, excepto en mi mente", dice. Sin embargo, la
discusi&oacute;n r&aacute;pidamente se vuelve inc&oacute;moda.
Despu&eacute;s de algunas respuestas con monos&iacute;labos,
Stallman finalmente levanta su men&uacute;, dando por terminada la
pesquisa.</p>
<p>"&iquest;Le gustar&iacute;a algo de shimai?" pregunta.</p>
<p>Cuando llega la comida, la conversaci&oacute;n se mueve entre
los platos que van llegando. Discutimos la frecuentemente citada
propensi&oacute;n de los hackers por la comida China, las salidas
semanales a comer al Barrio Chino de Boston durante los d&iacute;as
de Stallman como programador de planta del laboratorio de IA, y la
l&oacute;gica que subyace el idioma Chino y su sistema de
escritura. Cada comentario de mi parte provoca una respuesta bien
informada de parte de Stallman.</p>
<p>"O&iacute; a algunas personas hablando Shangai&eacute;s la
&uacute;ltima vez que estuve en China", dice Stallman. "Era
interesante de oir. Sonaba bastante distinto [del mandar&iacute;n].
Hice que me dijeran palabras con ra&iacute;ces similares en
Mandar&iacute;n y en Shangai&eacute;s. En algunos casos es posible
ver las similitudes, pero yo me preguntaba si los tonos eran
similares. No lo son. Eso me parece interesante porqu&eacute; hay
una teor&iacute;a que dice que los tonos evolucionaron de
s&iacute;labas adicionales que se perdieron y fueron reemplazados.
Si eso es cierto, y he visto teor&iacute;as que dicen que eso
sucedi&oacute; en tiempos hist&oacute;ricos, entonces los dialectos
deben haber divergido antes de la p&eacute;rdida de estas
s&iacute;labas finales."</p>
<p>El primer plato, nabos fritos a la sart&eacute;n, ha llegado.
Tanto Stallman en como yo nos tomamos un momento para partir las
grandes tortas rectangulares, que huelen como repollo hervido pero
saben como rebanadas de papas fritas en tocino.</p>
<p>Decido retormar el tema de la falta de adaptaci&oacute;n,
pregunt&aacute;ndome si los a&ntilde;os de adolescencia de Stallman
lo condicionaron para abogar por causas impopulares, mas
notablemente su batalla contra corriente, desde 1994 para lograr
que los usuarios de computadores y los medios reemplazaran el
t&eacute;rmino popular "Linux" por "GNU/Linux".</p>
<p>"Creo que si me ayud&oacute;", dice Stallman, mientras mastica
un bocado. "Nunca he entendido lo que la presi&oacute;n de los
compa&ntilde;eros hace a otras personas. Creo que la raz&oacute;n
era que yo estaba tan irremediablemente rechazado que, para mi, no
hab&iacute;a nada que ganar si intentaba seguir cualquiera de las
modas. Todo habr&iacute;a sido exactamente igual. Seguir&iacute;a
igual de rechazado, por lo que no lo intente."</p>
<p>Stallman anota su gusto musical como un ejemplo clave de sus
tendencias contrarias a la masa. Cuando era una adolescente, y la
mayor&iacute;a de sus compa&ntilde;eros de clase escuchaban Motown
y Acid Rock, Stallman prefer&iacute;a la m&uacute;sica
cl&aacute;sica. El recuerdo lleva a un extra&ntilde;o y jocoso
episodio de los a&ntilde;os de bachillerato de Stallman. Luego de
la aparici&oacute;n de los Beatles en el Show de Ed Sullivan, en
1964, la mayor&iacute;a de los compa&ntilde;eros de clase de
Stallman se precipitaron a comprar los &uacute;ltimos
&aacute;lbumes y sencillos de los Beatles. All&iacute; y en ese
momento, dice Stallman, tom&oacute; la decisi&oacute;n de sabotear
a los Cuatro de Liverpool.</p>
<p>"Me gustaba alguna de la m&uacute;sica popular anterior a los
Beatles", dice Stallman. "Pero no me gustaban los Beatles. Me
disgustaba especialmente la manera salvaje en que la gente
reaccionaba ante ellos. Era algo as&iacute; como:
&iquest;Qui&eacute;n iba a hacer un montaje de los Beatles que
adulara mas a los Beatles?"</p>
<p>Cuando su sabotaje a los Beatles no funcion&oacute;, Stallman
busc&oacute; otras formas de hacer evidente la mentalidad de
reba&ntilde;o de sus compa&ntilde;eros. Stallman dice que considero
brevemente la posibilidad de formar &eacute;l mismo una banda de
rock dedicada a satirizar a los Beatles.</p>
<p>"La quer&iacute;a llamar <i class="FOREIGNPHRASE">Tokyo Rose and
the Japanese Beetles</i>." <a name="AEN988" href=
"#FTN.AEN988">[11]</a></p>
<p>Dada su pasi&oacute;n actual por la m&uacute;sica
folcl&oacute;rica internacional, le pregunt&eacute; a Stallman si
sent&iacute;a una afinidad similar por Bob Dylan y los otros
m&uacute;sicos folcl&oacute;ricos de comienzos de los sesentas.
Stallman sacude su cabeza. "Me gustaban Peter, Paul y Mary", dice.
"Eso me recuerda un gran <i class="FOREIGNPHRASE">filk</i>."</p>
<p>Cuando le pido una definici&oacute;n de "<i class=
"FOREIGNPHRASE">filk</i>, Stallman me explica el concepto. Un filk,
me dice, es una canci&oacute;n popular cuya letra se alter&oacute;
para ser reemplazada por unas letras de parodia. El proceso de
escribir "filks" es una actividad popular entre los hackers y los
aficionados a la ciencia ficci&oacute;n. La lista de filks
cl&aacute;sicos incluye "<i class="FOREIGNPHRASE">On Top of
Spaghetti</i>", una reescritura de "<i class="FOREIGNPHRASE">On Top
of Old Smokey</i>", y "Yoda", una modificaci&oacute;n tipo Guerra
de las Galaxias de la canci&oacute;n de los Kinks, "Lola", escrita
por el maestro de los filks "Weird" Al Yankovic.</p>
<p>Stallman me pregunta si estar&iacute;a interesado en escuchar el
filk folcl&oacute;rico. En el momento en que digo que si, la voz de
Stallman comienza a cantar en un tono inesperadamente claro:</p>
<a name="AEN1003"></a>
<blockquote class="BLOCKQUOTE">
<p>How much wood could a woodchuck chuck, If a woodchuck could
chuck wood? How many poles could a polak lock, If a polak could
lock poles? How many knees could a negro grow, If a negro could
grow knees? The answer, my dear, is stick it in your ear. The
answer is to stick it in your ear. <a name="AEN1005" href=
"#FTN.AEN1005">[12]</a></p></blockquote>
<p>La canci&oacute;n termina, y los labios de Stallman se doblan en
otra media sonrisa infantil. Yo observo de reojo en la mesas
cercanas. Las familias asi&aacute;ticas que disfrutan de su
almuerzo dominical le prestan poca atenci&oacute;n al cantante
barbado entre ellos. <a name="AEN1010" href="#FTN.AEN1010">[13]</a>
Despu&eacute;s de unos momentos de vacilaci&oacute;n, finalmente yo
tambi&eacute;n sonrio.</p>
<p>"&iquest;Quieres ese &uacute;ltimo bocado?" Pregunta Stallman,
con los ojos iluminados. Antes de que pueda da&ntilde;arle la
l&iacute;nea, Stallman toma el bollo de ma&iacute;z con sus dos
palillos y lo levanta orgulloso. "Tal vez deba ser yo quien tome el
&uacute;ltimo bocado" dice.</p>
<p>Tras terminar la comida, nuestra conversacion adquiere el ritmo
de una entrevista normal. Stallman reclina su asiento y toma una
taza de t&eacute; entre sus manos. Continuamos hablando acerca de
Napster y su relaci&oacute;n con el movimiento del software libre.
&iquest;Deber&iacute;an ser extendidos los principios del software
libre a &aacute;reas similares como la publicaci&oacute;n de
m&uacute;sica? Le pregunt&oacute;.</p>
<p>"Es un error copiar las respuesta de un sitio a otro", dice
Stallman, comparando la canciones con programas de software. "La
manera correcta es mirar cada tipo de trabajo y ver a que
conclusi&oacute;n se llega."</p>
<p>Cuando se refiere a los trabajos protegidos por derechos de
autor, Stallman dice que &eacute;l divide al mundo en tres
categor&iacute;as. La primera categor&iacute;a involucra las obras
"funcionales" -- programas de software, diccionarios y libros de
texto. La segunda categor&iacute;a tiene que ver con obras que
ser&iacute;an mejor descritas como "testimoniales" --trabajos
cient&iacute;ficos y documentos hist&oacute;ricos. Estas obras
cumplen una labor que se ver&iacute;a perjudicada si lectores o
autores tuvieran la posibilidad de modificarlos libremente. La
&uacute;ltima categor&iacute;a se refiere a las obras de
expresi&oacute;n personal --diarios, peri&oacute;dicos, y
autobiograf&iacute;as. Modificar esos documentos ser&iacute;a
alterar las impresiones o el punto de vista de una persona- una
acci&oacute;n que Stallman considera &eacute;ticamente
injustificable.</p>
<p>De las tres categor&iacute;as, la primera deber&iacute;a dar a
los usuarios el derecho ilimitado a crear versiones modificadas,
mientras que la segunda y la tercera deber&iacute;an regular ese
derecho de acuerdo con el autor original. Sin importar la
categor&iacute;a, sin embargo, la libertad de copiar y redistribuir
para fines no comerciales debe permanecer inalterada en todo
momento, insiste Stallman. Si eso implica darle a los usuarios de
Internet el derecho a generar cien copias de un art&iacute;culo,
canci&oacute;n, o libro, para despu&eacute;s enviarlas por correo
electr&oacute;nico a cien extra&ntilde;os, pues sea. "Es claro que
la redistribuci&oacute;n privada espor&aacute;dica debe ser
permitida, porque solo un estado polic&iacute;a puede detener eso",
dice Stallman. "Es antisocial interponerse entre la gente y sus
amigos. Napster me ha convencido de que tambi&eacute;n debemos
permitir, tenemos que permitir, incluso la distribuci&oacute;n no
comercial al p&uacute;blico, solo por diversi&oacute;n.
Porqu&eacute; hay tanta gente que lo quiere hacer y a quienes les
parece tan &uacute;til,"</p>
<p>Cuando le pregunto si los estrados judiciales aceptar&iacute;an
una visi&oacute;n tan permisiva, Stallman me interrumpe.</p>
<p>"Esa es la pregunta incorrecta", dice. "Quiero decir, ahora has
cambiado el tema completamente de uno de &eacute;tica a otro de
interpretaci&oacute;n de las leyes. Y esas son dos preguntas
totalmente diferentes del mismo campo. No tiene ninguna utilidad
saltar de una a la otra. Los estamentos judiciales
interpretar&aacute;n las leyes de manera dura, porqu&eacute; esa es
la manera en que esas leyes han sido compradas por quienes
publican."</p>
<p>El comentario proporciona una luz acerca de la filosof&iacute;a
pol&iacute;tica de Stallman: solo porqu&eacute; el sistema legal
actualmente respalda la capacidad de las empresas de tratar los
derechos de autor como el equivalente en software de la tierra, eso
no significa que los usuarios de computadores deban jugar de
acuerdo a esas mismas reglas. La libertad es un asunto
&eacute;tico, no un asunto legal. "Estoy viendo mas all&aacute; de
lo que son las leyes actuales, hacia lo que deber&iacute;an ser",
dice Stallman. "No estoy tratando de <span class=
"SYSTEMITEM">rehacer</span> la legislaci&oacute;n. Estoy pensando
en lo que la ley deber&iacute;a hacer. Considero que la
prohibici&oacute;n legal de compartir copias con tus amigos es el
equivalente moral de Jim Crow <a name="AEN1026" href=
"#FTN.AEN1026">[14]</a>. No merece respeto."</p>
<p>La menci&oacute;n de Jim Crow provoca otra pregunta. &iquest;Que
tanta influencia o inspiraci&oacute;n recibe Stallman de
l&iacute;deres pol&iacute;ticos del pasado? Como el movimiento de
los derechos civiles de las d&eacute;cadas del 50 y el 60, su
intento de generar cambios a nivel social se basa en un llamado a
valores atemporales: libertad, justicia y juego limpio.</p>
<p>Stallman divide su atenci&oacute;n entre mi analog&iacute;a y un
mech&oacute;n de cabello particularmente enredado. Cuando extiendo
la analog&iacute;a hasta el punto en el que comparo a Stallman con
el Dr. Martin Luther King, Jr., Stallman, me interrumpe.</p>
<p>"No tengo su nivel, pero si juego el mismo juego", dice.</p>
<p>Le sugiero a Malcolm X como otro punto de comparaci&oacute;n.
Como el otrora vocero de la Naci&oacute;n Isl&aacute;mica, Stallman
ha creado una reputaci&oacute;n de atraer la controversia,
enemistarse con aliados potenciales, y predicar un mensaje que
favorece la autosuficiencia sobre la integraci&oacute;n
cultural.</p>
<p>Stallman rechaza la comparaci&oacute;n. "Mi mensaje es mas
cercano al del doctor King. Es un mensaje de firme condena a
ciertas pr&aacute;cticas que maltratan al otro. No es un mensaje de
odio hac&iacute;a nadie. Y no esta orientado a un grupo reducido de
gente. Yo invito a cualquiera a valorar la libertad, y a tener
libertad.</p>
<p>A&uacute;n as&iacute;, una actitud sospechosa hac&iacute;a las
alianzas pol&iacute;ticas permanece como un rasgo fundamental de la
personalidad de Stallman. En el caso de su bien publicado disgusto
por el t&eacute;rmino "software de fuente abierta" (<i class=
"FOREIGNPHRASE">Open Source</i>), su falta de voluntad para
participar en proyectos recientes de coalici&oacute;n parece
entendible. Como un hombre que ha dedicado las dos &uacute;ltimas
d&eacute;cadas a luchar por la causa del software libre, el capital
pol&iacute;tico de Stallman esta profundamente invertido en el
t&eacute;rmino. As&iacute;, comentarios como aquel de "Han Solo" en
LinuxWorld de 1999 no han hecho m&aacute;s que reforzar la
reputaci&oacute;n de Stallman en la industria del software. Una
reputaci&oacute;n que lo describe como un hombre descontento, que
no esta dispuesto a moverse al ritmo de las modas pol&iacute;ticas
o de mercadeo.</p>
<p>"Yo admiro y respeto a Richard por todo el trabajo que ha
hecho", dice el presidente de Red Hat, Robert Young, resumiendo la
naturaleza pol&iacute;tica parad&oacute;jica de Stallman. "Mi
&uacute;nica cr&iacute;tica es que a veces Richard trata a sus
amigos peor que a sus enemigos."</p>
<p>La renuencia de Stallman a buscar alianzas aparece igual de
asombrosa cuando se consideran los intereses pol&iacute;ticos de
Stallman fuera del movimiento de software libre. Visite las
oficinas de Stallman en MIT, y encontrar&aacute;
instant&aacute;neamente un dep&oacute;sito de art&iacute;culos
noticiosos de izquierda que se refieren a abusos de los derechos
civiles alrededor del mundo. Visite su p&aacute;gina web, y
encontrar&aacute; diatribas contra el Digital Millennium Copyright
Act, la guerra contra las drogas y la Organizaci&oacute;n Mundial
de Comercio.</p>
<p>Dadas sus tendencias de activista, yo pregunto, &iquest;Por
qu&eacute; no a buscado Stallman ser oido de manera mas amplia?
&iquest;Por qu&eacute; no ha usado su prominencia en el mundo
hacker como una plataforma para aumentar, en lugar de reducir, su
voz pol&iacute;tica?</p>
<p>Stallman deja caer su enredado cabello y contempla la pregunta
por un momento.</p>
<p>"Dudo en si exagerar la importancia de este peque&ntilde;o
charco de libertad", dice. "Porqu&eacute; las &aacute;reas mas
conocidas y convencionales del trabajo por la libertad y por una
sociedad mejor son tremendamente importantes. No podr&iacute;a
decir que el software libre es tan importante como ellas. Es la
responsabilidad que yo asum&iacute;, porqu&eacute; cay&oacute; en
mi regazo y vi una manera en la que yo pod&iacute;a hacer algo al
respecto. Pero, por ejemplo, terminar con la brutalidad policial,
acabar la guerra contra las drogas, exterminar las formas de
racismo que a&uacute;n conservamos, ayudar a todos a tener una vida
confortable, proteger los derechos de quienes realizan abortos,
protegernos de la teocrac&iacute;a, estos son temas tremendamente
importantes, mucho m&aacute;s importantes que lo que hago yo. Solo
quisiera saber como hacer algo al respecto."</p>
<p>Una vez m&aacute;s, Stallman presenta su actividad
pol&iacute;tica como una funci&oacute;n de su convencimiento
personal. Dada la cantidad de tiempo que le ha tomado desarrollar y
ver crecer las doctrinas fundamentales del movimiento para el
software libre, Stallman duda en el momento de involucrarse con
otras causas o movimientos que lo puedan llevar a territorio
desconocido.</p>
<p>"Me gustar&iacute;a saber como hacer una diferencia importante
en esos asuntos importantes, porqu&eacute; me sentir&iacute;a
tremendamente orgulloso si pudiera hacerlo, pero es muy
dif&iacute;cil y mucha gente que es probablemente mejor que yo ha
estado intent&aacute;ndolo, llegando solo hasta cierto punto",
dice. "Pero como yo lo veo, mientras otras personas se estaban
defendiendo contra estas amenazas enormes y evidentes, yo vi otra
amenaza que no estaba siendo vigilada. Y fu&iacute; a formar la
defensa contra esa amenaza. Puede no ser una amenaza tan grande,
pero yo era el &uacute;nico all&iacute;."</p>
<p>Finalmente, Stallman sugiere pagar la cuenta. Antes de que el
mesero pueda llev&aacute;rsela, sin embargo, Stallman saca un
billete de un d&oacute;lar coloreado de blanco y lo pone en la
pila. El billete es tan evidentemente falso que no puedo evitar
tomarlo y leerlo. Claro, es una falsificaci&oacute;n. En lugar de
llevar la imagen de George Washington o Abraham Lincon, el frente
del billete presenta la imagen de un cerdo de caricatura. En lugar
de decir <i class="FOREIGNPHRASE">United States of America</i>, el
letrero sobre el cerdo dice <i class="FOREIGNPHRASE">"United Swines
of Avarice"</i> (Seres detestables unidos de la avaricia). El
billete es de cero d&oacute;lares, y cuando el mesero recoje el
dinero, Stallman se asegura de halarle la manga.</p>
<p>"A&ntilde;ad&iacute; un cero de m&aacute;s a su propina", dice
Stallman, y una vez m&aacute;s media sonrisa aparece en sus
labios.</p>
<p>El mesero, sin comprender, o enga&ntilde;ado por el billete,
sonr&iacute;e y se aleja r&aacute;pidamente.</p>
<p>"Creo que eso significa que somos libres para irnos", dice
Stallman.</p></div>
<h3 class="FOOTNOTES">Notas</h3>
<table border="0" class="FOOTNOTES" width="100%">
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN803"
   href="chapter-5.html#AEN803">[1]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Andrew Leonard, <i class="FOREIGNPHRASE">"The Saint of Free
Software"</i>, [<span class="CITATION">Salon.com</span>] (Agosto
1998).
http://www.salon.com/21st/feature/1998/08/cov_31feature.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN808"
   href="chapter-5.html#AEN808">[2]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Leander Kahney, <i class="FOREIGNPHRASE">"Linux's Forgotten
Man"</i> (El Hombre Olvidado de Linux), [<span class=
"CITATION"><i class="FOREIGNPHRASE">Wired News</i></span>] (Marzo
5, 1999).
http://www.wired.com/news/print/012941829100.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN815"
   href="chapter-5.html#AEN815">[3]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver <i class="FOREIGNPHRASE">"Programmer on moral high ground;
Free software is a moral issue for Richard Stallman believes in
freedom and free software."</i>(Programador en el curubito moral;
El Software Libre es un asunto de moral pues Richard Stallman cree
en la libertad y el software libre [<span class="CITATION">London
Guardian</span>] (Noviembre 6, 1999). Esta es solamente una
peque&ntilde;a muestra de las comparaciones religiosas. Hasta hoy
la comparaci&oacute;n m&aacute;s extrema ha sido la hecha por Linus
Torvalds qui&eacute;n, en su autobiograf&iacute;a --ver Linus
Torvalds y David Diamond, [<span class="CITATION"><i class=
"FOREIGNPHRASE">Just For Fun: The Story of an Accidentaly
Revolutionary</i></span>] (S&oacute;lo por Diversi&oacute;n: La
Historia de un Revolucionario Accidental) (HarperCollins
Publishers, Inc., 2001): 58--escribe "Richard Stallman es el Dios
del Software Libre." Una menci&oacute;n de honor va para Larry
Lessig, qui&eacute;n, en una descripci&oacute;n de pie de
p&aacute;gina de su libro --ver Larry Lessig, [<span class=
"CITATION"><i class="FOREIGNPHRASE">The Future of
Ideas</i></span>](El Futuro de las Ideas) (Random House, 2001): 270
-- asimila a Stallman con Mois&eacute;s:</p>
<a name="AEN823"></a>
<blockquote class="BLOCKQUOTE">
<p>&hellip; como con Mois&eacute;s, fue otro l&iacute;der, Linus
Torvalds, qui&eacute;n finalmente llev&oacute; al movimiento a la
tierra prometida, facilitando el desarrollo de la parte final del
rompecabezas del Sistema Operativo. Como Mois&eacute;s, Stallman es
respetado y criticado por aliados dentro del movimiento. El es el
l&iacute;der inflexible, y por ello inspirador, de un aspecto
cr&iacute;tico de la cultura moderna. Tengo un respeto profundo
hac&iacute;a los principios y el nivel de compromiso de este
extraordinario individuo, y tambi&eacute;n guardo un gran respeto
hac&iacute;a aquellos lo suficientemente valientes como para
cuestionar su manera de pensar y despu&eacute;s soportar su
ira.</p></blockquote>
<p>En una &uacute;ltima entrevista, le pregunt&eacute; a Stallman
que pensaba acerca de las comparaciones religiosas. "Algunas
personas me comparan con un profeta del Antiguo Testamento. La
raz&oacute;n es que los profetas afirmaban que algunas
pr&aacute;cticas eran incorrectas. Ellos no hac&iacute;an
concesiones con asuntos de moral, no pod&iacute;an ser comprados y
eran usualmente despreciados."</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN853"
   href="chapter-5.html#AEN853">[4]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Leander Kahney, "<i class="FOREIGNPHRASE">Linux's Forgotten
Man</i>" (El Hombre Olvidado de Linux), [<span class=
"CITATION">Wired News</span>] (Marzo 5, 1999).
http://www.wired.com/news/print/012941829100.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN895"
   href="chapter-5.html#AEN895">[5]</a></td>
<td align="left" valign="top" width="95%">
<p>En ese momento, pens&eacute; que Stallman se estaba refiriendo
al nombre cient&iacute;fico de la flor. Meses despu&eacute;s supe
que <em>rhinofitofilia</em> era una referencia c&oacute;mica a la
actividad, i.e., Stallman metiendo su nariz dentro de una flor y
disfrutando el momento. Para conocer otro incidente c&oacute;mico
de Stallman con las flores visite:
http://www.stallman.org/texas.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN924"
   href="chapter-5.html#AEN924">[6]</a></td>
<td align="left" valign="top" width="95%">
<p>Cecily Barnes y Scott Ard, <i class="FOREIGNPHRASE">"Court
Grants Stay of Napster Injunction"</i> (La Corte mantiene delito de
Napster), [<span class="CITATION">News.com</span>] (Julio 28,
2000).
http://news.cnet.com/news/0-1005-200-2376465.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN928"
   href="chapter-5.html#AEN928">[7]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver <i class="FOREIGNPHRASE">"A Clear Victory for Recording
Industry in Napster Case"</i>, ("Una Clara Victoria para la
Industria Disquera en el caso Napster") comunicado de prensa de la
RIAA (Febrero 12 de 2001).
http://www.riaa.com/PR_story.cfm?id=372</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN953"
   href="chapter-5.html#AEN953">[8]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Mae Ling Mak, "Mae Ling's Story" (La historia de Mae Ling)
(Diciembre 17, 1998).
http://www.crackmonkey.org/pipermail/crackmonkey/1998q4/003006.htm
Hasta ahora, Mak es la &uacute;nica persona que he encontrado
dispuesta a hablar respecto a esta pr&aacute;ctica, a pesar de que
he escuchado esto de otras fuentes femeninas. Mak, a pesar de
expresar un rechazo inicial, finalmente logro dejar de lado su
desconfianza y bailar con Stallman en LinuxWorld en 1999.
http://www.linux.com/interact/potd.phtml?potd_id=44</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN955"
   href="chapter-5.html#AEN955">[9]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Annalee Newitz, <i class="FOREIGNPHRASE">"If Code is Free
Why Not Me?"</i> (Si el C&oacute;digo es Libre, &iquest;Por
qu&eacute; no Yo? [<span class="CITATION">Salon.com</span>] (Mayo
26, 2000).
http://www.salon.com/tech/feature/2000/05/26/free_love/print.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN967"
   href="chapter-5.html#AEN967">[10]</a></td>
<td align="left" valign="top" width="95%">
<p>Ver Richard Stallman, "The GNU Operating System and the Free
Software Movement" (El Sistema Operativo GNU y el Movimiento del
Software Libre), [<span class="CITATION">Open Sources</span>]
(O'Reilly &amp; Associates, Inc., 1999): 65.</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN988"
   href="chapter-5.html#AEN988">[11]</a></td>
<td align="left" valign="top" width="95%">
<p>La Rosa de Tokio y los Escarabajos Japoneses</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1005"
   href="chapter-5.html#AEN1005">[12]</a></td>
<td align="left" valign="top" width="95%">
<p>La traducci&oacute;n de la canci&oacute;n no tiene ning&uacute;n
sentido, puesto que se pierden los juegos de palabras y la
rima:</p>
<a name="AEN1007"></a>
<blockquote class="BLOCKQUOTE">
<p>&iquest;Que tanta madera podr&iacute;a una marmota morder, si
una marmota pudiera morder madera? &iquest;Cu&aacute;ntos postes
podr&iacute;a un polak bloquear, si un polack pudiera bloquear
postes? &iquest;Cu&aacute;ntas rodillas le podr&iacute;an crecer a
un negro, si las rodillas le pudieran crecer a un negro? La
respuesta, querida es ponlo en tu oreja. La respuesta es ponerlo en
tu oreja.</p></blockquote></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1010"
   href="chapter-5.html#AEN1010">[13]</a></td>
<td align="left" valign="top" width="95%">
<p>Para mas filks de Stallman, visite
http://www.stallman.org/doggerel.html. Para o&iacute;r a Stallman
cantando "La Canci&oacute;n del Software Libre", visite
http://www.gnu.org/music/free-software-song.html</p></td></tr>
<tr>
<td align="left" valign="top" width="5%"><a name="FTN.AEN1026"
   href="chapter-5.html#AEN1026">[14]</a></td>
<td align="left" valign="top" width="95%">
<p>El t&eacute;rmino Jim Crow se origin&oacute; hac&iacute;a 1830,
y se convirti&oacute; en un s&iacute;mbolo de la segregaci&oacute;n
racial aplicada en los estados del sur de los Estados Unidos.</p>
<p>El termino "Leyes de Jim Crow" se refer&iacute;a a todo el
aparato legislativo que hac&iacute;a posible la segregaci&oacute;n
racial y la separaci&oacute;n de razas en los lugares
p&uacute;blicos. (Nota del traductor)</p></td></tr></table>
<div class="NAVFOOTER">
<hr align="left" width="100%">
<table summary="Footer navigation table" width="100%" border="0"
       cellpadding="0" cellspacing="0">
<tr>
<td width="33%" align="left" valign="top"><a href="chapter-4.html"
accesskey="P">Anterior</a></td>
<td width="34%" align="center" valign="top"><a href="index.html"
accesskey="H">Inicio</a></td>
<td width="33%" align="right" valign="top"><a href="chapter-6.html"
accesskey="N">Siguiente</a></td></tr>
<tr>
<td width="33%" align="left" valign="top">Impeach God</td>
<td width="34%" align="center" valign="top">&nbsp;</td>
<td width="33%" align="right" valign="top">La comuna de
Emacs</td></tr></table></div>
</body>
</html>
